
TrackingEyeDB = {
	["profileKeys"] = {
		["Erza - 龙之召唤"] = "Erza - 龙之召唤",
		["牛魔术师 - 龙之召唤"] = "牛魔术师 - 龙之召唤",
		["秋天的栗子 - 法拉克斯"] = "秋天的栗子 - 法拉克斯",
		["夏天的栗子 - 龙之召唤"] = "夏天的栗子 - 龙之召唤",
		["秋天的栗子 - 龙之召唤"] = "秋天的栗子 - 龙之召唤",
		["九呜呜 - 龙之召唤"] = "九呜呜 - 龙之召唤",
		["哈哈牛往 - 龙之召唤"] = "哈哈牛往 - 龙之召唤",
		["五二七 - 龙之召唤"] = "五二七 - 龙之召唤",
		["哈哈呜呜 - 龙之召唤"] = "哈哈呜呜 - 龙之召唤",
		["无小小 - 龙之召唤"] = "无小小 - 龙之召唤",
		["春天的栗子 - 龙之召唤"] = "春天的栗子 - 龙之召唤",
	},
	["profiles"] = {
		["Erza - 龙之召唤"] = {
		},
		["牛魔术师 - 龙之召唤"] = {
		},
		["秋天的栗子 - 法拉克斯"] = {
		},
		["夏天的栗子 - 龙之召唤"] = {
		},
		["秋天的栗子 - 龙之召唤"] = {
		},
		["九呜呜 - 龙之召唤"] = {
		},
		["哈哈牛往 - 龙之召唤"] = {
		},
		["五二七 - 龙之召唤"] = {
		},
		["哈哈呜呜 - 龙之召唤"] = {
		},
		["无小小 - 龙之召唤"] = {
		},
		["春天的栗子 - 龙之召唤"] = {
		},
	},
}
