
ExAE_Config = {
	["Derek@Enigma"] = {
		{
			["Finger0Slot"] = {
				["name"] = "阿代古斯之眼",
				["link"] = "item:5266::::::::58:::1::::",
			},
			["BackSlot"] = {
				["name"] = "密林披风",
				["link"] = "item:19121:903:::::::58:::11::::",
			},
			["Trinket0Slot"] = {
				["name"] = "灵巧秒表",
				["link"] = "item:2820::::::::58:::11::::",
			},
			["TabardSlot"] = {
			},
			["FeetSlot"] = {
				["name"] = "全法长靴",
				["link"] = "item:11822::::::::58:::1::::",
			},
			["NeckSlot"] = {
				["name"] = "圣使护符",
				["link"] = "item:7722::::::::58:::1::::",
			},
			["Finger1Slot"] = {
				["name"] = "药剂师戒指",
				["link"] = "item:15702::::::::58:::11::::",
			},
			["ChestSlot"] = {
				["name"] = "梦纹外衣",
				["link"] = "item:10021:928:::::::58:::::::",
			},
			["Trinket1Slot"] = {
				["name"] = "天选者印记",
				["link"] = "item:17774::::::::58:::11::::",
			},
			["ShoulderSlot"] = {
				["name"] = "绿宝石护肩",
				["link"] = "item:4197::::::::58:::11::::",
			},
			["MainHandSlot"] = {
				["name"] = "祖穆拉恩的能量法杖",
				["link"] = "item:18082:1897:::::::58:::1::::",
			},
			["AmmoSlot"] = {
			},
			["RangedSlot"] = {
				["name"] = "自然之息",
				["link"] = "item:19118::::::::58:::11::::",
			},
			["ShirtSlot"] = {
				["name"] = "棕色亚麻衬衣",
				["link"] = "item:4344::::::::58:::::::",
			},
			["SecondaryHandSlot"] = {
			},
			["HeadSlot"] = {
				["name"] = "珠光头饰",
				["link"] = "item:10751::::::::58:::11::::",
			},
			["WristSlot"] = {
				["name"] = "希兹尔的管道清洁器",
				["link"] = "item:11917:905:::::::58:::11::::",
			},
			["WaistSlot"] = {
				["name"] = "虔诚腰带",
				["link"] = "item:16696::::::::58:::1::::",
			},
			["LegsSlot"] = {
				["name"] = "阿塔莱预言者褶裙",
				["link"] = "item:10807:1843:::::::58:::1::::",
			},
			["HandsSlot"] = {
				["name"] = "虔诚护手",
				["link"] = "item:16692::::::::58:::1::::",
			},
		}, -- [1]
		{
			["Finger0Slot"] = {
				["name"] = "阿代古斯之眼",
				["link"] = "item:5266::::::::58:::1::::",
			},
			["BackSlot"] = {
				["name"] = "密林披风",
				["link"] = "item:19121:903:::::::58:::11::::",
			},
			["Trinket0Slot"] = {
				["name"] = "祝福珠串",
				["link"] = "item:19990::::::::58:::11::::",
			},
			["TabardSlot"] = {
			},
			["FeetSlot"] = {
				["name"] = "全法长靴",
				["link"] = "item:11822::::::::58:::1::::",
			},
			["NeckSlot"] = {
				["name"] = "圣使护符",
				["link"] = "item:7722::::::::58:::1::::",
			},
			["Finger1Slot"] = {
				["name"] = "药剂师戒指",
				["link"] = "item:15702::::::::58:::11::::",
			},
			["ChestSlot"] = {
				["name"] = "梦纹外衣",
				["link"] = "item:10021:928:::::::58:::::::",
			},
			["Trinket1Slot"] = {
				["name"] = "天选者印记",
				["link"] = "item:17774::::::::58:::11::::",
			},
			["ShoulderSlot"] = {
				["name"] = "绿宝石护肩",
				["link"] = "item:4197::::::::58:::11::::",
			},
			["MainHandSlot"] = {
				["name"] = "祖穆拉恩的能量法杖",
				["link"] = "item:18082:1897:::::::58:::1::::",
			},
			["AmmoSlot"] = {
			},
			["RangedSlot"] = {
				["name"] = "自然之息",
				["link"] = "item:19118::::::::58:::11::::",
			},
			["ShirtSlot"] = {
				["name"] = "棕色亚麻衬衣",
				["link"] = "item:4344::::::::58:::::::",
			},
			["SecondaryHandSlot"] = {
			},
			["HeadSlot"] = {
				["name"] = "珠光头饰",
				["link"] = "item:10751::::::::58:::11::::",
			},
			["WristSlot"] = {
				["name"] = "镣铐护腕",
				["link"] = "item:11962::::::::58:::11::::",
			},
			["WaistSlot"] = {
				["name"] = "虔诚腰带",
				["link"] = "item:16696::::::::58:::1::::",
			},
			["LegsSlot"] = {
				["name"] = "阿塔莱预言者褶裙",
				["link"] = "item:10807:1843:::::::58:::1::::",
			},
			["HandsSlot"] = {
				["name"] = "虔诚护手",
				["link"] = "item:16692::::::::58:::1::::",
			},
		}, -- [2]
		{
			["Finger0Slot"] = {
				["name"] = "阿代古斯之眼",
				["link"] = "item:5266::::::::58:::1::::",
			},
			["BackSlot"] = {
				["name"] = "密林披风",
				["link"] = "item:19121:903:::::::58:::11::::",
			},
			["Trinket0Slot"] = {
				["name"] = "银色黎明委任徽章",
				["link"] = "item:12846::::::::58:::11::::",
			},
			["TabardSlot"] = {
			},
			["FeetSlot"] = {
				["name"] = "全法长靴",
				["link"] = "item:11822::::::::58:::1::::",
			},
			["NeckSlot"] = {
				["name"] = "圣使护符",
				["link"] = "item:7722::::::::58:::1::::",
			},
			["Finger1Slot"] = {
				["name"] = "药剂师戒指",
				["link"] = "item:15702::::::::58:::11::::",
			},
			["ChestSlot"] = {
				["name"] = "梦纹外衣",
				["link"] = "item:10021:928:::::::58:::::::",
			},
			["Trinket1Slot"] = {
				["name"] = "天选者印记",
				["link"] = "item:17774::::::::58:::11::::",
			},
			["ShoulderSlot"] = {
				["name"] = "绿宝石护肩",
				["link"] = "item:4197::::::::58:::11::::",
			},
			["MainHandSlot"] = {
				["name"] = "祖穆拉恩的能量法杖",
				["link"] = "item:18082:1897:::::::58:::1::::",
			},
			["HandsSlot"] = {
				["name"] = "虔诚护手",
				["link"] = "item:16692::::::::58:::1::::",
			},
			["LegsSlot"] = {
				["name"] = "阿塔莱预言者褶裙",
				["link"] = "item:10807:1843:::::::58:::1::::",
			},
			["ShirtSlot"] = {
				["name"] = "棕色亚麻衬衣",
				["link"] = "item:4344::::::::58:::::::",
			},
			["WaistSlot"] = {
				["name"] = "虔诚腰带",
				["link"] = "item:16696::::::::58:::1::::",
			},
			["WristSlot"] = {
				["name"] = "希兹尔的管道清洁器",
				["link"] = "item:11917:905:::::::58:::11::::",
			},
			["HeadSlot"] = {
				["name"] = "珠光头饰",
				["link"] = "item:10751::::::::58:::11::::",
			},
			["SecondaryHandSlot"] = {
			},
			["RangedSlot"] = {
				["name"] = "自然之息",
				["link"] = "item:19118::::::::58:::11::::",
			},
			["AmmoSlot"] = {
			},
		}, -- [3]
		["CurrentSetId"] = 2,
	},
}
