
FLogVars = {
	["enabled"] = false,
	["lockMinimapButton"] = false,
	["todayKills"] = {
	},
	["inInstance"] = false,
	["viewTotal"] = false,
	["currentFarm"] = "default",
	["ver"] = 1.2,
	["itemTooltip"] = true,
	["hud"] = {
		["show"] = false,
		["locked"] = false,
	},
	["farms"] = {
		["default"] = {
			["current"] = {
				["ah"] = 347999,
				["skill"] = {
				},
				["kills"] = {
					["黑暗院长加丁"] = 1,
					["通灵学院管理者"] = 3,
					["通灵魔"] = 4,
					["生病的食尸鬼"] = 10,
					["复活的侍从"] = 14,
					["复活的构造体"] = 3,
					["通灵学院亡灵法师"] = 12,
					["通灵学院新学徒"] = 9,
					["黑暗之影"] = 5,
					["复活的保卫者"] = 4,
					["复生的尸体"] = 6,
					["未知"] = 1,
					["老鼠"] = 26,
					["鬼灵导师"] = 6,
					["莱斯·霜语"] = 1,
					["维尔顿·巴罗夫"] = 1,
					["碎裂的骷髅"] = 5,
					["虚弱的尸体"] = 22,
					["复活的畸形骷髅"] = 6,
					["血骨傀儡"] = 1,
					["阿雷克斯·巴罗夫"] = 1,
					["拉文尼亚"] = 1,
					["通灵学院侍僧"] = 11,
					["瘟疫龙崽"] = 13,
					["瑟尔林·卡斯迪诺夫教授"] = 1,
					["复活的卫兵"] = 11,
					["伊露希亚·巴罗夫"] = 1,
					["鬼灵研究员"] = 2,
					["通灵学院黑暗召唤师"] = 4,
					["博学者普克尔特"] = 1,
					["通灵学院通灵师"] = 8,
					["鬼灵教师"] = 1,
					["通灵学院专家"] = 14,
					["传令官基尔图诺斯"] = 1,
					["复活的战士"] = 2,
					["复活的骷髅守卫"] = 4,
					["讲师玛丽希亚"] = 1,
				},
				["gold"] = 43347,
				["deaths"] = 0,
				["vendor"] = 93065,
				["drops"] = {
					["黑暗院长加丁"] = {
					},
					["通灵学院管理者"] = {
					},
					["通灵魔"] = {
						["|cffffffff|Hitem:12841::::::::_:::::::|h[侵略者的天灾石]|h|r"] = {
							1, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
						["|cff9d9d9d|Hitem:4585::::::::_:::::::|h[滴水的蜘蛛头]|h|r"] = {
							1, -- [1]
							583, -- [2]
							583, -- [3]
							"V", -- [4]
						},
					},
					["生病的食尸鬼"] = {
						["|cff9d9d9d|Hitem:13823::::::::_:::1::::|h[坚硬的法杖]|h|r"] = {
							1, -- [1]
							11924, -- [2]
							11924, -- [3]
							"V", -- [4]
						},
						["|cffffffff|Hitem:6530::::::::_:::::::|h[夜色虫]|h|r"] = {
							1, -- [1]
							25, -- [2]
							25, -- [3]
							"V", -- [4]
						},
						["|cffffffff|Hitem:12841::::::::_:::::::|h[侵略者的天灾石]|h|r"] = {
							1, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
					},
					["复活的侍从"] = {
					},
					["复活的构造体"] = {
					},
					["通灵学院亡灵法师"] = {
						["|cffffffff|Hitem:14047::::::::_:::::::|h[符文布]|h|r"] = {
							8, -- [1]
							3200, -- [2]
							400, -- [3]
							"V", -- [4]
						},
						["|cffffffff|Hitem:12841::::::::_:::::::|h[侵略者的天灾石]|h|r"] = {
							2, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
						["|cff1eff00|Hitem:20520::::::::_:::::::|h[黑暗符文]|h|r"] = {
							1, -- [1]
							2000, -- [2]
							2000, -- [3]
							"V", -- [4]
						},
					},
					["通灵学院新学徒"] = {
						["|cffffffff|Hitem:12841::::::::_:::::::|h[侵略者的天灾石]|h|r"] = {
							2, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
						["|cffffffff|Hitem:14047::::::::_:::::::|h[符文布]|h|r"] = {
							5, -- [1]
							2000, -- [2]
							400, -- [3]
							"V", -- [4]
						},
					},
					["黑暗之影"] = {
					},
					["复活的保卫者"] = {
					},
					["复生的尸体"] = {
					},
					["未知"] = {
						["|cff0070dd|Hitem:14344::::::::_:::::::|h[大块魔光碎片]|h|r"] = {
							1, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
						["|cff1eff00|Hitem:10169::::::629:2012474112:_:::1::::|h[灵猴之圣殿骑士腿铠]|h|r"] = {
							1, -- [1]
							14230, -- [2]
							14230, -- [3]
							"V", -- [4]
						},
						["|cff1eff00|Hitem:12844::::::::_:::::::|h[银色黎明勇气勋章]|h|r"] = {
							7, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
						["|cff0070dd|Hitem:14503::::::::_:::1::::|h[死亡指节]|h|r"] = {
							1, -- [1]
							19652, -- [2]
							19652, -- [3]
							"V", -- [4]
						},
						["|cff1eff00|Hitem:20520::::::::_:::::::|h[黑暗符文]|h|r"] = {
							7, -- [1]
							14000, -- [2]
							2000, -- [3]
							"V", -- [4]
						},
						["|cff0070dd|Hitem:14636::::::::_:::1::::|h[苍白腰带]|h|r"] = {
							1, -- [1]
							12476, -- [2]
							12476, -- [3]
							"V", -- [4]
						},
						["|cff0070dd|Hitem:16684::::::::_:::1::::|h[博学者手套]|h|r"] = {
							1, -- [1]
							347999, -- [2]
							347999, -- [3]
							"S", -- [4]
						},
						["|cff1eff00|Hitem:12843::::::::_:::::::|h[堕落者的天灾石]|h|r"] = {
							6, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
						["|cff1eff00|Hitem:16203::::::::_:::::::|h[强效不灭精华]|h|r"] = {
							2, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
					},
					["老鼠"] = {
					},
					["鬼灵导师"] = {
					},
					["莱斯·霜语"] = {
					},
					["维尔顿·巴罗夫"] = {
					},
					["碎裂的骷髅"] = {
					},
					["虚弱的尸体"] = {
					},
					["复活的畸形骷髅"] = {
					},
					["血骨傀儡"] = {
					},
					["阿雷克斯·巴罗夫"] = {
					},
					["拉文尼亚"] = {
					},
					["通灵学院侍僧"] = {
						["|cffffffff|Hitem:12841::::::::_:::::::|h[侵略者的天灾石]|h|r"] = {
							1, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
						["|cffffffff|Hitem:14047::::::::_:::::::|h[符文布]|h|r"] = {
							3, -- [1]
							1200, -- [2]
							400, -- [3]
							"V", -- [4]
						},
					},
					["瘟疫龙崽"] = {
						["|cff9d9d9d|Hitem:4557::::::::_:::::::|h[青绿石碎片]|h|r"] = {
							1, -- [1]
							225, -- [2]
							225, -- [3]
							"V", -- [4]
						},
						["|cffffffff|Hitem:13920::::::::_:::::::|h[健康的龙鳞]|h|r"] = {
							1, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
						["|cffffffff|Hitem:12840::::::::_:::::::|h[爪牙的天灾石]|h|r"] = {
							2, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
					},
					["瑟尔林·卡斯迪诺夫教授"] = {
					},
					["复活的卫兵"] = {
						["|cffffffff|Hitem:7972::::::::_:::::::|h[亡灵腐液]|h|r"] = {
							1, -- [1]
							400, -- [2]
							400, -- [3]
							"V", -- [4]
						},
						["|cffffffff|Hitem:14047::::::::_:::::::|h[符文布]|h|r"] = {
							4, -- [1]
							1600, -- [2]
							400, -- [3]
							"V", -- [4]
						},
						["|cffffffff|Hitem:12841::::::::_:::::::|h[侵略者的天灾石]|h|r"] = {
							3, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
					},
					["伊露希亚·巴罗夫"] = {
					},
					["鬼灵研究员"] = {
					},
					["通灵学院黑暗召唤师"] = {
					},
					["博学者普克尔特"] = {
					},
					["通灵学院通灵师"] = {
						["|cffffffff|Hitem:12841::::::::_:::::::|h[侵略者的天灾石]|h|r"] = {
							1, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
					},
					["鬼灵教师"] = {
						["|cffffffff|Hitem:12841::::::::_:::::::|h[侵略者的天灾石]|h|r"] = {
							1, -- [1]
							0, -- [2]
							0, -- [3]
							"0", -- [4]
						},
						["|cff1eff00|Hitem:15938::::::778:180003328:_:::1::::|h[夜枭之奥秘宝珠]|h|r"] = {
							1, -- [1]
							9550, -- [2]
							9550, -- [3]
							"V", -- [4]
						},
					},
					["通灵学院专家"] = {
					},
					["传令官基尔图诺斯"] = {
					},
					["复活的战士"] = {
					},
					["复活的骷髅守卫"] = {
					},
					["讲师玛丽希亚"] = {
					},
				},
				["hks"] = 0,
				["resets"] = 10,
				["rep"] = {
					["银色黎明"] = 650,
				},
				["ranks"] = {
				},
				["dks"] = 0,
				["bgsWin"] = {
				},
				["xp"] = 0,
				["honor"] = 0,
				["seconds"] = 10413,
				["consumes"] = {
				},
				["bgsLoss"] = {
				},
				["bgs"] = {
				},
			},
			["honorTotal"] = 0,
			["honorPerHourTotal"] = 0,
			["goldPerHour"] = 167471.391529819,
			["goldPerHourTotal"] = 0,
			["lastUse"] = 1583627892,
			["honor"] = 0,
			["gold"] = 484411,
			["goldTotal"] = 0,
			["past"] = {
				["ah"] = 0,
				["vendor"] = 0,
				["kills"] = {
				},
				["gold"] = 0,
				["seconds"] = 0,
				["consumes"] = {
				},
				["drops"] = {
				},
				["bgsWin"] = {
				},
				["resets"] = 0,
				["rep"] = {
				},
				["ranks"] = {
				},
				["dks"] = 0,
				["skill"] = {
				},
				["hks"] = 0,
				["deaths"] = 0,
				["honor"] = 0,
				["xp"] = 0,
				["bgsLoss"] = {
				},
				["bgs"] = {
				},
			},
			["honorPerHour"] = 0,
			["pvpMode"] = false,
		},
	},
	["minimapButtonPosition"] = {
		["y"] = -127,
		["x"] = -165,
		["point"] = "TOPRIGHT",
	},
	["enableMinimapButton"] = true,
	["frameRect"] = {
		["y"] = -62.6511039733887,
		["x"] = 281.719146728516,
		["point"] = "CENTER",
		["height"] = 308.691162109375,
		["visible"] = false,
		["width"] = 240.409240722656,
	},
	["lockFrames"] = false,
}
