
alaGearManSV = {
	["takeoffAll_include_neck_finger_and_trinket"] = true,
	["__harm"] = {
	},
	["num_per_line"] = 6,
	["sets"] = {
		["Player-4500-02E3E6D0"] = {
		},
		["Player-4500-019A9E24"] = {
		},
		["Player-4500-0133C479"] = {
			{
				"|cffa335ee|Hitem:16921:2590:::::::60:::::::|h[卓越之环]|h|r", -- [1]
				"|cffa335ee|Hitem:19885::::::::60:::::::|h[金度的邪眼]|h|r", -- [2]
				"|cffa335ee|Hitem:16924:2604:::::::60:::::::|h[卓越肩铠]|h|r", -- [3]
				"|cffffffff|Hitem:14617::::::::60:::1::::|h[外科医生衬衣]|h|r", -- [4]
				"|cffa335ee|Hitem:16923:1893:::::::60:::::::|h[卓越法袍]|h|r", -- [5]
				"|cffa335ee|Hitem:16925::::::::60:::::::|h[卓越腰带]|h|r", -- [6]
				"|cffa335ee|Hitem:16922:2590:::::::60:::::::|h[卓越护腿]|h|r", -- [7]
				"|cffa335ee|Hitem:16919:851:::::::60:::::::|h[卓越长靴]|h|r", -- [8]
				"|cffa335ee|Hitem:16926:1883:::::::60:::::::|h[卓越束腕]|h|r", -- [9]
				"|cffa335ee|Hitem:16920:2617:::::::60:::::::|h[卓越护手]|h|r", -- [10]
				"|cffa335ee|Hitem:19140::::::::60:::::::|h[灼烧指环]|h|r", -- [11]
				"|cffa335ee|Hitem:19382::::::::60:::::::|h[纯源质指环]|h|r", -- [12]
				"|cff0070dd|Hitem:18469::::::::60:::11::::|h[埃雷萨拉斯皇家徽记]|h|r", -- [13]
				"|cffa335ee|Hitem:19395::::::::60:::::::|h[恢复宝石]|h|r", -- [14]
				"|cffa335ee|Hitem:21583::::::::60:::::::|h[明晰披风]|h|r", -- [15]
				"|cffa335ee|Hitem:21839:2505:::::::60:::::::|h[虚妄预言者节杖]|h|r", -- [16]
				"|cffa335ee|Hitem:19312::::::::60:::14::::|h[生命花环]|h|r", -- [17]
				"|cffa335ee|Hitem:19927::::::::60:::::::|h[玛尔里之触]|h|r", -- [18]
				"|cffffffff|Hitem:15199::::::::60:::14::::|h[石守卫的纹章]|h|r", -- [19]
				["helmet"] = false,
				["icon"] = 51,
				["name"] = "N",
				["cloak"] = false,
			}, -- [1]
			{
				"|cffa335ee|Hitem:16921:2590:::::::60:::::::|h[卓越之环]|h|r", -- [1]
				"|cffa335ee|Hitem:19885::::::::60:::::::|h[金度的邪眼]|h|r", -- [2]
				"|cffa335ee|Hitem:16924:2604:::::::60:::::::|h[卓越肩铠]|h|r", -- [3]
				"|cffffffff|Hitem:14617::::::::60:::1::::|h[外科医生衬衣]|h|r", -- [4]
				"|cffa335ee|Hitem:16923:1893:::::::60:::::::|h[卓越法袍]|h|r", -- [5]
				"|cffa335ee|Hitem:19388::::::::60:::::::|h[安格莉丝塔之握]|h|r", -- [6]
				"|cffa335ee|Hitem:16922:2590:::::::60:::::::|h[卓越护腿]|h|r", -- [7]
				"|cffa335ee|Hitem:16919:851:::::::60:::::::|h[卓越长靴]|h|r", -- [8]
				"|cffa335ee|Hitem:16926:1883:::::::60:::::::|h[卓越束腕]|h|r", -- [9]
				"|cffa335ee|Hitem:16920:2617:::::::60:::::::|h[卓越护手]|h|r", -- [10]
				"|cffa335ee|Hitem:18403::::::::60:::11::::|h[屠龙者的徽记]|h|r", -- [11]
				"|cffa335ee|Hitem:19434::::::::60:::::::|h[黑暗统御指环]|h|r", -- [12]
				"|cffa335ee|Hitem:19950::::::::60:::11::::|h[赞达拉英雄护符]|h|r", -- [13]
				"|cff0070dd|Hitem:13968::::::::60:::11::::|h[比斯巨兽之眼]|h|r", -- [14]
				"|cffa335ee|Hitem:21583::::::::60:::::::|h[明晰披风]|h|r", -- [15]
				"|cffa335ee|Hitem:18609:2505:::::::60:::11::::|h[咒逐]|h|r", -- [16]
				[18] = "|cffa335ee|Hitem:19927::::::::60:::::::|h[玛尔里之触]|h|r",
				[19] = "|cffffffff|Hitem:15199::::::::60:::14::::|h[石守卫的纹章]|h|r",
				["name"] = "DPS",
				["icon"] = 15,
			}, -- [2]
		},
		["Player-4500-02C7CE6C"] = {
			{
				"|cff0070dd|Hitem:13127::::::::29:::::::|h[寒霜皇冠]|h|r", -- [1]
				nil, -- [2]
				"|cff1eff00|Hitem:3481::::::::29:::::::|h[镀银青铜护肩]|h|r", -- [3]
				"|cffffffff|Hitem:5107::::::::29:::::::|h[水手衬衣]|h|r", -- [4]
				"|cff0070dd|Hitem:2870::::::::29:::::::|h[银鳞胸甲]|h|r", -- [5]
				"|cff1eff00|Hitem:15515::::::1190:2064411648:29:::::::|h[野熊之尖刺链甲腰带]|h|r", -- [6]
				"|cff1eff00|Hitem:3842::::::::29:::::::|h[绿铁护腿]|h|r", -- [7]
				"|cff0070dd|Hitem:1121::::::::29:::::::|h[山猫之靴]|h|r", -- [8]
				"|cff1eff00|Hitem:15459::::::::29:::11::::|h[丧钟护腕]|h|r", -- [9]
				"|cff0070dd|Hitem:720::::::::29:::1::::|h[争战手套]|h|r", -- [10]
				"|cff1eff00|Hitem:3235::::::::29:::11::::|h[轻蔑之戒]|h|r", -- [11]
				"|cff1eff00|Hitem:17692::::::::29:::11::::|h[犄角戒指]|h|r", -- [12]
				nil, -- [13]
				nil, -- [14]
				"|cff1eff00|Hitem:4706::::::::29:::::::|h[亮鳞披风]|h|r", -- [15]
				"|cff0070dd|Hitem:7753:34:::::::29:::1::::|h[溢血者]|h|r", -- [16]
				[18] = "|cff1eff00|Hitem:3039::::::::29:::::::|h[灰木短弓]|h|r",
				["icon"] = 15,
				["name"] = "dps",
			}, -- [1]
			{
				"|cff0070dd|Hitem:13127::::::::29:::::::|h[寒霜皇冠]|h|r", -- [1]
				nil, -- [2]
				"|cff1eff00|Hitem:3481::::::::29:::::::|h[镀银青铜护肩]|h|r", -- [3]
				"|cffffffff|Hitem:5107::::::::29:::::::|h[水手衬衣]|h|r", -- [4]
				"|cff0070dd|Hitem:2870::::::::29:::::::|h[银鳞胸甲]|h|r", -- [5]
				"|cff1eff00|Hitem:15515::::::1190:2064411648:29:::::::|h[野熊之尖刺链甲腰带]|h|r", -- [6]
				"|cff1eff00|Hitem:3842::::::::29:::::::|h[绿铁护腿]|h|r", -- [7]
				"|cff0070dd|Hitem:1121::::::::29:::::::|h[山猫之靴]|h|r", -- [8]
				"|cff1eff00|Hitem:15459::::::::29:::11::::|h[丧钟护腕]|h|r", -- [9]
				"|cff0070dd|Hitem:720::::::::29:::1::::|h[争战手套]|h|r", -- [10]
				"|cff1eff00|Hitem:3235::::::::29:::11::::|h[轻蔑之戒]|h|r", -- [11]
				"|cff1eff00|Hitem:17692::::::::29:::11::::|h[犄角戒指]|h|r", -- [12]
				nil, -- [13]
				nil, -- [14]
				"|cff1eff00|Hitem:4706::::::::29:::::::|h[亮鳞披风]|h|r", -- [15]
				"|cff0070dd|Hitem:7753:34:::::::29:::1::::|h[溢血者]|h|r", -- [16]
				[18] = "|cff1eff00|Hitem:3039::::::::29:::::::|h[灰木短弓]|h|r",
				["name"] = "T",
				["icon"] = 3,
			}, -- [2]
		},
		["Player-4500-024E240C"] = {
		},
		["Player-4500-0133C38E"] = {
		},
		["Player-4500-01519E45"] = {
		},
		["Player-4500-028B5198"] = {
		},
		["Player-4500-01A7CAAC"] = {
		},
		["Player-4500-0180E40E"] = {
		},
		["Player-4500-028B2DDE"] = {
		},
		["Player-4500-0251E689"] = {
		},
		["Player-4500-01A761BF"] = {
			{
				nil, -- [1]
				nil, -- [2]
				nil, -- [3]
				"|cffffffff|Hitem:6125::::::::22:::::::|h[争斗者甲胄]|h|r", -- [4]
				"|cff1eff00|Hitem:6580::::::1191:777042048:22:::::::|h[野熊之防御者外套]|h|r", -- [5]
				"|cff1eff00|Hitem:15497::::::1551:878664320:22:::::::|h[能量之先驱者束腰]|h|r", -- [6]
				"|cff0070dd|Hitem:13010::::::::22:::::::|h[梦歌护腿]|h|r", -- [7]
				"|cff1eff00|Hitem:6573::::::1101:1677479296:22:::1::::|h[野猪之防御者战靴]|h|r", -- [8]
				"|cff1eff00|Hitem:14723::::::::22:::::::|h[战痕束腕]|h|r", -- [9]
				"|cff1eff00|Hitem:2992::::::::22:::1::::|h[抛光链甲手套]|h|r", -- [10]
				"|cff1eff00|Hitem:12052::::::::22:::1::::|h[月光戒指]|h|r", -- [11]
				nil, -- [12]
				nil, -- [13]
				nil, -- [14]
				"|cff1eff00|Hitem:6340::::::::22:::1::::|h[芬鲁斯的外皮]|h|r", -- [15]
				"|cff0070dd|Hitem:12992::::::::22:::::::|h[灼热之刃]|h|r", -- [16]
				[18] = "|cff1eff00|Hitem:4577::::::::22:::::::|h[紧凑火枪]|h|r",
				["name"] = "dps",
				["icon"] = 2,
			}, -- [1]
			{
				nil, -- [1]
				nil, -- [2]
				nil, -- [3]
				"|cffffffff|Hitem:6125::::::::22:::::::|h[争斗者甲胄]|h|r", -- [4]
				"|cff1eff00|Hitem:6580::::::1191:777042048:22:::::::|h[野熊之防御者外套]|h|r", -- [5]
				"|cff1eff00|Hitem:15497::::::1551:878664320:22:::::::|h[能量之先驱者束腰]|h|r", -- [6]
				"|cff0070dd|Hitem:13010::::::::22:::::::|h[梦歌护腿]|h|r", -- [7]
				"|cff1eff00|Hitem:6573::::::1101:1677479296:22:::1::::|h[野猪之防御者战靴]|h|r", -- [8]
				"|cff1eff00|Hitem:14723::::::::22:::::::|h[战痕束腕]|h|r", -- [9]
				"|cff1eff00|Hitem:2992::::::::22:::1::::|h[抛光链甲手套]|h|r", -- [10]
				"|cff1eff00|Hitem:12052::::::::22:::1::::|h[月光戒指]|h|r", -- [11]
				nil, -- [12]
				nil, -- [13]
				nil, -- [14]
				"|cff1eff00|Hitem:6340::::::::22:::1::::|h[芬鲁斯的外皮]|h|r", -- [15]
				"|cff0070dd|Hitem:6504::::::::22:::11::::|h[翼刃]|h|r", -- [16]
				"|cff1eff00|Hitem:6572::::::673:1909661184:22:::1::::|h[猛虎之防御者之盾]|h|r", -- [17]
				"|cff1eff00|Hitem:4577::::::::22:::::::|h[紧凑火枪]|h|r", -- [18]
				["name"] = "t",
				["icon"] = 3,
			}, -- [2]
		},
		["Player-4500-01F89CDF"] = {
		},
	},
	["useBar"] = true,
	["quickSize"] = 18,
	["takeoffAll_pos"] = "RIGHT",
	["quickPos"] = {
		"BOTTOM", -- [1]
		nil, -- [2]
		"BOTTOM", -- [3]
		302.904174804688, -- [4]
		22.4706363677979, -- [5]
	},
	["_version"] = 200610,
	["quickStyle"] = "C",
	["__exec"] = {
		["fire"] = {
		},
		["func"] = {
		},
		["init"] = {
		},
	},
	["multi_lines"] = true,
	["quickPosChar"] = {
	},
	["show_outfit_in_tooltip"] = true,
}
