
AtlasLootClassicDB = {
	["profileKeys"] = {
		["五月二十七 - 龙之召唤"] = "五月二十七 - 龙之召唤",
		["叹风尘 - 龙之召唤"] = "叹风尘 - 龙之召唤",
		["Helios - 龙之召唤"] = "Helios - 龙之召唤",
		["风尘叹 - 龙之召唤"] = "风尘叹 - 龙之召唤",
		["Nyan - 龙之召唤"] = "Nyan - 龙之召唤",
		["秋天吃栗子 - 龙之召唤"] = "秋天吃栗子 - 龙之召唤",
		["冬天吃栗子 - 龙之召唤"] = "冬天吃栗子 - 龙之召唤",
		["莫起风 - 龙之召唤"] = "莫起风 - 龙之召唤",
		["落星辰 - 龙之召唤"] = "落星辰 - 龙之召唤",
		["Shop - 龙之召唤"] = "Shop - 龙之召唤",
		["Global - 龙之召唤"] = "Global - 龙之召唤",
		["Lêlantos - 龙之召唤"] = "Lêlantos - 龙之召唤",
		["Raging - 龙之召唤"] = "Raging - 龙之召唤",
		["Superss - 龙之召唤"] = "Superss - 龙之召唤",
		["Ophelias - 龙之召唤"] = "Ophelias - 龙之召唤",
		["Derek - 龙之召唤"] = "Derek - 龙之召唤",
	},
	["global"] = {
		["__addonrevision"] = 1050006,
	},
	["profiles"] = {
		["五月二十七 - 龙之召唤"] = {
		},
		["叹风尘 - 龙之召唤"] = {
		},
		["Helios - 龙之召唤"] = {
			["GUI"] = {
				["point"] = {
					nil, -- [1]
					nil, -- [2]
					"CENTER", -- [3]
					0, -- [4]
					3.00002551078796, -- [5]
				},
				["selected"] = {
					nil, -- [1]
					"WailingCaverns", -- [2]
					8, -- [3]
					1, -- [4]
					0, -- [5]
				},
			},
		},
		["风尘叹 - 龙之召唤"] = {
			["GUI"] = {
				["point"] = {
					nil, -- [1]
					nil, -- [2]
					"CENTER", -- [3]
					0, -- [4]
					0.799219429492951, -- [5]
				},
				["selected"] = {
					nil, -- [1]
					"TheTempleofAhnQiraj", -- [2]
					3, -- [3]
					3, -- [4]
					0, -- [5]
				},
			},
		},
		["Nyan - 龙之召唤"] = {
		},
		["秋天吃栗子 - 龙之召唤"] = {
		},
		["冬天吃栗子 - 龙之召唤"] = {
			["GUI"] = {
				["point"] = {
					"TOP", -- [1]
					nil, -- [2]
					"TOP", -- [3]
					30.7092742919922, -- [4]
					-19.4535694122314, -- [5]
				},
				["selected"] = {
					nil, -- [1]
					"TheTempleofAhnQiraj", -- [2]
					7, -- [3]
					3, -- [4]
					0, -- [5]
				},
			},
		},
		["莫起风 - 龙之召唤"] = {
			["GUI"] = {
				["selected"] = {
					nil, -- [1]
					"RazorfenKraul", -- [2]
					nil, -- [3]
					1, -- [4]
					0, -- [5]
				},
			},
		},
		["落星辰 - 龙之召唤"] = {
		},
		["Shop - 龙之召唤"] = {
			["GUI"] = {
				["selected"] = {
					nil, -- [1]
					"UpperBlackrockSpire", -- [2]
					8, -- [3]
					1, -- [4]
					0, -- [5]
				},
			},
		},
		["Global - 龙之召唤"] = {
			["GUI"] = {
				["point"] = {
					nil, -- [1]
					nil, -- [2]
					"CENTER", -- [3]
					0, -- [4]
					0, -- [5]
				},
				["selected"] = {
					nil, -- [1]
					"Zul'Gurub", -- [2]
					4, -- [3]
					2, -- [4]
					0, -- [5]
				},
			},
		},
		["Lêlantos - 龙之召唤"] = {
			["GUI"] = {
				["point"] = {
					"LEFT", -- [1]
					nil, -- [2]
					"LEFT", -- [3]
					0, -- [4]
					-24.0000095367432, -- [5]
				},
				["selected"] = {
					nil, -- [1]
					"Zul'Gurub", -- [2]
					nil, -- [3]
					2, -- [4]
					0, -- [5]
				},
			},
		},
		["Raging - 龙之召唤"] = {
		},
		["Superss - 龙之召唤"] = {
		},
		["Ophelias - 龙之召唤"] = {
		},
		["Derek - 龙之召唤"] = {
			["GUI"] = {
				["point"] = {
					"TOP", -- [1]
					nil, -- [2]
					"TOP", -- [3]
					118.000007629395, -- [4]
					-39.0000190734863, -- [5]
				},
				["selected"] = {
					nil, -- [1]
					"TheTempleofAhnQiraj", -- [2]
					7, -- [3]
					3, -- [4]
					0, -- [5]
				},
			},
			["Addons"] = {
				["Favourites"] = {
					["lists"] = {
						["ProfileBase"] = {
							[18473] = true,
						},
					},
				},
			},
		},
	},
}
