
_detalhes_global = {
	["npcid_pool"] = {
		[14283] = "雷矛猫头鹰",
		[1533] = "痛苦的灵魂",
		[1535] = "血色战士",
		[4097] = "加拉克狂怒者",
		[1539] = "血色低阶牧师",
		[4113] = "砂齿掘地工",
		[1543] = "邪鳍污水鱼人",
		[4129] = "乱齿狂吠者",
		[10317] = "黑手精英",
		[1551] = "铁腭蜥蜴",
		[8318] = "阿塔莱奴隶",
		[10381] = "被毁坏的死尸",
		[1559] = "穆克拉",
		[10429] = "大酋长雷德·黑手 <盖斯>",
		[3125] = "巨钳蝎",
		[10461] = "瘟疫虫",
		[10477] = "通灵学院亡灵法师",
		[4249] = "杂毛嚎叫者",
		[8510] = "阿塔莱图腾 <祖罗>",
		[8526] = "黑暗法师",
		[8542] = "死亡歌手",
		[10605] = "血色医护员",
		[14763] = "丹巴达尔南部统帅",
		[4329] = "火鬃斥候",
		[4345] = "尘泥利齿鳄鱼",
		[12860] = "杜瑞尔·月火",
		[4393] = "酸性沼泽软泥怪",
		[14987] = "强力治疗结界 <妖术师金度>",
		[3241] = "草原狮王",
		[10925] = "腐烂虫",
		[3249] = "巨型雷鹰",
		[4465] = "邪枝标枪手",
		[6520] = "灼热元素",
		[8958] = "怒爪巨熊",
		[3269] = "钢鬃地卜师",
		[3273] = "科卡尔召雷师",
		[4505] = "血帆桨手",
		[3285] = "风险投资公司雇工",
		[13196] = "相位鞭笞者",
		[1653] = "血帆大法师",
		[1655] = "妮萨·阿加曼德",
		[1657] = "代弗林·阿加曼德",
		[9166] = "翼手龙",
		[13276] = "荒野小鬼",
		[9198] = "尖石秘法师",
		[1665] = "麦拉其队长",
		[1667] = "迈文·考加尔",
		[166359] = "祖利安猛虎",
		[1675] = "混血腐皮豺狼人",
		[11357] = "哈卡之子",
		[4665] = "火刃老兵",
		[4697] = "荒土鞭尾蝎",
		[1689] = "别惹你鹏哥",
		[4713] = "滑刃战士",
		[3385] = "塞拉摩水兵",
		[4729] = "笨重的砂腭蜥蜴",
		[6784] = "卡尔文·蒙泰古",
		[3397] = "科卡尔战士",
		[1713] = "老年深喉猎豹",
		[11661] = "烈焰行者",
		[4841] = "死沼巨鳄",
		[9694] = "流涎的灰烬座狼",
		[3457] = "钢鬃捕猎者",
		[3461] = "绿洲钳嘴龟",
		[3473] = "奥瓦坦卡",
		[11917] = "高戈地卜师",
		[13996] = "黑翼技师",
		[1753] = "蛆眼",
		[11981] = "弗莱格尔",
		[7032] = "巨型黑曜石元素",
		[7048] = "炽热小龙",
		[1765] = "座狼",
		[1769] = "月怒白头狼人",
		[1773] = "腐皮秘法师",
		[14188] = "德尔克",
		[7112] = "加德纳尔祭司",
		[7120] = "加德纳尔术士",
		[1783] = "骷髅剥皮者",
		[1785] = "恐惧骸骨",
		[1787] = "骷髅刽子手",
		[1789] = "骷髅侍僧",
		[1791] = "被奴役的食尸鬼",
		[1793] = "腐烂的食尸鬼",
		[1795] = "灼热的食尸鬼",
		[1797] = "巨型灰斑熊",
		[8319] = "噩梦雏龙",
		[10382] = "被撕裂的死尸",
		[10398] = "图萨丁暗影法师",
		[1815] = "生病的黑熊",
		[1817] = "生病的狼",
		[7272] = "殉教者塞卡",
		[1821] = "腐虫潜伏者",
		[5241] = "戈杜尼军阀",
		[5249] = "混血木爪豺狼人",
		[12557] = "黑翼控制者",
		[1831] = "血色猎人",
		[1835] = "血色祈求者",
		[5297] = "老年怒痕雪人",
		[5305] = "乱羽鸣天者",
		[14748] = "邪枝绑架者",
		[5361] = "被缩小的波涛巨人",
		[3713] = "怒尾御浪者",
		[3717] = "怒尾巫师",
		[7440] = "冬泉巢穴守卫",
		[7448] = "冰风奇美拉",
		[1867] = "达拉然学徒",
		[5425] = "饥饿的疱爪土狼",
		[5441] = "哈扎里异种蝎",
		[3749] = "污林巨熊怪",
		[5457] = "森提帕尔群居蝎",
		[5473] = "砂槌食人魔法师",
		[5481] = "灌木露水收集者",
		[15068] = "祖利安守护者 <高阶祭司塞卡尔>",
		[10990] = "奥特兰克山羊",
		[8959] = "魔爪狼",
		[1891] = "月怒守卫",
		[1893] = "月怒哨兵",
		[1895] = "月怒长者",
		[3797] = "塞纳里奥保卫者",
		[7608] = "穆尔塔",
		[3809] = "灰谷熊",
		[3821] = "野棘潜伏者",
		[1913] = "达拉然守卫",
		[1915] = "达拉然咒术师",
		[5617] = "废土暗法师",
		[9199] = "尖石执行者",
		[11262] = "奥妮克希亚雏龙",
		[5649] = "沙怒饮血者",
		[5681] = "被俘虏的女人",
		[1935] = "提瑞斯法雇农",
		[1939] = "腐皮蛮兵",
		[5713] = "加什尔",
		[7768] = "枯木血虫",
		[11454] = "荒野背叛者",
		[1947] = "图勒·鸦爪",
		[11502] = "拉格纳罗斯",
		[7808] = "狂暴的枭兽",
		[3917] = "污浊的水元素",
		[3921] = "蓟皮巨熊怪",
		[7848] = "潜伏的深痕雪人",
		[7856] = "南海劫掠者",
		[7864] = "徘徊的上层精灵",
		[1971] = "邪恶的伊瓦",
		[5857] = "灼热熔岩蜘蛛",
		[5865] = "迪舒",
		[1983] = "奈塔拉什",
		[5921] = "大地之力图腾 II <污林萨满祭司>",
		[3989] = "风险投资公司樵夫",
		[3993] = "风险投资公司机械师",
		[4005] = "深苔爬行者",
		[5985] = "弯牙土狼",
		[4021] = "腐蚀性的腐蚀兽",
		[4025] = "血怒伏击者",
		[6017] = "熔岩喷射图腾 <沙怒巫医>",
		[4037] = "燃烧的掠夺者",
		[4041] = "炭色石化蜥蜴",
		[4053] = "塞纳留斯的女儿",
		[4057] = "塞纳留斯的儿子",
		[8120] = "苏利萨斯憎恶",
		[4073] = "XT:4",
		[4093] = "加拉克争斗者",
		[2062] = "议员亨德瑞克斯",
		[2066] = "议员海加斯",
		[6193] = "恶鞭尖啸者",
		[8336] = "哈卡莱挖掘者",
		[10399] = "图萨丁侍僧",
		[14509] = "高阶祭司塞卡尔",
		[4202] = "格雷苏",
		[10463] = "尖叫的女妖",
		[10495] = "生病的食尸鬼",
		[14605] = "白骨魔像",
		[14621] = "工头玛托留斯",
		[8560] = "烂苔斥候",
		[6377] = "雷首翼鹿",
		[4386] = "枯藤断木者",
		[4442] = "剃刀沼泽防御者",
		[6497] = "阿斯托·哈德恩",
		[6505] = "暴掠龙",
		[4466] = "邪枝割颅者",
		[4474] = "腐烂的死尸",
		[15101] = "祖利安徘徊者",
		[6553] = "格里什劫掠者",
		[4514] = "暴怒的阿迦玛",
		[4530] = "剃刀沼泽训练师",
		[4538] = "沼泽蝙蝠",
		[2274] = "暴怒的斯坦利",
		[9200] = "尖石劫掠者",
		[11263] = "未知目标 <鬼灵导师>",
		[13358] = "联盟弓箭手",
		[11359] = "灵魂掠夺者",
		[4666] = "火刃魔仆",
		[11391] = "邪枝部族演讲者",
		[9376] = "火焰使者",
		[2350] = "森林食苔蛛",
		[11455] = "荒野魔仆",
		[11551] = "通灵魔",
		[11583] = "奈法利安",
		[9568] = "维姆萨拉克",
		[11663] = "烈焰行者医师",
		[2422] = "戈洛姆斯",
		[9696] = "血斧座狼",
		[2474] = "库德鲁斯",
		[11983] = "费尔默",
		[7033] = "火腹食人魔",
		[7041] = "火鳞龙人",
		[12127] = "雷矛卫兵",
		[12143] = "烈焰之子",
		[2530] = "耶尼库",
		[7113] = "加德纳尔守护者",
		[2546] = "舰队指挥官菲尔拉伦",
		[2550] = "斯蒂沃特船长",
		[14302] = "多彩龙兽",
		[2570] = "石拳萨满祭司",
		[2578] = "山地秃鹰幼崽",
		[14446] = "芬加特",
		[10400] = "图萨丁亡灵法师",
		[14510] = "高阶祭司玛尔里",
		[5226] = "黑暗虫",
		[5234] = "戈杜尼虐待者",
		[5258] = "木爪突击队员",
		[8497] = "未知目标",
		[2650] = "枯木狂热者",
		[2654] = "枯木召唤者",
		[2658] = "锋喙狮鹫",
		[10640] = "橡爪",
		[14750] = "觅血者前锋",
		[14766] = "冰血统帅",
		[669] = "劈颅猎人",
		[5362] = "北泉鹰身人",
		[672] = "劈颅逐灵者",
		[2694] = "高原游侠",
		[7441] = "冬泉图腾师",
		[7449] = "冰风破坏者",
		[7457] = "游荡的冰蓟雪人",
		[678] = "莫什奥格虐待者",
		[5426] = "疱爪土狼",
		[680] = "莫什奥格领主",
		[681] = "荆棘谷猛虎幼崽",
		[5450] = "哈扎里毒刺蝎",
		[683] = "猎豹幼崽",
		[2734] = "山脊雄豹",
		[5474] = "砂槌蛮兵",
		[686] = "鞭尾迅猛龙",
		[5490] = "长瘤的灌木兽",
		[8961] = "魔爪掠夺者",
		[690] = "冷眼蜥蜴",
		[696] = "劈颅掷斧者",
		[697] = "血顶萨满祭司",
		[5618] = "废土强盗",
		[9201] = "尖石食人魔法师",
		[5650] = "沙怒巫医",
		[9265] = "燃棘暗影猎手",
		[709] = "莫什奥格好战者",
		[710] = "莫什奥格法师",
		[11360] = "祖利安幼虎",
		[2850] = "断牙",
		[5714] = "洛若尔",
		[11440] = "戈多克执行者",
		[11456] = "荒野暗影行者",
		[7785] = "祖穆拉恩结界 <巫医祖穆拉恩>",
		[7809] = "邪枝伏击者",
		[723] = "莫什奥格屠夫",
		[7857] = "南海码头工人",
		[5834] = "天空之刃艾泽里",
		[731] = "虎王邦加拉什",
		[5850] = "炽热元素",
		[5858] = "巨型熔岩蜘蛛",
		[11744] = "灰尘风暴",
		[736] = "黑豹",
		[742] = "绿色龙族",
		[747] = "沼泽鱼人",
		[750] = "沼泽喷墨鱼人",
		[751] = "沼泽食腐鱼人",
		[752] = "沼泽鱼人智者",
		[756] = "劈颅黑豹",
		[6066] = "陷地图腾 <剃刀沼泽图腾师>",
		[760] = "失落定居者",
		[762] = "失落寻隙者",
		[10177] = "黑石塔甲虫",
		[767] = "沼泽虎",
		[768] = "暗影黑豹",
		[769] = "死亡狼蛛",
		[4107] = "风巢双足飞龙",
		[772] = "荆棘谷雌虎",
		[4139] = "恐蝎",
		[6194] = "恶鞭毒蛇守卫",
		[12416] = "黑翼军团士兵",
		[12432] = "维斯迦尔",
		[10417] = "泼毒者",
		[781] = "劈颅猎头者",
		[782] = "劈颅斥候",
		[783] = "劈颅狂战士",
		[784] = "劈颅兽王",
		[10577] = "墓穴甲虫 <地穴爬行者>",
		[8546] = "黑暗教徒",
		[8562] = "烂苔食尸者",
		[14767] = "哨塔高地统帅",
		[4323] = "灼热龙崽",
		[4331] = "火鬃灰尾龙人",
		[4355] = "血沼镰爪龙",
		[10801] = "喋喋不休的食尸鬼",
		[12896] = "银翼哨兵",
		[4411] = "暗牙潜伏者",
		[3238] = "雷鳞蜥蜴",
		[4435] = "剃刀沼泽战士",
		[3250] = "异种爬行者",
		[3254] = "赤鳞鞭尾龙",
		[4467] = "邪枝占卜者",
		[4475] = "坏死的僵尸",
		[3266] = "钢鬃防御者",
		[3270] = "秘法师拉佐斯诺特",
		[3274] = "科卡尔驯犬者",
		[3278] = "巫翼杀戮者",
		[3282] = "风险投资公司雇佣兵",
		[13136] = "亚什雄蝎 <被折磨的德鲁伊>",
		[4531] = "剃刀沼泽驯兽师",
		[4539] = "巨型沼泽蝙蝠",
		[13296] = "拉基特中尉",
		[9266] = "燃棘巫医",
		[11361] = "祖利安猛虎",
		[4667] = "火刃暗影法师",
		[11441] = "戈多克蛮兵",
		[3382] = "南海炮兵",
		[3386] = "塞拉摩医师",
		[4795] = "自然之力 <塞纳里奥辩护者>",
		[11665] = "熔岩歼灭者",
		[3434] = "纳克",
		[3438] = "克里尼格·糟鼻",
		[3458] = "钢鬃先知",
		[11921] = "贝瑟莱斯",
		[12017] = "勒什雷尔",
		[3530] = "月怒裁缝",
		[12129] = "奥妮克希亚守卫",
		[7106] = "碧火潜行者",
		[7114] = "加德纳尔执行者",
		[3566] = "平原徘徊者",
		[7154] = "死木园丁",
		[8211] = "海崖奔跳者",
		[5139] = "库德拉姆·麦须",
		[12369] = "科拉加鲁",
		[905] = "利齿狂鱼",
		[12465] = "死爪老龙人",
		[7274] = "沙怒刽子手",
		[10482] = "复活的侍从 <通灵学院黑暗召唤师>",
		[10498] = "鬼灵导师",
		[5259] = "阿塔莱巫医",
		[5267] = "阿塔莱行尸",
		[5283] = "噩梦游荡者",
		[8531] = "喋喋不休的食尸鬼",
		[5299] = "残忍的怒痕雪人",
		[5307] = "山谷尖啸者",
		[10642] = "埃卡洛姆",
		[8675] = "地狱兽",
		[10738] = "冬泉酋长",
		[14880] = "拉扎什诱捕者",
		[7450] = "蓬毛枭兽",
		[7458] = "冰蓟雪人",
		[5419] = "晶鳞蜥蜴",
		[12897] = "银翼战士",
		[3746] = "污林卫兵",
		[3750] = "污林图腾师",
		[5459] = "森提帕尔掘洞蝎",
		[3758] = "魔草萨特",
		[3762] = "魔草魔仆",
		[3770] = "冷心捕猎者",
		[9043] = "裂盾步兵",
		[3810] = "老灰谷熊",
		[13297] = "斯托哈德中尉",
		[9219] = "尖石屠夫",
		[9267] = "燃棘掷斧者",
		[11346] = "哈卡莱神谕者",
		[5715] = "胡库",
		[11442] = "戈多克虐待者",
		[7786] = "祖穆拉恩骷髅",
		[3902] = "灼热图腾 II <钢鬃先知>",
		[5771] = "祖格卡",
		[13617] = "雷矛兽栏管理员",
		[3922] = "蓟皮图腾师",
		[3926] = "蓟皮探路者",
		[7858] = "南海流氓",
		[11666] = "火焰行者",
		[5843] = "奴隶工",
		[9683] = "拉克维的配偶",
		[11778] = "暗影碎片击碎者",
		[11858] = "格鲁迪格·暗云",
		[5979] = "悲惨的失落者",
		[4022] = "血怒鹰身人",
		[4026] = "血怒唤风者",
		[12018] = "管理者埃克索图斯",
		[4034] = "狂怒的石灵",
		[4038] = "燃烧的破坏者",
		[4042] = "焦黑石化蜥蜴",
		[12098] = "萨弗隆先驱者",
		[4054] = "欢笑的姐妹",
		[10083] = "狂爪火鳞龙人",
		[12178] = "被折磨的德鲁伊",
		[4074] = "XT:9",
		[4094] = "加拉克斥候",
		[14385] = "末日守卫",
		[14401] = "大元素师克里希克",
		[10339] = "盖斯",
		[12418] = "戈多克土狼",
		[10387] = "复仇的幻影",
		[10419] = "红衣魔术师",
		[10435] = "巴瑟拉斯镇长",
		[10499] = "鬼灵研究员",
		[1060] = "死灵莫格",
		[8532] = "生病的剥皮者",
		[8548] = "邪恶导师",
		[8596] = "瘟疫幼犬",
		[4316] = "科卡尔猎犬",
		[4324] = "灼热雏龙",
		[1096] = "风险投资公司地质学家",
		[4412] = "暗牙爬行者",
		[4420] = "主宰拉姆塔斯",
		[15009] = "巫毒之魂",
		[15041] = "玛尔里的爪牙",
		[6507] = "狩猎暴掠龙",
		[10979] = "血色猎犬",
		[8996] = "虚空行者",
		[6555] = "格里什掘洞蝎",
		[11075] = "护锅者拜尔摩",
		[9044] = "裂盾哨兵",
		[2267] = "希尔斯布莱德农民",
		[4548] = "钢齿土狼",
		[2287] = "破碎岭好战者",
		[13298] = "格雷瓦德中尉",
		[9268] = "燃棘狂战士",
		[11347] = "狂热者洛卡恩",
		[2335] = "波恩塞德镇长",
		[13442] = "大德鲁伊雷弗拉尔",
		[4692] = "恐怖飞扑者",
		[2351] = "灰熊",
		[2387] = "希尔斯布莱德议员",
		[2403] = "农夫盖兹",
		[11667] = "烈焰守卫",
		[9684] = "拉克维",
		[2427] = "狱卒埃斯顿",
		[9716] = "血斧好战者",
		[2447] = "纳瑞尔拉萨斯",
		[2451] = "农夫卡拉巴",
		[7035] = "火腹蛮兵",
		[7067] = "风险投资公司雄蜂",
		[12099] = "火誓者",
		[2523] = "灼热图腾 <秘法师拉佐斯诺特>",
		[12179] = "被折磨的哨兵",
		[2547] = "艾隆帕",
		[12259] = "基赫纳斯",
		[2559] = "高地阔步龙",
		[2563] = "平原狼蛛",
		[14354] = "普希林",
		[2571] = "石拳领主",
		[14386] = "游荡的基尔罗格之眼",
		[2583] = "激流堡猎巨魔者",
		[2591] = "辛迪加占星师",
		[12435] = "狂野的拉佐格尔",
		[2607] = "加林·托尔贝恩王子",
		[10436] = "安娜丝塔丽男爵夫人",
		[7275] = "暗影祭司塞瑟斯",
		[5236] = "戈杜尼萨满祭司",
		[8437] = "哈卡莱爪牙",
		[10500] = "鬼灵教师",
		[10516] = "不可宽恕者",
		[2635] = "老海鳄",
		[2639] = "邪枝掷斧者",
		[2643] = "邪枝狂战士",
		[10580] = "恶臭僵尸",
		[10596] = "烟网蛛后",
		[2655] = "绿色淤泥怪",
		[2659] = "翱翔的锋喙狮鹫",
		[8597] = "瘟疫犬",
		[5364] = "北泉杀戮者",
		[14834] = "哈卡",
		[2691] = "高原前锋",
		[7443] = "碎齿暴熊",
		[7451] = "狂怒的枭兽",
		[7459] = "冰蓟雪人女王",
		[5420] = "晶鳞凝视者",
		[5428] = "大鹏",
		[5452] = "哈扎里工蝎",
		[10916] = "冬泉信使",
		[2735] = "次级石元素",
		[10996] = "英雄之魂",
		[11076] = "护锅者拉扎奇",
		[13139] = "指挥官拉多夫",
		[2783] = "玛雷兹·考尔",
		[9157] = "血瓣花",
		[13299] = "鲁纳丁中尉",
		[9237] = "指挥官沃恩",
		[9269] = "燃棘先知",
		[11348] = "狂热者扎斯",
		[89] = "地狱火爪牙 <巫毒奴隶>",
		[11380] = "妖术师金度",
		[13443] = "树林德鲁伊",
		[5716] = "祖罗尔",
		[11444] = "戈多克大法师",
		[7787] = "沙怒奴隶",
		[7795] = "水占师维蕾萨",
		[7803] = "沙漠掘洞蝎",
		[9477] = "克隆软泥怪 <原生软泥怪>",
		[11668] = "火焰之王",
		[5844] = "黑铁奴隶贩子",
		[5852] = "地狱元素",
		[5860] = "暮光黑暗萨满祭司",
		[9701] = "黑石塔蝎子",
		[9717] = "血斧召唤师",
		[2959] = "草原捕食者",
		[11876] = "恶魔灵魂",
		[1490] = "赞吉尔巫医",
		[1492] = "高拉什",
		[5988] = "厚甲毒刺蝎",
		[11988] = "焚化者古雷曼格",
		[1502] = "丑陋的僵尸",
		[1506] = "血色信徒",
		[8075] = "艾丹娜·邪爪",
		[1514] = "野蛮的莫克",
		[1516] = "康达",
		[3035] = "平原狮",
		[1520] = "断骨士兵",
		[1522] = "暗眼骷髅法师",
		[1526] = "破碎的尸体",
		[1528] = "蹒跚的血僵尸",
		[1530] = "腐烂的古尸",
		[1532] = "游荡的幽灵",
		[8179] = "强效治疗结界 <沙怒巫医>",
		[1536] = "血色传教士",
		[1538] = "血色苦行修士",
		[1540] = "血色前锋",
		[4117] = "风蛇",
		[1544] = "邪鳍先知",
		[1548] = "被诅咒的黑暗犬",
		[6196] = "恶鞭侍从",
		[1554] = "吸血夜行蝙蝠",
		[10405] = "恶疫食尸鬼",
		[14515] = "高阶祭司娅尔罗",
		[1562] = "血帆法师",
		[1564] = "血帆术士",
		[10469] = "通灵学院专家",
		[10485] = "复活的畸形骷髅",
		[8534] = "腐烂的石像鬼",
		[8566] = "黑铁哨兵",
		[8598] = "狂怒的瘟疫犬",
		[4341] = "尘泥鳄鱼",
		[10757] = "沸腾的水元素",
		[6412] = "未知目标 <护锅者玛维诺斯>",
		[14883] = "巫毒奴隶",
		[4421] = "卡尔加·刺肋",
		[3239] = "电角蜥蜴",
		[4437] = "剃刀沼泽守卫",
		[3247] = "雷鹰雏鸟",
		[15043] = "祖利安鳄鱼",
		[6508] = "毒皮暴掠龙",
		[6516] = "安戈洛大猩猩",
		[3263] = "刺背地卜师",
		[3267] = "钢鬃寻水者",
		[3271] = "钢鬃秘法师",
		[3275] = "科卡尔掠夺者",
		[11077] = "护锅者玛维诺斯",
		[9046] = "裂盾军需官",
		[15203] = "斯卡德诺克斯王子",
		[4541] = "阿迦玛甘之血",
		[1654] = "格里高·阿加曼德",
		[1656] = "萨尔曼·阿加曼德",
		[1658] = "达高尔队长",
		[1660] = "血色保镖",
		[1662] = "派瑞恩队长",
		[1664] = "瓦松队长",
		[1674] = "腐皮豺狼人",
		[11365] = "祖利安雌猎虎",
		[4693] = "恐怖飞鸟",
		[3415] = "雌性草原狮",
		[9622] = "尤尔查",
		[3435] = "洛克·奥克班恩",
		[4845] = "暗炉恶棍",
		[3459] = "钢鬃战士",
		[6932] = "未知目标 <沼泽空谈者>",
		[3471] = "工匠斯尼格斯",
		[3475] = "埃其亚基",
		[9862] = "加德纳尔军团士兵",
		[9878] = "热能野兽",
		[14020] = "克洛玛古斯",
		[7036] = "索瑞森间谍",
		[1766] = "杂斑座狼",
		[1770] = "月怒夜行者",
		[1772] = "腐皮巡林者",
		[7092] = "被污染的软泥怪",
		[7100] = "曲木食苔者",
		[1778] = "凶猛的灰斑熊",
		[1780] = "苔藓阔步者",
		[1782] = "月怒魔魂狼人",
		[1784] = "骷髅巫师",
		[1788] = "骷髅军官",
		[7156] = "死木守卫",
		[1794] = "没有灵魂的食尸鬼",
		[1796] = "冰冷的食尸鬼",
		[14372] = "冬泉伏击者",
		[1804] = "哀嚎的死者",
		[10358] = "菲林森特的阴影",
		[10374] = "尖塔蜘蛛",
		[10390] = "骷髅守护者",
		[10406] = "食尸抢夺者",
		[1816] = "生病的灰熊",
		[14532] = "拉扎什毒血蜘蛛",
		[5229] = "戈杜尼食人魔",
		[1822] = "毒雾潜伏者",
		[1824] = "瘟疫潜伏者",
		[5253] = "木爪蛮兵",
		[7308] = "风险投资公司巡逻员",
		[5269] = "阿塔莱祭司",
		[5277] = "噩梦刃鳞龙人",
		[8535] = "腐烂的尖啸者",
		[8551] = "黑暗召唤师",
		[10678] = "瘟疫龙崽",
		[5349] = "阿拉瑟希斯",
		[7404] = "加拉克烈焰守卫",
		[3711] = "怒尾侍从",
		[7428] = "霜槌巨人",
		[7444] = "碎齿熊",
		[7452] = "疯狂的枭兽",
		[1866] = "鸦爪奴隶",
		[1868] = "鸦爪仆从",
		[5429] = "火鹏",
		[3743] = "污林战士",
		[5453] = "哈扎里掘洞蝎",
		[5461] = "海元素",
		[3759] = "魔草潜行者",
		[3763] = "魔草巡影者",
		[3767] = "冷心欺诈者",
		[3771] = "冷心唤魔者",
		[1892] = "月怒守卫",
		[1894] = "月怒哨兵",
		[1896] = "月怒长者",
		[7604] = "布莱中士",
		[15220] = "微风公爵",
		[1912] = "达拉然保卫者",
		[1914] = "达拉然法师",
		[5645] = "沙怒剥皮者",
		[11318] = "怒焰穴居人",
		[11350] = "古拉巴什掷斧者",
		[1934] = "提瑞斯法农夫",
		[11382] = "血领主曼多基尔",
		[5709] = "伊兰尼库斯的阴影",
		[5717] = "米杉",
		[1946] = "莉莉丝·奈法拉",
		[7788] = "沙怒苦工",
		[7796] = "耐克鲁姆",
		[3903] = "灼热图腾 III <石拳萨满祭司>",
		[5781] = "异种爬行者的卵 <异种爬行者>",
		[7844] = "火焰新星图腾 IV <安图苏尔>",
		[11622] = "血骨傀儡",
		[3939] = "钢鬃狼",
		[1972] = "白毛狼人格瑞姆森",
		[5853] = "温和的作战傀儡",
		[13797] = "巡山人布比罗",
		[11830] = "哈卡祭司",
		[3991] = "风险投资公司砍树工",
		[11910] = "恐怖图腾恶徒",
		[9879] = "热能恐兽",
		[4011] = "幼年巨翼双足飞龙",
		[5981] = "传送门搜寻者",
		[4023] = "血怒游荡者",
		[4027] = "血怒雷巫",
		[14101] = "未知目标 <黑翼管理者>",
		[4051] = "塞纳里奥植物学家",
		[12118] = "鲁西弗隆",
		[4067] = "夜行虎",
		[14261] = "雏龙之语：蓝色",
		[6117] = "上层精灵鬼巫",
		[4095] = "加拉克虐待者",
		[8216] = "狂暴者雷瑟罗克",
		[2060] = "议员斯密瑟斯",
		[4126] = "峭壁捕猎者",
		[2068] = "莫瑞森村长",
		[4150] = "盐石凝视者",
		[12422] = "死爪龙人",
		[10391] = "骷髅狂战士",
		[10407] = "鲜肉食尸鬼",
		[14517] = "高阶祭司耶克里克",
		[10439] = "吞咽者拉姆斯登",
		[10471] = "通灵学院侍僧",
		[10487] = "复活的保卫者",
		[2120] = "大法师阿塔瑞克",
		[8504] = "黑铁斥候",
		[14661] = "毒刺鞭笞者",
		[8600] = "瘟疫蝙蝠",
		[4334] = "火鬃招炎者",
		[4342] = "尘泥锐爪鳄鱼",
		[10759] = "恐怖图腾践踏者",
		[10823] = "祖布林·扭枝",
		[4414] = "暗牙毒蜘蛛",
		[4438] = "剃刀沼泽刺鬃守卫",
		[6501] = "剑龙",
		[6517] = "焦油兽",
		[2244] = "辛迪加暗影法师",
		[2248] = "洞穴雪人",
		[2252] = "破碎岭食人魔",
		[6557] = "原生软泥怪",
		[4518] = "亡首圣贤",
		[2264] = "希尔斯布莱德裁缝",
		[4534] = "被驯服的土狼 <剃刀沼泽兽王>",
		[9096] = "狂爪龙人",
		[13318] = "指挥官莫塔米尔",
		[9240] = "燃棘暗影牧师",
		[11319] = "怒焰萨满祭司",
		[11351] = "古拉巴什猎头者",
		[9336] = "考博普拉格",
		[9416] = "裂盾座狼",
		[2360] = "希尔斯布莱德雇农",
		[4726] = "暴怒的雷霆蜥蜴",
		[9464] = "主宰洛尔",
		[2372] = "泥嘴豺狼人",
		[2384] = "饥饿的山地狮",
		[2404] = "铁匠维林坦",
		[11671] = "熔火恶犬",
		[2420] = "塔尔格",
		[4846] = "暗炉掘地工",
		[2428] = "狱卒玛尔根",
		[2448] = "书记员赫拉斯·怀特斯蒂德",
		[9816] = "烈焰卫士艾博希尔",
		[11911] = "恐怖图腾佣兵",
		[14022] = "腐化的红色雏龙",
		[7037] = "索瑞森驭火者",
		[7045] = "炽热幼龙",
		[10040] = "格里什虫巢卫士",
		[12119] = "烈焰行者护卫",
		[7101] = "曲木撕裂者",
		[7109] = "碧火魔仆",
		[2540] = "未知目标 <达拉然保卫者>",
		[14262] = "未知目标",
		[2548] = "尼哈鲁船长",
		[2552] = "枯木巨魔",
		[2556] = "枯木猎头者",
		[2560] = "高地长尾龙",
		[5134] = "约尼维拉·远山",
		[2584] = "激流堡防御者",
		[2588] = "辛迪加潜伏者",
		[10376] = "水晶之牙",
		[10408] = "石翼石像鬼",
		[10424] = "红衣豪侠",
		[2612] = "瓦罗卡尔中尉",
		[5238] = "戈杜尼军官",
		[5246] = "祖卡什工蝎",
		[5254] = "木爪秘法师",
		[5262] = "格罗多克大猩猩",
		[10536] = "瘟疫蛆",
		[14662] = "堕落火焰新星图腾 V <大满贯>",
		[2656] = "玉石软泥怪",
		[8601] = "毒性瘟疫蝙蝠",
		[10680] = "被召唤的黑手恐法师 <黑手召唤师>",
		[2676] = "未知目标 <风险投资公司机械师>",
		[12759] = "泰德雷斯",
		[5366] = "北泉唤风者",
		[10760] = "恐怖图腾地卜师",
		[7453] = "月光枭兽",
		[5422] = "沙漠猎食蝎",
		[5454] = "哈扎里沙行者",
		[5462] = "巨型海元素",
		[8889] = "铁怒监军",
		[2923] = "癞皮银鬃狼",
		[7605] = "拉文",
		[1779] = "月怒暴食者",
		[9097] = "裂盾军团战士",
		[5797] = "艾恩·流水",
		[3286] = "风险投资公司监督",
		[5421] = "晶鳞石化蜥蜴",
		[11777] = "暗影碎片巡游者",
		[7307] = "风险投资公司看守",
		[5273] = "阿塔莱高阶祭司",
		[7139] = "铁木践踏者",
		[13319] = "指挥官杜菲",
		[9241] = "燃棘猎头者",
		[9257] = "裂盾术士",
		[11320] = "钻土虫",
		[7115] = "加德纳尔精兵",
		[11352] = "古拉巴什狂暴者",
		[5686] = "被俘虏的僵尸",
		[1511] = "暴怒的银背猩猩",
		[13447] = "诺雷格·雷矛中尉",
		[5710] = "预言者迦玛兰",
		[10162] = "维克多·奈法里奥斯",
		[11448] = "戈多克术士",
		[11464] = "扭木纠缠者",
		[7789] = "沙怒智障者",
		[7797] = "卢兹鲁",
		[7805] = "废土暴徒",
		[5766] = "草原幼狮 <迪舒>",
		[5300] = "乱羽角鹰兽",
		[6016] = "防护元素图腾 <燃棘巫医>",
		[4017] = "机敏的灵龙",
		[5798] = "索拉·羽月",
		[5806] = "树人盟友",
		[1561] = "血帆袭击者",
		[11664] = "烈焰行者精英",
		[2924] = "银鬃狼",
		[11672] = "熔火怒犬",
		[5846] = "黑铁工头",
		[5854] = "重型作战傀儡",
		[3923] = "蓟皮洞穴守卫",
		[11736] = "石鞭巨钳蝎",
		[8527] = "天灾卫兵",
		[7267] = "乌克兹·沙顶",
		[14356] = "锯鳍狂鱼",
		[5721] = "德姆塞卡尔",
		[2926] = "银鬃捕猎者",
		[2960] = "草原狼前锋",
		[3833] = "塞纳里奥辩护者",
		[9817] = "黑手恐法师",
		[11880] = "暮光复仇者",
		[6585] = "乌卡洛克",
		[11912] = "恐怖图腾蛮兵",
		[10896] = "阿纳克·恐怖图腾",
		[5990] = "红石蜥蜴",
		[5982] = "黑色屠戮者",
		[14023] = "腐化的绿色雏龙",
		[5451] = "哈扎里群居蝎",
		[1941] = "腐皮盗墓贼",
		[15204] = "大元帅维拉希斯",
		[9693] = "血斧招魂师",
		[12056] = "迦顿男爵",
		[10438] = "苍白的玛勒基",
		[10041] = "格里什皇后",
		[5856] = "晶网蜘蛛",
		[3823] = "幽爪奔跑者",
		[7460] = "冰蓟雪人王",
		[4525] = "剃刀沼泽裂地者",
		[7899] = "寻宝海盗",
		[12467] = "死爪龙人队长",
		[3765] = "冷心萨特",
		[14263] = "青铜龙兽",
		[7847] = "卡利夫·斯科比斯汀",
		[6126] = "哈达尔欺诈者",
		[10217] = "烈焰打击图腾 <燃棘巫医>",
		[3745] = "污林探险者",
		[12264] = "沙斯拉尔",
		[8218] = "漫步者维瑟哈特",
		[4119] = "老风蛇",
		[4127] = "乱齿土狼",
		[4357] = "血沼鞭尾龙",
		[6190] = "恶鞭战士",
		[4151] = "盐石水晶蜥蜴",
		[2680] = "邪枝狼崽",
		[14668] = "堕落地狱火 <传说中的包子>",
		[11735] = "石鞭蝎",
		[10409] = "石翼尖啸者",
		[4273] = "守护者奥达努斯",
		[10441] = "瘟疫鼠",
		[3128] = "库尔提拉斯水手",
		[2063] = "议员维尔海姆",
		[10489] = "复活的卫兵",
		[5244] = "祖卡什毒刺蝎",
		[5720] = "德拉维沃尔",
		[2522] = "丛林猎豹",
		[5268] = "铁鬃熊",
		[14663] = "堕落石肤图腾 VI <大满贯>",
		[10488] = "复活的构造体",
		[12856] = "灰谷先驱者",
		[10416] = "喷胆者",
		[2590] = "辛迪咒术师",
		[8602] = "巨型瘟疫蝙蝠",
		[4109] = "雄性风巢飞龙",
		[14988] = "奥根",
		[10697] = "绿汁软泥怪",
		[10806] = "尤西乌斯",
		[4343] = "尘泥钳嘴鳄鱼",
		[679] = "莫什奥格萨满祭司",
		[10761] = "恐怖图腾抢夺者",
		[6035] = "剃刀沼泽捕猎者",
		[5358] = "峭壁巨人",
		[8762] = "林木隐匿者",
		[4391] = "沼泽软泥怪",
		[4118] = "毒性风蛇",
		[8977] = "克罗格鲁尔",
		[12046] = "掠夺者格玛洛克",
		[9045] = "裂盾侍僧",
		[3240] = "雷角蜥蜴",
		[3252] = "异种群居蝎",
		[6494] = "塔赞",
		[15047] = "哈卡的意志",
		[3256] = "赤鳞镰爪龙",
		[3260] = "刺背寻水者",
		[4511] = "阿迦玛",
		[3268] = "钢鬃织棘者",
		[3272] = "科卡尔牧民",
		[3276] = "巫翼鹰身人",
		[3280] = "巫翼唤风者",
		[3284] = "风险投资公司苦工",
		[5308] = "游荡的山谷尖啸者",
		[13160] = "腐蚀群居虫",
		[818] = "麦佐斯",
		[9098] = "裂盾缚法师",
		[2731] = "山脊巡行者",
		[3467] = "巴隆·朗绍尔",
		[15205] = "卡苏姆男爵",
		[9162] = "幼双帆龙",
		[7132] = "剧毒之水",
		[4844] = "暗炉勘探员",
		[11257] = "通灵学院管理者",
		[13320] = "指挥官卡尔·菲利普",
		[4623] = "野猪人勇士",
		[9258] = "裂盾袭击者",
		[11321] = "熔岩元素",
		[7901] = "寻宝流氓",
		[11353] = "古拉巴什饮血者",
		[4663] = "火刃预言师",
		[11662] = "烈焰行者祭司",
		[11831] = "哈卡巫医",
		[3715] = "怒尾海巫",
		[4695] = "恐怖腐化鸟",
		[7725] = "恐怖图腾袭击者",
		[5472] = "砂槌执行者",
		[2354] = "邪恶的灰熊",
		[11497] = "拉扎尔",
		[2729] = "老峭壁山狗",
		[15623] = "沙迪维尔斯",
		[14986] = "金度之影",
		[11582] = "通灵学院黑暗召唤师",
		[4070] = "风险投资公司建筑师",
		[5357] = "大地行者",
		[7268] = "沙怒守护者",
		[11374] = "钩齿狂鱼",
		[3424] = "雷鹰破云者",
		[7276] = "未知目标",
		[11673] = "上古熔火恶犬",
		[3436] = "卡兹",
		[2649] = "枯木割颅者",
		[2653] = "枯木虐待者",
		[11737] = "石鞭掠夺者",
		[3452] = "塞瑞娜·血羽",
		[13816] = "勘查员塔雷·石镐",
		[14323] = "卫兵斯里基克",
		[780] = "劈颅秘法师",
		[12101] = "熔岩奔腾者",
		[3472] = "瓦希塔帕恩",
		[3476] = "依沙瓦克",
		[9818] = "黑手召唤师",
		[11881] = "暮光地王",
		[2268] = "希尔斯布莱德步兵",
		[11913] = "恐怖图腾巫师",
		[2266] = "希尔斯布莱德农夫",
		[3261] = "刺背织棘者",
		[5286] = "长牙奔跑者",
		[14024] = "腐化的蓝色雏龙",
		[4257] = "兰纳·雷酒",
		[8960] = "魔爪食腐狼",
		[8557] = "地穴恐魔",
		[5296] = "狂暴的怒痕雪人",
		[3528] = "月怒盔甲师",
		[5288] = "疯狂的长牙狼",
		[2641] = "邪枝猎头者",
		[8890] = "铁怒狱卒",
		[7086] = "被诅咒的软泥怪",
		[3251] = "异种幼蝎",
		[10508] = "莱斯·霜语",
		[7110] = "碧火捕猎者",
		[3560] = "治疗结界 <秘法师拉佐斯诺特>",
		[7126] = "加德纳尔猎犬",
		[14264] = "红色龙兽",
		[10464] = "哀嚎的女妖",
		[10202] = "埃苏罗斯",
		[7158] = "死木萨满祭司",
		[7287] = "工头希里克斯",
		[1114] = "丛林大猩猩",
		[5135] = "斯瓦尔布莱德·远山",
		[5427] = "疯狂的疱爪土狼",
		[10476] = "通灵学院通灵师",
		[12459] = "黑翼管理者",
		[8283] = "奴隶主托恩·黑心",
		[11918] = "高戈裂石者",
		[14456] = "黑翼卫士",
		[10394] = "黑衣守卫斥候",
		[7246] = "沙怒暗影猎手",
		[12457] = "黑翼缚法者",
		[5306] = "乱羽角鹰雄兽",
		[10442] = "多彩雏龙",
		[10758] = "恐怖图腾强盗",
		[7286] = "祖尔法拉克僵尸",
		[12100] = "熔岩掠夺者",
		[5255] = "木爪劫掠者",
		[7310] = "变异风险投资公司工人",
		[5271] = "阿塔莱死亡行者",
		[12265] = "熔岩爪牙 <火焰之王>",
		[14664] = "堕落治疗之泉图腾 V <Pandajustice>",
		[5295] = "暴怒的深痕雪人",
		[2686] = "枯木巢穴守卫",
		[11030] = "无脑的亡灵",
		[7288] = "大工头普兹克·加里维克斯",
		[4500] = "莫格穆洛克大王",
		[5287] = "长牙嚎叫者",
		[13020] = "堕落的瓦拉斯塔兹",
		[3243] = "长鬃草原狮",
		[8667] = "狂风漩涡",
		[232] = "农夫雷恩",
		[3712] = "怒尾纳迦",
		[3925] = "蓟皮复仇者",
		[7438] = "冬泉巨熊怪",
		[7446] = "疯狂的碎齿熊",
		[7454] = "狂暴枭兽",
		[9239] = "燃棘秘法师",
		[5423] = "沙漠鞭尾蝎",
		[5431] = "海浪龟",
		[12921] = "被激怒的污林熊怪",
		[3748] = "污林萨满祭司",
		[5455] = "森提帕尔异种蝎",
		[15307] = "土色圣殿骑士",
		[5471] = "砂槌食人魔",
		[5722] = "哈扎斯",
		[10447] = "多彩龙人",
		[5485] = "灌木塑根者",
		[687] = "丛林捕猎者",
		[15112] = "洗脑图腾 <妖术师金度>",
		[3784] = "裂木沼泽兽",
		[10440] = "瑞文戴尔男爵",
		[4124] = "千针石林山狮",
		[3115] = "尘风鹰身人",
		[2064] = "议员哈尔丁",
		[7606] = "欧罗·血眼",
		[12420] = "黑翼法师",
		[4535] = "被驯服的斗猪",
		[3445] = "鲁格维兹主管",
		[3820] = "野棘毒蜘蛛",
		[3824] = "幽爪嗥叫者",
		[13257] = "莫高特·深炉",
		[5615] = "废土游荡者",
		[5623] = "废土刺客",
		[1545] = "邪鳍泥浆鱼人",
		[3844] = "治疗结界 IV <钢鬃先知>",
		[5647] = "沙怒猎头者",
		[9259] = "火印步兵",
		[11322] = "燃刃信徒",
		[11338] = "哈卡暗影法师",
		[7726] = "恐怖图腾博学者",
		[11370] = "拉扎什寡妇蛛",
		[1809] = "食腐秃鹫",
		[3255] = "赤鳞尖啸龙",
		[5711] = "可悲的奥戈姆",
		[5719] = "摩弗拉斯",
		[11450] = "戈多克掠夺者",
		[6521] = "有生烈焰",
		[9167] = "狂怒的翼手龙",
		[8438] = "哈卡莱护血者",
		[10218] = "超强治疗结界 <燃棘巫医>",
		[13577] = "雷矛山羊骑兵指挥官",
		[5237] = "戈杜尼食人魔法师",
		[4007] = "深苔毒蜘蛛",
		[3924] = "蓟皮萨满祭司",
		[5799] = "汉娜·刃叶",
		[3928] = "腐烂的泥浆怪",
		[7155] = "死木探险者",
		[4532] = "剃刀沼泽兽王",
		[11658] = "熔核巨人",
		[3944] = "怒尾女祭司",
		[5270] = "阿塔莱食尸者",
		[5855] = "熔岩元素",
		[11669] = "烈焰小鬼",
		[9691] = "毒尖蝎",
		[7273] = "加兹瑞拉",
		[6554] = "格里什毒刺蝎",
		[6514] = "安戈洛猩猩",
		[9692] = "血斧袭击者",
		[6506] = "疾奔暴掠龙",
		[3992] = "风险投资公司工程师",
		[3988] = "风险投资公司操作员",
		[9819] = "黑手老兵",
		[11882] = "暮光唤石者",
		[5225] = "黑暗粘液虫",
		[13022] = "抽笞者",
		[14025] = "腐化的青铜雏龙",
		[4012] = "巨翼双足飞龙",
		[4016] = "灵龙",
		[5991] = "红石晶鳞蜥蜴",
		[4024] = "血怒杀戮者",
		[8440] = "哈卡的化身",
		[4032] = "奇美拉幼崽",
		[4036] = "游荡的焰灵",
		[9396] = "震地者",
		[4044] = "黑色石化蜥蜴",
		[11462] = "扭木树人",
		[5685] = "被俘虏的食尸鬼",
		[12468] = "死爪地卜师",
		[12460] = "黑翼龙人护卫",
		[11373] = "拉扎什眼镜蛇",
		[2260] = "辛迪加潜行者",
		[12461] = "黑翼监工",
		[6552] = "格里什工蝎",
		[14265] = "黑色龙兽",
		[3265] = "钢鬃猎手",
		[11518] = "祈求者耶戈什",
		[4120] = "雷鸣岩石元素",
		[4096] = "加拉克逐风者",
		[6167] = "雌奇美拉",
		[2065] = "议员库珀",
		[2061] = "议员萨奇尔",
		[4128] = "乱齿捕猎者",
		[1555] = "邪恶的夜行蜘蛛",
		[10375] = "尖塔小蜘蛛",
		[11371] = "拉扎什毒蛇",
		[3127] = "毒尾蝎",
		[14507] = "高阶祭司温诺希斯",
		[950] = "沼泽空谈者",
		[12458] = "黑翼工头",
		[3381] = "南海歹徒",
		[12464] = "死爪狂乱者",
		[10383] = "破碎的死尸 <被毁坏的死尸>",
		[5251] = "木爪捕兽者",
		[1151] = "海鳄",
		[14601] = "埃博诺克",
		[10470] = "通灵学院新学徒",
		[4248] = "杂毛土狼",
		[5363] = "北泉游荡者",
		[730] = "泰希斯",
		[15212] = "苍白圣殿骑士",
		[1144] = "莫什奥格巫医",
		[10414] = "缝补憎恶",
		[7153] = "死木战士",
		[7157] = "死木复仇者",
		[6375] = "雷首角鹰兽",
		[4344] = "尘泥杂斑鳄鱼",
		[10699] = "未知目标 <地穴恐魔>",
		[6559] = "粘稠的软泥怪",
		[14825] = "衰老的侍女",
		[1059] = "残忍的安纳希克",
		[7125] = "加德纳尔恶犬",
		[4512] = "腐烂的阿迦玛",
		[6527] = "焦油爬行者",
		[4469] = "碧绿软泥怪",
		[4392] = "腐蚀性的沼泽软泥怪",
		[1534] = "哀嚎的鬼魂",
		[11197] = "无脑的骷髅 <瑞文戴尔男爵>",
		[12922] = "小鬼爪牙",
		[0] = "燃烧",
		[4440] = "剃刀沼泽图腾师",
		[8876] = "沙怒侍僧",
		[4328] = "火鬃守卫",
		[10955] = "被召唤的水元素 <红衣魔术师>",
		[2254] = "破碎岭虐待者",
		[6519] = "焦油兽王",
		[8956] = "怒爪熊",
		[6195] = "恶鞭海妖",
		[2249] = "凶恶的雪人",
		[6551] = "格里什异种蝎",
		[2257] = "玛格索尔",
		[2261] = "辛迪加卫士",
		[2265] = "希尔斯布莱德见习铁匠",
		[1087] = "盐齿钳嘴鳄",
		[6518] = "焦油潜伏者",
		[11741] = "掘泥摧毁者",
		[10411] = "纳克萨玛斯之眼",
		[13300] = "曼库斯中尉",
		[10183] = "月焰图腾 <冬泉图腾师>",
		[9164] = "老双帆龙",
		[8156] = "未知目标 <安图苏尔>",
		[9196] = "欧莫克大王",
		[4020] = "腐蚀兽",
		[12463] = "死爪火鳞龙人",
		[13338] = "熔核鼠",
		[5839] = "黑铁地质学家",
		[11323] = "燃刃执行者",
		[11339] = "哈卡暗影猎手",
		[11355] = "古拉巴什战士",
		[4664] = "火刃劫掠者",
		[11387] = "沙怒部族演讲者",
		[7769] = "哈扎里寄生虫",
		[4688] = "骨爪土狼",
		[2349] = "巨型食苔蛛",
		[11451] = "荒野萨特",
		[1082] = "盐齿鳄鱼",
		[3129] = "库尔提拉斯水兵",
		[4728] = "砂腭蜥蜴",
		[9216] = "尖石军阀",
		[2373] = "泥嘴萨满祭司",
		[12057] = "加尔",
		[7118] = "加德纳尔暗法师",
		[9163] = "双帆龙",
		[13036] = "戈多克驯狼",
		[11738] = "掠沙蜘蛛",
		[4196] = "异种蝎群 <森提帕尔群居蝎>",
		[9596] = "班诺克·巨斧",
		[11659] = "熔核摧毁者",
		[10263] = "燃烧地狱卫士 <裂盾术士>",
		[9583] = "血斧精兵",
		[2417] = "守财奴格雷尔伯格",
		[2421] = "玛克拉克",
		[11739] = "石行蜘蛛",
		[1152] = "钳嘴鳄鱼",
		[5239] = "戈杜尼大法师",
		[11787] = "未知目标",
		[5359] = "海岸巨人",
		[7902] = "寻宝冒险家",
		[2449] = "平民维尔克斯",
		[7429] = "霜槌保卫者",
		[7846] = "吞噬者特雷姆斯",
		[11883] = "暮光主宰",
		[6513] = "安戈洛巨猩猩",
		[11915] = "高戈护石者",
		[2473] = "格拉尼斯塔德",
		[5291] = "哈卡莱霜翼飞蛇",
		[14460] = "炽热入侵者",
		[3226] = "堕落蝎",
		[2106] = "药剂师博拉尔德",
		[5687] = "被俘虏的憎恶",
		[7039] = "战争掠夺者",
		[7047] = "黑色小龙",
		[10437] = "奈鲁布恩坎",
		[5475] = "砂槌术士",
		[4099] = "加拉克掠夺者",
		[667] = "劈颅战士",
		[2521] = "蓝鬃猩猩",
		[1537] = "血色狂热者",
		[5245] = "祖卡什异种蝎",
		[7111] = "碧火唤魔者",
		[6020] = "滑壳龙虾人",
		[4506] = "血帆水兵",
		[1870] = "鸦爪之手",
		[2549] = "加尔·盐蹄",
		[2553] = "枯木暗影法师",
		[5263] = "阿塔莱木乃伊",
		[2561] = "高地猎兽龙",
		[2565] = "巨型平原狼蛛",
		[2569] = "石拳虐待者",
		[8214] = "加林德·夏龙",
		[2927] = "邪恶的枭兽",
		[10316] = "黑手监禁者",
		[2585] = "激流堡仲裁者",
		[11368] = "觅血蝙蝠",
		[8317] = "阿塔莱死亡行者的灵魂 <阿塔莱死亡行者>",
		[2630] = "地缚图腾",
		[7247] = "沙怒噬魂者",
		[10412] = "地穴爬行者",
		[7883] = "安德雷·费尔比德",
		[7271] = "巫医祖穆拉恩",
		[5232] = "戈杜尼蛮兵",
		[5240] = "戈杜尼术士",
		[3245] = "暴躁的平原陆行鸟",
		[5256] = "阿塔莱战士",
		[8477] = "骷髅仆从",
		[5272] = "铁鬃灰熊",
		[5280] = "噩梦龙族",
		[14666] = "堕落风怒图腾 III <胖肥肥>",
		[8541] = "憎恨吟唱者",
		[5304] = "乱羽翼鹿",
		[2657] = "训练有素的锋喙狮鹫",
		[3277] = "巫翼游荡者",
		[2256] = "破碎岭执行者",
		[3283] = "风险投资公司执行者",
		[8637] = "黑铁巡逻兵",
		[10413] = "地穴兽",
		[5360] = "被缩小的深海巨人",
		[14826] = "祭品巨魔",
		[8442] = "暗影蛛丝偷猎者",
		[2693] = "高原神射手",
		[7439] = "冬泉萨满祭司",
		[7447] = "冰风奇美拉幼兽",
		[10415] = "阿莎利水晶",
		[13138] = "斯本瑟尔中尉",
		[5424] = "沙漠疾行蝎",
		[3456] = "钢鬃探路者",
		[10876] = "亡灵甲虫 <奈鲁布恩坎>",
		[2725] = "滚烫的雏龙",
		[5456] = "森提帕尔毒刺蝎",
		[8877] = "沙怒狂热者",
		[10940] = "往日的幽灵",
		[8561] = "烂苔暗影猎手",
		[3425] = "草原徘徊者",
		[10418] = "红衣卫兵",
		[8957] = "怒爪灰熊",
		[2757] = "布莱克拉什",
		[10756] = "滚烫的水元素",
		[2356] = "老灰熊",
		[10742] = "黑手驭龙者",
		[2773] = "奥卡拉尔",
		[7977] = "加莫里塔",
		[14882] = "阿塔莱侍女",
		[12940] = "鞭笞者沃尔沙",
		[11982] = "玛格曼达",
		[13021] = "扭木摧毁者",
		[14965] = "疯狂的觅血蝠",
		[7034] = "火腹食人魔法师",
		[9165] = "小翼手龙",
		[5616] = "废土窃贼",
		[9197] = "尖石战斗法师",
		[3258] = "刺背猎手",
		[10184] = "奥妮克希亚",
		[5648] = "沙怒暗影法师",
		[9261] = "火印暗法师",
		[11324] = "燃刃术士",
		[11340] = "哈卡高阶祭司",
		[11356] = "古拉巴什勇士",
		[11372] = "拉扎什蝰蛇",
		[11388] = "枯木部族演讲者",
		[5260] = "格罗多克猿人",
		[5712] = "祖罗",
		[7767] = "枯木地狱猎犬 <枯木召唤者>",
		[4263] = "深苔幼蛛",
		[5292] = "深痕雪人",
		[684] = "深喉猎豹",
		[9453] = "亚奎门塔斯",
		[2692] = "高原斥候",
		[1942] = "腐皮暴徒",
		[7442] = "冬泉探路者",
		[8543] = "缝合憎恶",
		[2738] = "激流堡骑兵",
		[5800] = "马库斯·拜尔",
		[7855] = "南海海盗",
		[12050] = "雷矛防御者",
		[2255] = "破碎岭法师",
		[9026] = "征服者派隆",
		[5840] = "黑铁锻造师",
		[2925] = "银鬃嗥狼",
		[2929] = "野蛮的枭兽",
		[15308] = "暮光预言者",
		[11740] = "掘泥打击者",
		[4517] = "亡首祭司",
		[1869] = "鸦爪勇士",
		[1943] = "暴怒的腐皮豺狼人",
		[2928] = "远古枭兽",
		[8324] = "阿塔莱骷髅 <祖罗>",
		[6132] = "剃刀沼泽仆从",
		[1565] = "血帆水手",
		[759] = "失落者猎人",
		[8138] = "苏利萨斯幼崽",
		[1489] = "赞吉尔猎人",
		[1491] = "赞吉尔纳迦",
		[10481] = "复生的尸体",
		[11948] = "范达尔·雷矛",
		[5984] = "饥饿的弯牙土狼",
		[5992] = "灰鬃野猪",
		[3825] = "幽爪前锋",
		[14821] = "拉扎什迅猛龙",
		[1505] = "夜行蜘蛛",
		[1507] = "血色新兵",
		[15213] = "暮光霸主",
		[12076] = "熔岩元素",
		[8095] = "苏利萨斯沙行者",
		[2067] = "议员布伦斯维克",
		[1547] = "衰老的黑暗犬",
		[14187] = "亚斯拉玛尼斯",
		[8127] = "安图苏尔",
		[1523] = "碎颅士兵",
		[1525] = "腐烂的死者",
		[1527] = "饥饿的死尸",
		[1529] = "可怕的血僵尸",
		[9262] = "火印祈求者",
	},
	["death_recap"] = {
		["enabled"] = true,
		["show_segments"] = false,
		["show_life_percent"] = false,
		["relevance_time"] = 7,
	},
	["spell_pool"] = {
		[0] = 11,
		["叉状闪电"] = "尖石秘法师",
		["法术反制"] = 8,
		["致盲"] = 4,
		["暗影命令"] = "维克多·奈法里奥斯",
		["酸液喷射"] = "噩梦龙族",
		["酸息术"] = "德姆塞卡尔",
		["恢复"] = "裂盾侍僧",
		["愈合"] = 11,
		["冰霜灼烧"] = "克洛玛古斯",
		["伏击"] = 4,
		["精神"] = 7,
		["深度沉睡"] = "伊兰尼库斯的阴影",
		["制造魔法红宝石"] = 8,
		["急救"] = 5,
		["速效毒药 II"] = 4,
		["血之契印"] = 9,
		["真言术：韧"] = 5,
		["强效敏捷"] = 4,
		["复苏之风"] = 11,
		["荆棘术"] = 11,
		["至高能量"] = 9,
		["召唤传送门"] = "未知目标",
		["野葡萄药水"] = 8,
		["烈焰弹"] = 3,
		["喂养宠物效果"] = 3,
		["安抚心灵"] = 5,
		["宁神射击"] = 3,
		["灼热武器"] = 1,
		["快速治疗"] = 5,
		["雷霆一击"] = "燃烧地狱卫士 <裂盾术士>",
		["龙王印记"] = 5,
		["嗜血"] = 1,
		["焚烧"] = "克洛玛古斯",
		["闷棍"] = 4,
		["暗影迷雾"] = "黑手恐法师",
		["横扫摔绊"] = "古拉巴什猎头者",
		["洗脑"] = "洗脑图腾 <妖术师金度>",
		["末日降临"] = "鲁西弗隆",
		["鞭根块茎"] = 4,
		["净化术"] = 7,
		["召唤仆人"] = 4,
		["暗影射击"] = "荒野背叛者",
		["装满哈卡之卵"] = 5,
		["闪电吐息"] = "臭不要脸滴 <小明鸽>",
		["爆炸死尸"] = "破碎的死尸 <被毁坏的死尸>",
		["喷吐"] = "拉扎什眼镜蛇",
		["巨熊形态"] = 11,
		["女妖诅咒"] = "安娜丝塔丽男爵夫人",
		["召唤玩家"] = "奥妮克希亚",
		["切割"] = 4,
		["冰冻术"] = "盖斯",
		["神圣太阳果"] = 1,
		["释放蟾蜍"] = "哈卡巫医",
		["心灵视界"] = 5,
		["音素爆破"] = "巨型沼泽蝙蝠",
		["献祭陷阱"] = 3,
		["奥术冲击"] = "通灵学院管理者",
		["侦测隐形"] = 9,
		["寒冰之墓"] = "苍白的玛勒基",
		["召唤骷髅"] = 5,
		["石盾术"] = 1,
		["冰锥术"] = 8,
		["低吼"] = "是断牙不是断崖 <动力二踢脚>",
		["击昏"] = "吞咽者拉姆斯登",
		["制造强效灵魂石"] = 9,
		["制造魔法玛瑙"] = 8,
		["火焰之盾"] = "燃烧地狱卫士 <裂盾术士>",
		["强效石盾"] = 1,
		["挑战怒吼"] = 1,
		["镇压"] = "噩梦镇压者",
		["锤击昏迷效果"] = 4,
		["致伤"] = 4,
		["斩杀"] = 1,
		["自由行动"] = 1,
		["智力提高"] = 8,
		["压制"] = 1,
		["碎灵"] = 7,
		["智慧烈风"] = 4,
		["强力治疗结界"] = "妖术师金度",
		["上古狂乱"] = "上古熔火恶犬",
		["冰冻"] = 8,
		["熔岩镣铐"] = "加尔",
		["邪恶诅咒"] = 1,
		["强效怒气"] = 1,
		["精神控制"] = 5,
		["石肤术"] = 7,
		["拉格纳罗斯之手"] = "萨弗隆先驱者",
		["寒冰护体"] = 8,
		["召唤阿塔莱死亡行者的灵魂"] = "阿塔莱死亡行者",
		["棕狼"] = 1,
		["毁灭"] = "祖利安雌猎虎",
		["枪械射击"] = 1,
		["怒气"] = 1,
		["伤害吸收"] = 9,
		["死亡缠绕"] = 9,
		["暗影烈焰"] = "费尔默",
		["蛛网爆炸"] = 1,
		["挑战咆哮"] = 11,
		["灵魂哀嚎"] = "鬼灵研究员",
		["打击"] = "裂盾袭击者",
		["战斗命令"] = "觅血者前锋",
		["火焰抗性"] = 7,
		["火焰吐息"] = 8,
		["狂暴怒火"] = "巴瑟拉斯镇长",
		["顺劈斩"] = 1,
		["毒性震荡"] = "高阶祭司玛尔里",
		["蛛后的乳汁"] = "烟网蛛后",
		["温暖之焰"] = "狂野的拉佐格尔",
		["恢复法力"] = 7,
		["燃烧"] = "熔岩炸弹",
		["多重射击"] = 3,
		["狂野怒火"] = 3,
		[56488] = 1,
		["织网"] = "拉扎什寡妇蛛",
		["喂养宠物"] = 3,
		["召唤机械雪人"] = 7,
		["食尸"] = 4,
		["急奔"] = 11,
		["法术反制 - 沉默"] = 8,
		["高爆炸弹"] = 3,
		["狂暴之怒效果"] = 1,
		["震荡射击"] = 3,
		["防护火焰结界"] = 8,
		["寒冰屏障"] = 8,
		["风花果"] = 4,
		["生命偷取"] = 4,
		["追踪龙类"] = 3,
		["Summon Lava Burst G"] = "熔核鼠",
		["热疫"] = "阿塔莱木乃伊",
		["毒蛇钉刺"] = 3,
		["灵魂石复活"] = 9,
		["厄运诅咒"] = 9,
		["地狱火效果"] = "堕落地狱火 <传说中的包子>",
		["虚弱诅咒"] = "欧罗·血眼",
		["野性冲锋"] = 11,
		["冰霜强化"] = 8,
		["魔法吸收"] = 8,
		["强化震荡射击"] = 3,
		["祖穆拉恩结界"] = "巫医祖穆拉恩",
		["召唤虚空行者"] = 9,
		["净化逃脱"] = 4,
		["凶猛撕咬"] = 11,
		["孵卵"] = "高阶祭司玛尔里",
		["召唤水元素"] = "红衣魔术师",
		["阿塔莱骷髅图腾"] = "祖罗",
		["照明弹"] = 3,
		["智力"] = 7,
		["闪电之盾"] = 7,
		["复仇昏迷"] = 1,
		["变形！"] = 7,
		["缓落术"] = 8,
		["制造块茎"] = "地鼠 <冬天吃栗子>",
		["思维敏捷"] = 8,
		["召唤仲夏之魂"] = 8,
		["陷地图腾"] = "剃刀沼泽图腾师",
		["火舌图腾"] = 7,
		["丢弃武器"] = 1,
		["娅尔罗的印记"] = "高阶祭司娅尔罗",
		["毒云术"] = 7,
		["银色黎明委任徽章"] = 7,
		["神圣之眼"] = 5,
		["不稳定化合物"] = "觅血者前锋",
		["挥击"] = 11,
		["抗寒图腾"] = 7,
		["致命武器"] = 1,
		["精神分流"] = 5,
		["法力之潮"] = "法力之潮图腾 III <柒丨怒风>",
		["安图苏尔的爪牙"] = "安图苏尔",
		["复活术"] = 5,
		["燃烧刺激"] = "堕落的瓦拉斯塔兹",
		["上钩拳"] = "血斧好战者",
		["猛禽一击"] = 3,
		["祛病术"] = 7,
		["复活"] = "被禁锢的灵魂",
		["精神鞭笞"] = "通灵学院侍僧",
		["闪现术"] = 8,
		["冰霜抗性"] = 7,
		["根基图腾"] = 7,
		["破甲攻击"] = 1,
		["死尸虫"] = "被撕裂的死尸",
		["强效昏睡"] = 5,
		["反魔法护盾"] = "哈卡祭司",
		["雏龙之语：黑色"] = "多彩龙兽",
		["变形术"] = 8,
		["奥特兰克泉水"] = 5,
		["诺格弗格药剂"] = 5,
		["裂颅"] = "黑手精英",
		["Warder Despawn"] = "安图苏尔",
		["元素大师"] = 8,
		["堕落之血"] = "哈卡",
		["恶毒撕裂"] = "扭木树人",
		["燃烧之焰"] = "死爪地卜师",
		["神圣之灵"] = 5,
		["圣光击"] = "穆尔塔",
		["闪电箭"] = 7,
		["刺破"] = "尖石执行者",
		["钻土虫酸液"] = "钻土虫",
		["召唤阿塔莱骷髅"] = "阿塔莱图腾 <祖罗>",
		["禁闭"] = "黑手监禁者",
		["穿刺"] = "燃棘猎头者",
		["猛击"] = 1,
		["黑暗瘟疫"] = "复生的尸体",
		["迅捷棕色科多兽"] = 11,
		["雄鹰守护"] = 3,
		["野性冲锋效果"] = 11,
		["昏阙"] = 5,
		["背刺"] = "燃棘暗影猎手",
		["毒药"] = "拉文",
		["冲锋"] = 1,
		["残废术"] = "图萨丁暗影法师",
		["复活亡灵甲虫"] = "奈鲁布恩坎",
		["破碎一击"] = "戈多克蛮兵",
		["守护之刺"] = 3,
		["暗影之触"] = 9,
		["兴奋毒剂"] = "拉扎什毒血蜘蛛",
		["法力护盾"] = 8,
		["鬼魅幻影"] = "幽灵市民",
		["龙翼攻击"] = "奥妮克希亚",
		["追踪人型生物"] = 3,
		["熔岩之盾"] = "烈焰之子",
		["末日决战"] = "迦顿男爵",
		["撕碎"] = 11,
		["迅捷治愈"] = 11,
		["拉格纳罗斯之拳"] = "烈焰行者",
		["裂筋"] = "戈多克驯狼",
		["旋风倾泻"] = "剃刀沼泽刺鬃守卫",
		["闪耀徽章"] = 1,
		["摧毁蛋"] = "狂野的拉佐格尔 <含笑半步钉丶>",
		["沙斯拉尔的诅咒"] = "沙斯拉尔",
		["尖牙撕咬"] = "熔火恶犬",
		["力量"] = 7,
		["敏捷"] = 7,
		["毒蝎钉刺"] = 3,
		["自然迅捷"] = 7,
		["生命虹吸"] = 9,
		["击倒"] = "燃棘掷斧者",
		["刺穿护甲"] = "燃棘猎头者",
		["召唤灰烬元素"] = 8,
		["召唤仪式"] = 9,
		["灼烧"] = 8,
		["疾病之云"] = "生病的食尸鬼",
		["进食"] = 7,
		["能量无常"] = 5,
		["剧烈震颤"] = "熔核摧毁者",
		["法力燃烧"] = "燃棘暗影牧师",
		["暗影箭"] = "裂盾术士",
		["战斗怒吼"] = 1,
		["火焰箭"] = "格布科尔 <乖丫头>",
		["召唤雷德·黑手"] = "盖斯",
		["灼热之痛"] = 9,
		["驱散魔法"] = "火印暗法师",
		["Burning Felguard Spawn"] = "燃烧地狱卫士 <裂盾术士>",
		["恐吓嚎叫"] = "石翼尖啸者",
		["奥术射击"] = 3,
		["龙血之痛：蓝"] = "克洛玛古斯",
		["召唤尖塔小蜘蛛"] = "尖塔蜘蛛",
		["致命毒药"] = "通灵魔",
		["呀啊啊啊啊"] = 7,
		["盾牌猛击"] = 1,
		["Enrage Trigger"] = "火誓者",
		["强效智力"] = 7,
		["冰冻陷阱"] = 3,
		["群体打击"] = "巴瑟拉斯镇长",
		["迅捷祖利安猛虎"] = 9,
		["急速射击"] = 3,
		["精灵之火"] = 11,
		["横扫攻击"] = "狂热者扎斯",
		["制造特效灵魂石"] = 9,
		["恶魔学识大师"] = 9,
		["缴械"] = 1,
		["乱舞"] = 7,
		["黑暗符文"] = 5,
		["折磨"] = "马克拉斯 <老牛的秋天>",
		["坚定信念"] = 7,
		["野性赐福"] = 11,
		["神圣力量"] = 1,
		["脆弱护甲"] = 4,
		["鲁西弗隆的诅咒"] = "鲁西弗隆",
		["迅捷森林狼"] = 1,
		["Summon Lava Burst E"] = "熔核鼠",
		["变异鱼大餐"] = 8,
		["成长"] = 4,
		["神圣新星"] = 5,
		["分裂"] = "熔岩爪牙 <火焰之王>",
		["假死"] = 3,
		["休眠"] = 11,
		["暗影闪现"] = "维克多·奈法里奥斯",
		["强效护甲"] = 1,
		["能量灌注"] = 5,
		["熔化护甲"] = "烈焰守卫",
		["烈焰之矛"] = "萨弗隆先驱者",
		["远古之怒"] = 7,
		["紫手"] = "黑翼缚法者",
		["猫鼬撕咬"] = 3,
		["灵魂分流"] = "图萨丁亡灵法师",
		["炎爆术"] = "焚化者古雷曼格",
		["恐吓野兽"] = 3,
		["速效毒药 V"] = 4,
		["彩带之舞"] = 8,
		["恶魔之门"] = "黑翼管理者",
		["召唤哈卡"] = "哈卡的阴影",
		["黑暗打击"] = "烈焰行者祭司",
		["棕色骸骨军马"] = 1,
		["恐惧嚎叫"] = 9,
		["骨甲术"] = "图萨丁亡灵法师",
		["野兽之眼"] = 3,
		["暗影诅咒"] = 9,
		["放逐术"] = 9,
		["生命石治疗"] = 9,
		["地缚图腾"] = 7,
		["霜甲术"] = 8,
		["风怒图腾"] = 7,
		["煽动烈焰"] = "火焰行者",
		["狂热"] = 4,
		["剧痛鞭笞"] = "布罗奥拉 <墨丶冷風>",
		["燃烧之愿"] = 9,
		["疾跑"] = 4,
		["根基图腾效果"] = 7,
		["复活宠物"] = 3,
		["风墙"] = 7,
		["盾牌专精"] = 1,
		["宁静之风图腾"] = 7,
		["心灵震爆"] = 5,
		["灵魂爆裂"] = "巫毒之魂",
		["安抚龙类"] = "狂野的拉佐格尔",
		["风暴打击"] = 7,
		["冰霜陷阱"] = 3,
		["放置未淬火的剑"] = 1,
		["冲动"] = 4,
		["妖术"] = "燃棘暗影牧师",
		["心灵尖啸"] = 5,
		["暗影震击"] = "鲁西弗隆",
		["弩射击"] = 1,
		["沉睡"] = 1,
		["十字军打击"] = "红衣豪侠",
		["暗影强化"] = 9,
		["紫色迅猛龙"] = 8,
		["抗性"] = 1,
		["火焰新星"] = "火印祈求者",
		["石像鬼打击"] = "石翼尖啸者",
		["烈焰光环"] = "死爪火鳞龙人",
		["暴风雪"] = 8,
		["翼龙钉刺"] = "哈卡暗影猎手",
		["洛恩塔姆之魂"] = "普希林",
		["爆炸陷阱"] = 3,
		["冰甲术"] = 8,
		["原始祝福"] = 3,
		["胸闷"] = 4,
		["战斗姿态"] = 1,
		["吸取灵魂"] = 9,
		["灵魂虹吸"] = 9,
		["免疫恐惧/变形/昏迷"] = 5,
		["石肤图腾"] = 7,
		["召唤地狱战马"] = 9,
		["龙血之痛：红"] = "克洛玛古斯",
		["强化格挡"] = "剃刀沼泽防御者",
		["毒性图腾"] = 4,
		["魔法反射"] = "管理者埃克索图斯",
		["摔绊"] = 3,
		["脚踢"] = "燃棘暗影猎手",
		["惩戒痛击"] = 1,
		["灵魂撕咬"] = "沙怒噬魂者",
		["全力一击"] = "巴瑟拉斯镇长",
		["致命毒药 III"] = 4,
		["月火术"] = 11,
		["炉石"] = 8,
		["猛踢"] = "血斧精兵",
		["暗影守卫"] = 5,
		["神恩回复"] = 5,
		["培植种子"] = 4,
		["催眠术"] = "噩梦龙族",
		["耐力提高"] = 1,
		["奥术光辉"] = 8,
		["挫志咆哮"] = 11,
		["丢下武器"] = 4,
		["元素浩劫"] = 7,
		["迅捷灰狼"] = 1,
		["召唤宠物"] = 3,
		["吸血鬼的拥抱"] = 5,
		["拦截昏迷"] = 1,
		["暗影形态"] = 5,
		["爆裂印记"] = "死爪龙人队长",
		["削骨之刃"] = 1,
		["混乱集中"] = "荒野魔仆",
		["酸性血液"] = 3,
		["Summon Lava Burst I"] = "熔核鼠",
		["元素诅咒"] = 9,
		["天选印记效果"] = 1,
		["时间流逝"] = "克洛玛古斯",
		["暗影之盾"] = "阿塔莱高阶祭司",
		["恶毒之咬"] = "上古熔火恶犬",
		["致密磨刀石"] = 1,
		["猛虎之怒"] = 11,
		["自然抗性图腾"] = 7,
		["法力之泉图腾"] = 7,
		["戈多克绿酒"] = 1,
		["震耳尖啸"] = "尖叫的女妖",
		["灭龙"] = "死爪龙人",
		["沙斯拉尔之门"] = "沙斯拉尔",
		["畏缩"] = "豹 <暗茅翠花>",
		["灰色科多兽"] = 7,
		["邪恶狂热"] = "衰老的侍女",
		["治疗之泉"] = 7,
		["净化新星"] = "哈卡祭司",
		["强效变形术"] = "黑翼缚法者",
		["雏龙之语：蓝色"] = "黑翼龙人护卫",
		["水下呼吸"] = 7,
		["追踪野兽"] = 3,
		["造食术"] = 8,
		["奥法药剂"] = 8,
		["震荡猛击"] = 1,
		["厚符文布绷带"] = 9,
		["耐力"] = 7,
		["防护元素图腾"] = "燃棘巫医",
		["召唤恐惧战马"] = 9,
		["耶尼库的解脱"] = 7,
		["献祭"] = 9,
		["奥术强化"] = 8,
		["破甲"] = "奥根",
		["无情"] = 4,
		["割碎"] = "熔火怒犬",
		["感染撕咬"] = "觅血者前锋",
		["厚魔纹绷带"] = 7,
		["猫鼬药剂"] = 1,
		["牛皮糖"] = 11,
		["拉扎什迅猛龙"] = 1,
		["英雄"] = 4,
		["Fire"] = "环境伤害 (火烧)",
		["恶魔牺牲"] = 9,
		["乱射"] = 3,
		["烈焰"] = "烈焰守卫",
		["恶性毒药"] = "地穴兽",
		["地狱烈焰效果"] = 9,
		["出血"] = 4,
		["驱邪术"] = "奥里克斯",
		["Summon Lava Burst F"] = "熔核鼠",
		["奥术防护"] = 4,
		["冰柱"] = "加兹瑞拉",
		["利斧乱舞"] = "古拉巴什掷斧者",
		["石化武器"] = 7,
		["多疑"] = 9,
		["火锥术"] = "烈焰守卫",
		["生命 II"] = 1,
		["灵魂链接"] = 9,
		["脆弱"] = "祖罗尔",
		["逃脱"] = 3,
		["旋风斩效果"] = "大酋长雷德·黑手 <盖斯>",
		["神圣怒火"] = "高阶祭司温诺希斯",
		["精神祷言"] = 5,
		["短暂强力"] = 8,
		["沉默"] = "高阶祭司塞卡尔",
		["爆发"] = "熔岩裂缝",
		["包围之网"] = "地穴爬行者",
		["冰霜箭"] = 3,
		["炽热之地"] = "奥妮克希亚",
		["治疗波"] = 7,
		["!Melee"] = 7,
		["兽群领袖"] = 11,
		["熔岩冲击"] = "拉格纳罗斯",
		["攻击弱点"] = "白骨魔像",
		["星火术"] = 11,
		["灵感"] = 5,
		["恢复生命"] = 9,
		["皱缩"] = "哈卡巫医",
		["霜狼嗥叫者"] = 8,
		["挥砍"] = "乌克兹·沙顶",
		["大地之力"] = 7,
		["狂暴回复"] = 11,
		["血液虹吸"] = "哈卡",
		["恢复能量"] = 4,
		["蝰蛇钉刺"] = 3,
		["烈焰风暴"] = "火印祈求者",
		["防护火焰"] = 11,
		["献祭陷阱效果"] = 3,
		["仲夏腊肠"] = 8,
		["腐蚀之毒"] = "高阶祭司玛尔里",
		["盾刺"] = "洛若尔",
		["龙翼打击"] = "费尔默",
		["灵猴守护"] = 3,
		["追踪隐藏生物"] = 3,
		["灼热箭"] = 3,
		["飓风"] = 11,
		["喝水"] = 7,
		["冰霜陷阱光环"] = 3,
		["噬灵瘟疫"] = 5,
		["火舌攻击"] = 1,
		["荆棘光环"] = "主宰拉姆塔斯",
		["重伤"] = 1,
		["荆棘箭雨"] = "相位鞭笞者",
		["弓射击"] = 1,
		["邪恶攻击"] = 4,
		["寒冰箭"] = 8,
		["暗影冥思"] = 9,
		["巨人药剂"] = 4,
		["强效治疗术"] = 5,
		["召唤魅魔"] = 9,
		["女妖哀嚎"] = "尖叫的女妖",
		["Summon Lava Burst A"] = "熔核鼠",
		["中毒"] = "拉扎什眼镜蛇",
		["自动射击"] = 3,
		["汹涌"] = "熔岩奔腾者",
		["救助者的牺牲"] = 8,
		["赞扎之光"] = 8,
		["真言术：盾"] = 5,
		["自杀"] = "阿莎利水晶",
		["血性狂暴"] = 1,
		["自然抗性"] = 7,
		["厚甲蝎之击"] = 7,
		["急速冲锋"] = "被驯服的斗猪",
		["反手一击"] = "黑手精英",
		["自然之赐"] = 11,
		["投网"] = "剃刀沼泽守卫",
		["脑部损伤"] = 4,
		["重击"] = 11,
		["斯坦索姆圣水"] = 1,
		["多彩混乱"] = "维克多·奈法里奥斯",
		["火息术"] = "奥妮克希亚",
		["重创"] = 4,
		["恶魔耐力"] = 9,
		["自然之握"] = 11,
		["牺牲"] = "范格拉夫",
		["先祖之魂"] = 7,
		["绿色骸骨战马"] = 4,
		["红龙精华"] = "堕落的瓦拉斯塔兹",
		["铁皮手雷"] = 8,
		["法力之泉"] = "法力之泉图腾 IV <柒丨怒风>",
		["割裂"] = 4,
		["搜索"] = 4,
		["暗灰狼"] = 3,
		["泰坦合剂"] = 1,
		["法力回复"] = 5,
		["速效毒药 VI"] = 4,
		["投掷"] = "燃棘猎头者",
		["脊骨收割者"] = 1,
		["治疗之环"] = "黑翼工头",
		["清毒图腾"] = 7,
		["撒网器"] = 4,
		["召唤祖利安守护者"] = "高阶祭司塞卡尔",
		["射击"] = 5,
		["烈焰鞭笞"] = "奥妮克希亚守卫",
		["毒药瓶"] = "黑翼技师",
		["补充法力"] = 8,
		["上古恐慌"] = "上古熔火恶犬",
		["霜寒刺骨"] = 8,
		["治疗药水"] = 7,
		["冲击"] = 8,
		["点燃法力"] = "迦顿男爵",
		["深冬之寒"] = 8,
		["火焰之雨"] = 9,
		["清算"] = 9,
		["荆棘诅咒"] = "黑手恐法师",
		["生命分流"] = 9,
		["回春术"] = "尖石秘法师",
		["进食充分"] = 1,
		["神圣打击"] = "红衣豪侠",
		["鲁莽"] = 1,
		["地狱火"] = "迦顿男爵",
		["点燃"] = 8,
		["灼热图腾"] = 7,
		["召唤破碎的死尸"] = "被毁坏的死尸",
		["诅咒之血"] = "腐烂的阿迦玛",
		["突进"] = "是断牙不是断崖 <动力二踢脚>",
		["放逐"] = "妖术师金度",
		["潜行"] = 4,
		["死亡之愿"] = 1,
		["奴役恶魔"] = 9,
		["破釜沉舟"] = 1,
		["统御意志"] = "烈焰行者护卫",
		["强化摔绊"] = 3,
		["夜龙之息"] = 7,
		["狂暴"] = 8,
		["使用节日酒杯"] = 8,
		["狂怒之嚎"] = 3,
		["毒云"] = "高阶祭司温诺希斯",
		["冰霜新星"] = 8,
		["痛击"] = "指挥官沃恩",
		["强效奥法药剂"] = 8,
		["火屑弹幕"] = "熔岩元素",
		["雏龙之语：绿色"] = "黑翼龙人护卫",
		["阿尔萨斯的礼物"] = 1,
		["语言诅咒"] = "戈多克术士",
		["灵魂燃烧"] = "火焰之王",
		["横扫猛击"] = "维姆萨拉克",
		["无情打击效果"] = 4,
		["Enraged Felguard Spawn"] = "未知目标 <黑翼管理者>",
		["闪电护盾"] = 1,
		["防护冰霜结界"] = 8,
		["祛病图腾"] = 7,
		["军旗"] = 3,
		["狂怒"] = "火印步兵",
		["吸取生命"] = 9,
		["诅咒增幅"] = 9,
		["掷斧"] = "指挥官沃恩",
		["火烤甜面包"] = 7,
		["暗影箭雨"] = "火印暗法师",
		["庇护"] = 1,
		["Shade Visual"] = "金度之影",
		["毛皮护甲片"] = 11,
		["猎人印记"] = 3,
		["毒液喷吐"] = "泼毒者",
		["破胆咆哮"] = "古拉巴什狂暴者",
		["强效治疗石"] = 9,
		["扰乱射击"] = 3,
		["圆弧斩"] = "复活的构造体",
		["法力之潮图腾"] = 7,
		["腐蚀酸液"] = "克洛玛古斯",
		["致残毒药"] = 4,
		["拉格纳罗斯之怒"] = "拉格纳罗斯",
		["暗影之雾"] = "衰老的侍女",
		["雏龙之语：青铜"] = "黑翼龙人护卫",
		["吸血一击"] = "巴瑟拉斯镇长",
		["超强治疗结界"] = "燃棘巫医",
		["复生"] = 11,
		["低沉咆哮"] = "奥妮克希亚",
		["治疗术"] = "裂盾侍僧",
		["放大"] = "高阶祭司玛尔里",
		["影像投射"] = "鬼灵导师",
		["战栗图腾"] = 7,
		["豹群守护"] = 3,
		["消失"] = 4,
		["缩小"] = "燃棘先知",
		["龙血之痛：青铜"] = "克洛玛古斯",
		["无荣誉目标"] = 7,
		["唤醒"] = 8,
		["心灵之火"] = 5,
		["飞扑"] = "高阶祭司耶克里克",
		["火球术"] = "火印祈求者",
		["风怒武器"] = 7,
		["烈焰震击"] = 7,
		["狂暴冲锋"] = "死爪火鳞龙人",
		["蹬踏"] = "阿塔莱侍女",
		["盾牌格挡"] = 1,
		["召唤黑手恐法师"] = "黑手召唤师",
		["指挥地鼠"] = 7,
		["魔爆术"] = 8,
		["地缚术"] = "地缚图腾 <丷凤梨丷>",
		["水上行走"] = 7,
		["大地践踏"] = "上古熔火恶犬",
		["槌击"] = 11,
		["爪击"] = 11,
		["英勇打击"] = 1,
		["激怒"] = 11,
		["狂暴之怒"] = 1,
		["次级治疗波"] = 7,
		["俯冲"] = "臭不要脸滴 <小明鸽>",
		["瑟银手榴弹"] = 1,
		["致密炸弹"] = 1,
		["剑刃乱舞"] = 4,
		["次级隐形术"] = "布罗奥拉 <墨丶冷風>",
		["治疗祷言"] = 5,
		["快速射击"] = 3,
		["嗜血术"] = "尖石战斗法师",
		["佯攻"] = 4,
		["恐慌"] = "玛格曼达",
		["龙血之痛：绿"] = "克洛玛古斯",
		["被遗忘者的意志"] = 9,
		["地精工兵炸药"] = 1,
		["魔法增效"] = 8,
		["地震术"] = 7,
		["召唤熔岩爪牙"] = "火焰之王",
		["瘟疫之云"] = "圣甲虫",
		["侦测强效隐形"] = 9,
		["点燃躯体"] = "克洛玛古斯",
		["恶魔符文"] = 3,
		["复仇"] = 1,
		["钻石水瓶"] = 1,
		["洛丹伦的回响"] = 5,
		["恶魔皮肤"] = "沙怒暗影法师",
		["高速切砍"] = "高阶祭司塞卡尔",
		["疯狂"] = "弗莱格尔",
		["覆体之网"] = "地穴兽",
		["敏捷提高"] = 4,
		["致死顺劈"] = "高阶祭司塞卡尔",
		["鲁莽诅咒"] = 9,
		["反魔法盾"] = "哀嚎的女妖",
		["鲜血通道"] = "哈卡高阶祭司",
		["结晶"] = "尖塔蜘蛛",
		["火焰节之怒"] = 8,
		["宁静"] = 11,
		["玛尔里的思想加速"] = 7,
		["治疗之触"] = 11,
		["Summon Lava Burst C"] = "熔核鼠",
		["钩网"] = "裂盾袭击者",
		["防御姿态"] = 1,
		["狂暴姿态"] = 1,
		["天堂祝福"] = 1,
		["冰封武器"] = 7,
		["拍翼"] = "德姆塞卡尔",
		["驱除疾病"] = 5,
		["战士之怒"] = 1,
		["棕色科多兽"] = 7,
		["修理机器人74A型"] = 3,
		["青色迅猛龙"] = 7,
		["反击风暴"] = 1,
		["断筋"] = 1,
		["困兽之爪"] = "食尸抢夺者",
		["音爆"] = "高阶祭司耶克里克",
		["奥术箭"] = "裂盾缚法师",
		["强效隐形"] = "纳克萨玛斯之眼",
		["闪电链"] = 7,
		["气定神闲"] = 8,
		["火印诅咒"] = "火印暗法师",
		["毒箭之雨"] = "高阶祭司玛尔里",
		["急速冷却"] = 8,
		["激活"] = 11,
		["旋风斩"] = 1,
		["腐蚀术"] = 9,
		["惩击"] = 5,
		["蓝色骸骨军马"] = 4,
		["地精暗雷"] = "维格利",
		["僵化"] = "苏利萨斯沙行者",
		["地穴甲虫"] = "地穴爬行者",
		["冰冻新星"] = "莱斯·霜语",
		["召唤洗脑图腾"] = "妖术师金度",
		["惩罚光环"] = "红衣豪侠",
		["精神错乱"] = 3,
		["治疗结界"] = "沙怒巫医",
		["火焰冲击"] = 8,
		["坚韧祷言"] = 5,
		["治疗之道"] = 7,
		["冰霜凝固"] = "加兹瑞拉",
		["治疗龙类"] = "黑手驭龙者",
		["速效毒药"] = 4,
		["爆炸陷阱效果"] = 3,
		["瞄准射击"] = 3,
		["虫群"] = 11,
		["脓疮撕咬"] = "瘟疫虫",
		["治疗宠物"] = 3,
		["食尸鬼瘟疫"] = "恶疫食尸鬼",
		["纠缠根须"] = 11,
		["奥术智慧"] = 8,
		["防护暗影结界"] = 9,
		["毒液喷射"] = "拉扎什蝰蛇",
		["生命"] = 4,
		["扰乱"] = 4,
		["暗影灼烧"] = 9,
		["熔岩图腾"] = "熔岩图腾 IV <丷凤梨丷>",
		["恐惧术"] = 9,
		["精灵之火（野性）"] = 11,
		["暗棕狼"] = 3,
		["水栖形态"] = 11,
		["血牙"] = 4,
		["裂盾传送门"] = "裂盾术士",
		["血之诅咒"] = "衰老的侍女",
		["魂能之速"] = 1,
		["恶魔支配"] = 9,
		["烈焰打击图腾"] = "燃棘巫医",
		["解散野兽"] = 3,
		["盾击"] = 1,
		["拳击"] = 1,
		["绞喉"] = 4,
		["活化炸弹"] = "迦顿男爵",
		["石爪图腾"] = 7,
		["炸弹"] = "黑翼技师",
		["游荡瘟疫"] = 1,
		["击退"] = "欧莫克大王",
		["Summon Lava Burst B"] = "熔核鼠",
		["先祖坚韧"] = 7,
		["原始狂怒"] = 11,
		["召唤小鬼"] = 9,
		["诱捕"] = 3,
		["烈焰印记"] = "火印步兵",
		["还击"] = 4,
		["血腥撕裂者"] = 4,
		["暴怒"] = "克洛玛古斯",
		["暗影易伤"] = 9,
		["践踏"] = "吞咽者拉姆斯登",
		["旅行形态"] = 11,
		["感染之伤"] = "未知目标",
		["胁迫"] = 3,
		["剥皮"] = 4,
		["熔岩喷射图腾"] = "沙怒巫医",
		["暗言术：痛"] = 5,
		["魔息术"] = 9,
		["虚弱灵魂"] = 5,
		["威慑凝视"] = "血领主曼多基尔",
		["寄生蛇"] = "高阶祭司温诺希斯",
		["反魔法脉冲"] = "加尔",
		["护甲"] = 7,
		["猎豹守护"] = 3,
		["扫击"] = 11,
		["撕裂"] = 7,
		["解除次级诅咒"] = 8,
		["怒不可遏"] = 1,
		["火焰破裂"] = "血斧招魂师",
		["速效毒药 IV"] = 4,
		["金度的欺骗"] = "妖术师金度",
		["新近包扎"] = 7,
		["雏龙之语：红色"] = "黑翼龙人护卫",
		["强击光环"] = 3,
		["赞扎之速"] = 11,
		["挫志怒吼"] = 1,
		["刺耳怒吼"] = 1,
		["熔岩喷溅"] = "焚化者古雷曼格",
		["强力治疗术"] = "狂热者洛卡恩",
		["法力澎湃"] = 7,
		["迅捷灰色科多兽"] = 11,
		["暗影屏障"] = "通灵学院通灵师",
		["治疗"] = "哈卡祭司",
		["破甲虚弱"] = 3,
		["祖利安切割"] = 4,
		["瑟银盾刺"] = 1,
		["撕咬"] = "是断牙不是断崖 <动力二踢脚>",
		["击碎护甲"] = "扭木摧毁者",
		["传送到玩家"] = "奥妮克希亚雏龙",
		["专注施法"] = 7,
		["Falling"] = "环境伤害 (坠落)",
		["拦截"] = 1,
		["恶魔之击"] = 1,
		["传送"] = "管理者埃克索图斯",
		["烈焰打击"] = "烈焰打击图腾 <燃棘巫医>",
		["刺骨"] = 4,
		["治疗链"] = "燃棘秘法师",
		["龙血之痛：黑"] = "克洛玛古斯",
		["树皮术"] = 11,
		["宁静之风"] = 7,
		["红色骸骨军马"] = 8,
		["元素火焰"] = "拉格纳罗斯",
		["制造特效治疗石"] = 9,
		["神圣之火"] = 5,
		["蛮力药剂"] = 1,
		["命令之吼"] = "死爪龙人队长",
		["渐隐术"] = 5,
		["嘲讽"] = 1,
		["眩晕"] = 3,
		["驯服野兽"] = 3,
		["虚弱之触"] = 5,
		["冰封攻击"] = 7,
		["!Autoshot"] = 5,
		["堕落治疗"] = 5,
		["枯萎热浪"] = "上古熔火恶犬",
		["熔岩吐息"] = "上古熔火恶犬",
		["伤害反射护盾"] = "管理者埃克索图斯",
		["雷霆之怒"] = 1,
		["迅捷绿色迅猛龙"] = 3,
		["魔暴龙之怒"] = 3,
		["熔岩喷吐"] = "玛格曼达",
		["召唤复活的侍从"] = "通灵学院黑暗召唤师",
		["野兽守护"] = 3,
		["摔倒"] = 1,
		["冬泉火酒"] = 4,
		["再生"] = 4,
		["吸血"] = "古拉巴什饮血者",
		["冰冻陷阱效果"] = 3,
		["迅捷橙色迅猛龙"] = 3,
		["冰霜射击"] = "剃刀沼泽驯兽师",
		["冲击波"] = "燃烧地狱卫士 <裂盾术士>",
		["魔法抑制"] = 8,
		["抗火图腾"] = 7,
		["奥术飞弹"] = "血斧召唤师",
		["自然之盟"] = 7,
		["绿色迅猛龙"] = 5,
		["凿击"] = "燃棘暗影猎手",
		["灼烧之焰"] = "上古熔火恶犬",
		["毒性钉刺"] = "腐蚀群居虫",
		["闪电攻击"] = 7,
		["宁神毒药"] = "拉扎什毒蛇",
		["衰减魔法"] = "沙斯拉尔",
		["Lava"] = "环境伤害 (岩浆)",
		["造水术"] = 8,
		["幽魂之狼"] = 7,
		["连珠火球"] = "狂爪火鳞龙人",
		["生命赐福"] = 1,
		["霜狼之怒"] = 3,
		["闪避"] = 4,
		["野兽知识"] = 3,
		["纯净术"] = "卡尔加·刺肋",
		["盾击 - 沉默"] = 1,
		["蓝龙光环"] = 11,
		["爆炸射击"] = "荒野背叛者",
		["驱毒术"] = 11,
		["紫色骷髅战马"] = 4,
		["净化烈焰"] = "斯坦索姆烈焰",
		["治疗之泉图腾"] = 7,
		["速度"] = 7,
		["脚踢 - 沉默"] = 4,
		["疾病喷吐"] = "瘟疫龙崽",
		["邪恶光环"] = "瑞文戴尔男爵",
		["冰霜反射器"] = 9,
		["威慑"] = 3,
		["撕扯"] = 11,
		["束缚亡灵"] = 5,
		["盾墙"] = 1,
		["漂浮术"] = 5,
		["清晰预兆"] = 11,
		["上古绝望"] = "上古熔火恶犬",
		["基赫纳斯的诅咒"] = "基赫纳斯",
		["战争践踏"] = 7,
		["抵抗火焰"] = "裂盾缚法师",
		["痛苦诅咒"] = 9,
		["解除诅咒"] = 11,
		["血之狂热"] = 1,
		["充沛之力"] = 3,
		["攻击"] = "灼热图腾 VI <Pandajustice>",
		["撞击"] = "熔核巨人",
		["减速毒药"] = "裂盾哨兵",
		["加兹瑞拉猛击"] = "加兹瑞拉",
		["侦测潜行"] = 3,
		["猎豹形态"] = 11,
		["潜伏"] = "未知目标 <风吹档下面凉>",
		["瓦罗什之痒"] = "瓦罗什",
		["愤怒"] = 11,
		["生命通道"] = 9,
		["风墙图腾"] = 7,
		["远古治疗"] = 11,
		["魂能之力"] = 4,
		["迅捷蓝色迅猛龙"] = 8,
		["风之优雅"] = 7,
		["冰霜震击"] = 7,
		["伊森哈德之怒"] = 1,
		["自爆"] = "地精暗雷 <维格利>",
		["狂野之怒"] = 1,
		["意志之力"] = 1,
		["捕捉灵魂"] = 7,
		["鞭笞"] = "哈卡的化身",
		["虔诚光环"] = "野猪人勇士",
		["盾牌冲锋"] = "黑手老兵",
		["特效治疗石"] = 9,
		["地狱烈焰"] = 9,
		["野性印记"] = 11,
		["腐蚀酸液吐息"] = "盖斯",
		["减速术"] = "尖石食人魔法师",
		["迅捷白色科多兽"] = 1,
		["次级治疗术"] = 5,
		["防护暗影"] = 5,
		["灵魂之火"] = 9,
		["投掷燃烧瓶"] = "觅血者前锋",
		["吐息"] = "奥妮克希亚",
		["打磨利刃 V"] = 1,
		["火焰新星图腾"] = 7,
		["驱散射击"] = 3,
		["沙漏"] = 5,
		["埃博诺克之影"] = "埃博诺克",
		["制造魔法黄水晶"] = 8,
		["活性消隐"] = 5,
		["招架"] = 1,
		["心灵专注"] = 5,
		["冲锋击昏"] = 1,
		["肾击"] = 4,
		["大地之力图腾"] = 7,
		["节能施法"] = 8,
		["制造强效治疗石"] = 9,
		["狂乱"] = "玛格曼达",
		["消毒术"] = 7,
		["偷袭"] = 4,
		["凝视"] = "狂爪龙人",
		["龙尾扫击"] = "奥妮克希亚",
		["魔甲术"] = 9,
		["相位变换"] = "塞普克恩 <传说中的包子>",
		["赞扎之魂"] = 4,
		["狂野变形"] = 8,
		["野猪冲锋"] = "八戒 <八十章>",
		["重磅铁制炸弹"] = 7,
		["无敌"] = 1,
		["制造魔法翡翠"] = 8,
		["火焰之花"] = "火焰行者",
		["致死打击"] = "火印步兵",
		["冷血"] = 4,
		["风之优雅图腾"] = 7,
		["侦测魔法"] = 8,
		["灵风专注"] = 8,
		["吸血术"] = "沙怒饮血者",
		["破胆怒吼"] = 1,
		["缩小射线"] = 4,
		["刺骨暗影"] = "图萨丁暗影法师",
		["Summon Lava Burst H"] = "熔核鼠",
		["酸性血液虹吸"] = 5,
		["致伤毒药"] = 4,
		["致命毒药 IV"] = 4,
		["野性守护"] = 3,
		["黑暗治疗"] = "烈焰行者祭司",
		["Summon Lava Burst D"] = "熔核鼠",
		["火焰的召唤"] = "通灵学院亡灵法师",
		["处斩"] = "血领主曼多基尔",
	},
	["encounter_spell_pool"] = {
		["叉状闪电"] = {
			0, -- [1]
			"尖石秘法师", -- [2]
		},
		["法术反制"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["致盲"] = {
			789, -- [1]
			"狂热者扎斯", -- [2]
		},
		["暗影命令"] = {
			617, -- [1]
			"维克多·奈法里奥斯", -- [2]
		},
		["邪恶攻击"] = {
			789, -- [1]
			"狂热者扎斯", -- [2]
		},
		["酸息术"] = {
			0, -- [1]
			"德姆塞卡尔", -- [2]
		},
		["恢复"] = {
			0, -- [1]
			"卡尔加·刺肋", -- [2]
		},
		["冰霜灼烧"] = {
			616, -- [1]
			"克洛玛古斯", -- [2]
		},
		["腐蚀之毒"] = {
			786, -- [1]
			"高阶祭司玛尔里", -- [2]
		},
		["盾刺"] = {
			0, -- [1]
			"洛若尔", -- [2]
		},
		["深度沉睡"] = {
			0, -- [1]
			"伊兰尼库斯的阴影", -- [2]
		},
		["急救"] = {
			663, -- [1]
			4, -- [2]
		},
		["飓风"] = {
			792, -- [1]
			"洗脑图腾 <妖术师金度>", -- [2]
		},
		["血液虹吸"] = {
			793, -- [1]
			"哈卡", -- [2]
		},
		["荆棘光环"] = {
			0, -- [1]
			"主宰拉姆塔斯", -- [2]
		},
		["寒冰箭"] = {
			0, -- [1]
			"苍白的玛勒基", -- [2]
		},
		["裂盾传送门"] = {
			0, -- [1]
			"裂盾术士", -- [2]
		},
		["Summon Lava Burst A"] = {
			672, -- [1]
			"熔核鼠", -- [2]
		},
		["眩晕"] = {
			0, -- [1]
			"安图苏尔的仆从 <安图苏尔>", -- [2]
		},
		["雏龙之语：绿色"] = {
			617, -- [1]
			"绿色龙兽", -- [2]
		},
		["横扫猛击"] = {
			0, -- [1]
			"维姆萨拉克", -- [2]
		},
		["雷霆一击"] = {
			0, -- [1]
			"燃烧地狱卫士 <裂盾术士>", -- [2]
		},
		["嗜血"] = {
			789, -- [1]
			"高阶祭司塞卡尔", -- [2]
		},
		["重击"] = {
			789, -- [1]
			"高阶祭司塞卡尔", -- [2]
		},
		["多彩混乱"] = {
			0, -- [1]
			"维克多·奈法里奥斯", -- [2]
		},
		["火息术"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["暗影迷雾"] = {
			617, -- [1]
			"奈法利安", -- [2]
		},
		["烈焰打击"] = {
			613, -- [1]
			"费尔默", -- [2]
		},
		["牺牲"] = {
			611, -- [1]
			"范格拉夫", -- [2]
		},
		["末日降临"] = {
			663, -- [1]
			"鲁西弗隆", -- [2]
		},
		["红龙精华"] = {
			611, -- [1]
			"堕落的瓦拉斯塔兹", -- [2]
		},
		["法力之泉"] = {
			664, -- [1]
			"法力之泉图腾 IV", -- [2]
		},
		["投掷"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["喷吐"] = {
			784, -- [1]
			"拉扎什眼镜蛇", -- [2]
		},
		["女妖诅咒"] = {
			0, -- [1]
			"安娜丝塔丽男爵夫人", -- [2]
		},
		["召唤玩家"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["召唤祖利安守护者"] = {
			789, -- [1]
			"高阶祭司塞卡尔", -- [2]
		},
		["冰冻术"] = {
			0, -- [1]
			"盖斯", -- [2]
		},
		["射击"] = {
			0, -- [1]
			"沙怒暗影猎手", -- [2]
		},
		["冰霜新星"] = {
			0, -- [1]
			"不可宽恕者", -- [2]
		},
		["点燃法力"] = {
			668, -- [1]
			"迦顿男爵", -- [2]
		},
		["火焰之雨"] = {
			663, -- [1]
			"烈焰行者护卫", -- [2]
		},
		["灵感"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["寒冰之墓"] = {
			0, -- [1]
			"苍白的玛勒基", -- [2]
		},
		["挥砍"] = {
			0, -- [1]
			"乌克兹·沙顶", -- [2]
		},
		["熔岩喷吐"] = {
			664, -- [1]
			"玛格曼达", -- [2]
		},
		["地狱火"] = {
			668, -- [1]
			"迦顿男爵", -- [2]
		},
		["击昏"] = {
			0, -- [1]
			"吞咽者拉姆斯登", -- [2]
		},
		["血之诅咒"] = {
			785, -- [1]
			"高阶祭司耶克里克", -- [2]
		},
		["统御意志"] = {
			663, -- [1]
			"烈焰行者护卫", -- [2]
		},
		["挫志怒吼"] = {
			0, -- [1]
			"维姆萨拉克", -- [2]
		},
		["冲击波"] = {
			0, -- [1]
			"燃烧地狱卫士 <裂盾术士>", -- [2]
		},
		["斩杀"] = {
			787, -- [1]
			"血领主曼多基尔", -- [2]
		},
		["毒云"] = {
			784, -- [1]
			"高阶祭司温诺希斯", -- [2]
		},
		["压制"] = {
			787, -- [1]
			"血领主曼多基尔", -- [2]
		},
		["金度的欺骗"] = {
			792, -- [1]
			"妖术师金度", -- [2]
		},
		["强力治疗结界"] = {
			792, -- [1]
			"妖术师金度", -- [2]
		},
		["感染撕咬"] = {
			787, -- [1]
			"拉扎什迅猛龙", -- [2]
		},
		["冰冻"] = {
			0, -- [1]
			"苍白的玛勒基", -- [2]
		},
		["熔岩镣铐"] = {
			666, -- [1]
			"加尔", -- [2]
		},
		["狂怒"] = {
			0, -- [1]
			"欧莫克大王", -- [2]
		},
		["吸取生命"] = {
			0, -- [1]
			"苍白的玛勒基", -- [2]
		},
		["暗影箭雨"] = {
			0, -- [1]
			"水占师维蕾萨", -- [2]
		},
		["Shade Visual"] = {
			792, -- [1]
			"金度之影", -- [2]
		},
		["寒冰护体"] = {
			792, -- [1]
			8, -- [2]
		},
		["寄生蛇"] = {
			784, -- [1]
			"高阶祭司温诺希斯", -- [2]
		},
		["圆弧斩"] = {
			0, -- [1]
			"复活的构造体", -- [2]
		},
		["腐蚀酸液"] = {
			616, -- [1]
			"克洛玛古斯", -- [2]
		},
		["拉格纳罗斯之怒"] = {
			672, -- [1]
			"拉格纳罗斯", -- [2]
		},
		["打击"] = {
			0, -- [1]
			"裂盾袭击者", -- [2]
		},
		["治疗术"] = {
			0, -- [1]
			"暗影祭司塞瑟斯", -- [2]
		},
		["狂暴怒火"] = {
			0, -- [1]
			"巴瑟拉斯镇长", -- [2]
		},
		["温暖之焰"] = {
			0, -- [1]
			"狂野的拉佐格尔", -- [2]
		},
		["恢复法力"] = {
			663, -- [1]
			7, -- [2]
		},
		["燃烧"] = {
			664, -- [1]
			"熔岩炸弹", -- [2]
		},
		["低沉咆哮"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["飞扑"] = {
			785, -- [1]
			"高阶祭司耶克里克", -- [2]
		},
		["火球术"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["无情打击效果"] = {
			792, -- [1]
			4, -- [2]
		},
		["狂暴冲锋"] = {
			787, -- [1]
			"古拉巴什勇士", -- [2]
		},
		["魔爆术"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["脚踢"] = {
			789, -- [1]
			"狂热者扎斯", -- [2]
		},
		["Summon Lava Burst G"] = {
			672, -- [1]
			"熔核鼠", -- [2]
		},
		["恐慌"] = {
			664, -- [1]
			"玛格曼达", -- [2]
		},
		["毒蛇钉刺"] = {
			0, -- [1]
			3, -- [2]
		},
		["爪击"] = {
			789, -- [1]
			"祖利安守护者 <高阶祭司塞卡尔>", -- [2]
		},
		["剑刃乱舞"] = {
			792, -- [1]
			4, -- [2]
		},
		["暗影箭"] = {
			0, -- [1]
			"裂盾术士", -- [2]
		},
		["嗜血术"] = {
			0, -- [1]
			"尖石食人魔法师", -- [2]
		},
		["龙血之痛：绿"] = {
			616, -- [1]
			"克洛玛古斯", -- [2]
		},
		["地震术"] = {
			670, -- [1]
			"焚化者古雷曼格", -- [2]
		},
		["瘟疫之云"] = {
			0, -- [1]
			"圣甲虫", -- [2]
		},
		["点燃躯体"] = {
			616, -- [1]
			"克洛玛古斯", -- [2]
		},
		["陷地图腾"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["恶魔皮肤"] = {
			0, -- [1]
			"沙怒暗影法师", -- [2]
		},
		["娅尔罗的印记"] = {
			791, -- [1]
			"高阶祭司娅尔罗", -- [2]
		},
		["覆体之网"] = {
			0, -- [1]
			"奈鲁布恩坎", -- [2]
		},
		["致死顺劈"] = {
			789, -- [1]
			"高阶祭司塞卡尔", -- [2]
		},
		["安图苏尔的爪牙"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["放逐术"] = {
			0, -- [1]
			"戈多克术士", -- [2]
		},
		["钩网"] = {
			0, -- [1]
			"裂盾袭击者", -- [2]
		},
		["狂暴姿态"] = {
			0, -- [1]
			"沙怒刽子手", -- [2]
		},
		["精神鞭笞"] = {
			785, -- [1]
			"高阶祭司耶克里克", -- [2]
		},
		["冰冻新星"] = {
			0, -- [1]
			"莱斯·霜语", -- [2]
		},
		["破甲攻击"] = {
			665, -- [1]
			"烈焰行者", -- [2]
		},
		["地狱火效果"] = {
			617, -- [1]
			"堕落地狱火 <传说中的包子>", -- [2]
		},
		["火焰箭"] = {
			664, -- [1]
			"佐尔尼普 <感悟>", -- [2]
		},
		["抵抗火焰"] = {
			0, -- [1]
			"裂盾缚法师", -- [2]
		},
		["闪电链"] = {
			0, -- [1]
			"尖石秘法师", -- [2]
		},
		["火印诅咒"] = {
			0, -- [1]
			"火印暗法师", -- [2]
		},
		["奥术箭"] = {
			0, -- [1]
			"裂盾缚法师", -- [2]
		},
		["闪电箭"] = {
			786, -- [1]
			"枯木部族演讲者", -- [2]
		},
		["召唤阿塔莱骷髅"] = {
			0, -- [1]
			"阿塔莱图腾 <祖罗>", -- [2]
		},
		["僵化"] = {
			0, -- [1]
			"苏利萨斯沙行者", -- [2]
		},
		["地穴甲虫"] = {
			0, -- [1]
			"奈鲁布恩坎", -- [2]
		},
		["治疗结界"] = {
			0, -- [1]
			"沙怒巫医", -- [2]
		},
		["火焰冲击"] = {
			671, -- [1]
			"烈焰行者精英", -- [2]
		},
		["毒药"] = {
			0, -- [1]
			"拉文", -- [2]
		},
		["冰霜凝固"] = {
			0, -- [1]
			"加兹瑞拉", -- [2]
		},
		["复活亡灵甲虫"] = {
			0, -- [1]
			"奈鲁布恩坎", -- [2]
		},
		["瞄准射击"] = {
			0, -- [1]
			3, -- [2]
		},
		["掷斧"] = {
			0, -- [1]
			"指挥官沃恩", -- [2]
		},
		["脓疮撕咬"] = {
			0, -- [1]
			"瘟疫虫", -- [2]
		},
		["食尸鬼瘟疫"] = {
			0, -- [1]
			"恶疫食尸鬼", -- [2]
		},
		["旋风斩"] = {
			0, -- [1]
			"大酋长雷德·黑手 <盖斯>", -- [2]
		},
		["末日决战"] = {
			668, -- [1]
			"迦顿男爵", -- [2]
		},
		["拉格纳罗斯之拳"] = {
			665, -- [1]
			"烈焰行者", -- [2]
		},
		["旋风倾泻"] = {
			0, -- [1]
			"剃刀沼泽刺鬃守卫", -- [2]
		},
		["拍翼"] = {
			0, -- [1]
			"德姆塞卡尔", -- [2]
		},
		["Summon Lava Burst C"] = {
			672, -- [1]
			"熔核鼠", -- [2]
		},
		["血牙"] = {
			792, -- [1]
			4, -- [2]
		},
		["复仇"] = {
			0, -- [1]
			"布莱中士", -- [2]
		},
		["盾击"] = {
			0, -- [1]
			"裂盾军团战士", -- [2]
		},
		["反魔法护盾"] = {
			787, -- [1]
			"哈卡祭司", -- [2]
		},
		["活化炸弹"] = {
			668, -- [1]
			"迦顿男爵", -- [2]
		},
		["击退"] = {
			0, -- [1]
			"欧莫克大王", -- [2]
		},
		["法力燃烧"] = {
			0, -- [1]
			"沙怒侍僧", -- [2]
		},
		["战斗怒吼"] = {
			0, -- [1]
			"主宰拉姆塔斯", -- [2]
		},
		["召唤雷德·黑手"] = {
			0, -- [1]
			"盖斯", -- [2]
		},
		["烈焰印记"] = {
			0, -- [1]
			"火印步兵", -- [2]
		},
		["驱散魔法"] = {
			789, -- [1]
			"狂热者洛卡恩", -- [2]
		},
		["Burning Felguard Spawn"] = {
			0, -- [1]
			"燃烧地狱卫士 <裂盾术士>", -- [2]
		},
		["暴怒"] = {
			616, -- [1]
			"克洛玛古斯", -- [2]
		},
		["践踏"] = {
			0, -- [1]
			"吞咽者拉姆斯登", -- [2]
		},
		["召唤尖塔小蜘蛛"] = {
			0, -- [1]
			"烟网蛛后", -- [2]
		},
		["盾牌猛击"] = {
			0, -- [1]
			"洛若尔", -- [2]
		},
		["雏龙之语：青铜"] = {
			0, -- [1]
			"青铜龙兽", -- [2]
		},
		["暗言术：痛"] = {
			669, -- [1]
			"烈焰行者祭司", -- [2]
		},
		["群体打击"] = {
			0, -- [1]
			"巴瑟拉斯镇长", -- [2]
		},
		["威慑凝视"] = {
			787, -- [1]
			"血领主曼多基尔", -- [2]
		},
		["反魔法脉冲"] = {
			666, -- [1]
			"加尔", -- [2]
		},
		["横扫攻击"] = {
			789, -- [1]
			"狂热者扎斯", -- [2]
		},
		["雏龙之语：黑色"] = {
			617, -- [1]
			"多彩龙兽", -- [2]
		},
		["撕裂"] = {
			0, -- [1]
			"安娜丝塔丽男爵夫人", -- [2]
		},
		["残废术"] = {
			0, -- [1]
			"末日守卫", -- [2]
		},
		["神圣力量"] = {
			663, -- [1]
			4, -- [2]
		},
		["雏龙之语：红色"] = {
			617, -- [1]
			"红色龙兽", -- [2]
		},
		["鲁西弗隆的诅咒"] = {
			663, -- [1]
			"鲁西弗隆", -- [2]
		},
		["熔岩喷溅"] = {
			670, -- [1]
			"焚化者古雷曼格", -- [2]
		},
		["强力治疗术"] = {
			789, -- [1]
			"狂热者洛卡恩", -- [2]
		},
		["放逐"] = {
			792, -- [1]
			"妖术师金度", -- [2]
		},
		["刺穿护甲"] = {
			785, -- [1]
			"高阶祭司耶克里克", -- [2]
		},
		["治疗"] = {
			787, -- [1]
			"哈卡祭司", -- [2]
		},
		["烈焰之矛"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["音爆"] = {
			785, -- [1]
			"高阶祭司耶克里克", -- [2]
		},
		["阿塔莱骷髅图腾"] = {
			0, -- [1]
			"祖罗", -- [2]
		},
		["治疗之环"] = {
			0, -- [1]
			"黑翼工头", -- [2]
		},
		["传送"] = {
			671, -- [1]
			"管理者埃克索图斯", -- [2]
		},
		["龙血之痛：黑"] = {
			616, -- [1]
			"克洛玛古斯", -- [2]
		},
		["语言诅咒"] = {
			0, -- [1]
			"戈多克术士", -- [2]
		},
		["元素火焰"] = {
			672, -- [1]
			"拉格纳罗斯", -- [2]
		},
		["祖穆拉恩结界"] = {
			0, -- [1]
			"巫医祖穆拉恩", -- [2]
		},
		["神圣之火"] = {
			784, -- [1]
			"高阶祭司温诺希斯", -- [2]
		},
		["!Autoshot"] = {
			0, -- [1]
			3, -- [2]
		},
		["熔岩吐息"] = {
			664, -- [1]
			"玛格曼达", -- [2]
		},
		["伤害反射护盾"] = {
			671, -- [1]
			"管理者埃克索图斯", -- [2]
		},
		["安抚龙类"] = {
			0, -- [1]
			"狂野的拉佐格尔", -- [2]
		},
		["脆弱"] = {
			0, -- [1]
			"祖罗尔", -- [2]
		},
		["冲动"] = {
			792, -- [1]
			4, -- [2]
		},
		["心灵尖啸"] = {
			0, -- [1]
			"暗影祭司塞瑟斯", -- [2]
		},
		["暗影震击"] = {
			663, -- [1]
			"鲁西弗隆", -- [2]
		},
		["火焰新星"] = {
			611, -- [1]
			"堕落的瓦拉斯塔兹", -- [2]
		},
		["凿击"] = {
			789, -- [1]
			"狂热者扎斯", -- [2]
		},
		["暴风雪"] = {
			792, -- [1]
			"洗脑图腾 <妖术师金度>", -- [2]
		},
		["刺骨暗影"] = {
			0, -- [1]
			"图萨丁暗影法师", -- [2]
		},
		["衰减魔法"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["沙斯拉尔之门"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["Summon Lava Burst H"] = {
			672, -- [1]
			"熔核鼠", -- [2]
		},
		["连珠火球"] = {
			0, -- [1]
			"狂野的拉佐格尔", -- [2]
		},
		["结晶"] = {
			0, -- [1]
			"烟网蛛后", -- [2]
		},
		["中毒"] = {
			784, -- [1]
			"拉扎什眼镜蛇", -- [2]
		},
		["龙血之痛：红"] = {
			616, -- [1]
			"克洛玛古斯", -- [2]
		},
		["强化格挡"] = {
			0, -- [1]
			"洛若尔", -- [2]
		},
		["Summon Lava Burst E"] = {
			672, -- [1]
			"熔核鼠", -- [2]
		},
		["魔法反射"] = {
			671, -- [1]
			"管理者埃克索图斯", -- [2]
		},
		["毒液喷吐"] = {
			784, -- [1]
			"高阶祭司温诺希斯", -- [2]
		},
		["裂颅"] = {
			0, -- [1]
			"食尸抢夺者", -- [2]
		},
		["召唤虚空行者"] = {
			0, -- [1]
			"燃刃术士", -- [2]
		},
		["灵魂撕咬"] = {
			0, -- [1]
			"沙怒噬魂者", -- [2]
		},
		["纯净术"] = {
			0, -- [1]
			"卡尔加·刺肋", -- [2]
		},
		["魔法吸收"] = {
			792, -- [1]
			8, -- [2]
		},
		["月火术"] = {
			792, -- [1]
			"洗脑图腾 <妖术师金度>", -- [2]
		},
		["邪恶光环"] = {
			0, -- [1]
			"瑞文戴尔男爵", -- [2]
		},
		["致死打击"] = {
			0, -- [1]
			"大酋长雷德·黑手 <盖斯>", -- [2]
		},
		["恐惧术"] = {
			617, -- [1]
			"维克多·奈法里奥斯", -- [2]
		},
		["吸血一击"] = {
			0, -- [1]
			"巴瑟拉斯镇长", -- [2]
		},
		["神圣怒火"] = {
			784, -- [1]
			"高阶祭司温诺希斯", -- [2]
		},
		["炎爆术"] = {
			670, -- [1]
			"焚化者古雷曼格", -- [2]
		},
		["破胆怒吼"] = {
			787, -- [1]
			"血领主曼多基尔", -- [2]
		},
		["拉格纳罗斯之手"] = {
			669, -- [1]
			"萨弗隆先驱者", -- [2]
		},
		["暗影烈焰"] = {
			613, -- [1]
			"费尔默", -- [2]
		},
		["基赫纳斯的诅咒"] = {
			665, -- [1]
			"基赫纳斯", -- [2]
		},
		["疯狂"] = {
			615, -- [1]
			"弗莱格尔", -- [2]
		},
		["吸血"] = {
			787, -- [1]
			"古拉巴什饮血者", -- [2]
		},
		["痛苦诅咒"] = {
			0, -- [1]
			"燃刃信徒", -- [2]
		},
		["黑暗打击"] = {
			669, -- [1]
			"烈焰行者祭司", -- [2]
		},
		["召唤洗脑图腾"] = {
			792, -- [1]
			"妖术师金度", -- [2]
		},
		["骨甲术"] = {
			0, -- [1]
			"图萨丁亡灵法师", -- [2]
		},
		["神圣新星"] = {
			784, -- [1]
			"高阶祭司温诺希斯", -- [2]
		},
		["冲锋"] = {
			789, -- [1]
			"高阶祭司塞卡尔", -- [2]
		},
		["攻击弱点"] = {
			617, -- [1]
			"白骨魔像", -- [2]
		},
		["加兹瑞拉猛击"] = {
			0, -- [1]
			"加兹瑞拉", -- [2]
		},
		["Summon Lava Burst I"] = {
			672, -- [1]
			"熔核鼠", -- [2]
		},
		["全力一击"] = {
			0, -- [1]
			"巴瑟拉斯镇长", -- [2]
		},
		["火焰之盾"] = {
			0, -- [1]
			"燃烧地狱卫士 <裂盾术士>", -- [2]
		},
		["时间流逝"] = {
			616, -- [1]
			"克洛玛古斯", -- [2]
		},
		["女妖哀嚎"] = {
			0, -- [1]
			"安娜丝塔丽男爵夫人", -- [2]
		},
		["割碎"] = {
			670, -- [1]
			"熔火怒犬", -- [2]
		},
		["冰柱"] = {
			0, -- [1]
			"加兹瑞拉", -- [2]
		},
		["Warder Despawn"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["闪电之盾"] = {
			789, -- [1]
			"狂热者洛卡恩", -- [2]
		},
		["困兽之爪"] = {
			0, -- [1]
			"食尸抢夺者", -- [2]
		},
		["灵魂分流"] = {
			0, -- [1]
			"图萨丁亡灵法师", -- [2]
		},
		["燃烧刺激"] = {
			611, -- [1]
			"堕落的瓦拉斯塔兹", -- [2]
		},
		["灭龙"] = {
			0, -- [1]
			"死爪龙人", -- [2]
		},
		["洗脑"] = {
			792, -- [1]
			"洗脑图腾 <妖术师金度>", -- [2]
		},
		["烈焰"] = {
			785, -- [1]
			"燃烧剂", -- [2]
		},
		["焚烧"] = {
			616, -- [1]
			"克洛玛古斯", -- [2]
		},
		["龙翼打击"] = {
			613, -- [1]
			"费尔默", -- [2]
		},
		["火焰新星图腾"] = {
			0, -- [1]
			"安图苏尔", -- [2]
		},
		["净化新星"] = {
			787, -- [1]
			"哈卡祭司", -- [2]
		},
		["盾牌冲锋"] = {
			0, -- [1]
			"卫兵斯里基克", -- [2]
		},
		["投掷燃烧瓶"] = {
			785, -- [1]
			"觅血者前锋", -- [2]
		},
		["龙翼攻击"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["传送到玩家"] = {
			1084, -- [1]
			"奥妮克希亚雏龙", -- [2]
		},
		["腐蚀酸液吐息"] = {
			0, -- [1]
			"盖斯", -- [2]
		},
		["减速术"] = {
			0, -- [1]
			"尖石食人魔法师", -- [2]
		},
		["处斩"] = {
			787, -- [1]
			"血领主曼多基尔", -- [2]
		},
		["Summon Lava Burst D"] = {
			672, -- [1]
			"熔核鼠", -- [2]
		},
		["熔岩之盾"] = {
			672, -- [1]
			"烈焰之子", -- [2]
		},
		["沙斯拉尔的诅咒"] = {
			667, -- [1]
			"沙斯拉尔", -- [2]
		},
		["重伤"] = {
			792, -- [1]
			"洗脑图腾 <妖术师金度>", -- [2]
		},
		["吐息"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["背刺"] = {
			791, -- [1]
			"高阶祭司娅尔罗", -- [2]
		},
		["蛛后的乳汁"] = {
			0, -- [1]
			"烟网蛛后", -- [2]
		},
		["破甲"] = {
			787, -- [1]
			"奥根", -- [2]
		},
		["致命毒药 IV"] = {
			0, -- [1]
			"安娜丝塔丽男爵夫人", -- [2]
		},
		["埃博诺克之影"] = {
			614, -- [1]
			"埃博诺克", -- [2]
		},
		["怒不可遏"] = {
			0, -- [1]
			1, -- [2]
		},
		["紫手"] = {
			611, -- [1]
			"黑翼缚法者", -- [2]
		},
		["献祭"] = {
			666, -- [1]
			"火誓者", -- [2]
		},
		["Summon Lava Burst B"] = {
			672, -- [1]
			"熔核鼠", -- [2]
		},
		["盾牌专精"] = {
			663, -- [1]
			1, -- [2]
		},
		["快速治疗"] = {
			0, -- [1]
			"沙怒巫医", -- [2]
		},
		["血性狂暴"] = {
			0, -- [1]
			1, -- [2]
		},
		["龙血之痛：蓝"] = {
			616, -- [1]
			"克洛玛古斯", -- [2]
		},
		["乱射"] = {
			792, -- [1]
			"洗脑图腾 <妖术师金度>", -- [2]
		},
		["狂乱"] = {
			664, -- [1]
			"玛格曼达", -- [2]
		},
		["恶性毒药"] = {
			784, -- [1]
			"高阶祭司温诺希斯", -- [2]
		},
		["烈焰风暴"] = {
			0, -- [1]
			"火印祈求者", -- [2]
		},
		["多重射击"] = {
			0, -- [1]
			3, -- [2]
		},
		["龙尾扫击"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["Summon Lava Burst F"] = {
			672, -- [1]
			"熔核鼠", -- [2]
		},
		["缴械"] = {
			789, -- [1]
			"狂热者洛卡恩", -- [2]
		},
		["战争践踏"] = {
			0, -- [1]
			"狂野的拉佐格尔", -- [2]
		},
		["妖术"] = {
			792, -- [1]
			"妖术师金度", -- [2]
		},
		["毒箭之雨"] = {
			786, -- [1]
			"高阶祭司玛尔里", -- [2]
		},
		["Enrage Trigger"] = {
			666, -- [1]
			"火誓者", -- [2]
		},
		["击倒"] = {
			793, -- [1]
			"哈卡之子", -- [2]
		},
		["痛击"] = {
			0, -- [1]
			"指挥官沃恩", -- [2]
		},
		["暗影闪现"] = {
			617, -- [1]
			"维克多·奈法里奥斯", -- [2]
		},
		["熔岩喷射图腾"] = {
			0, -- [1]
			"沙怒巫医", -- [2]
		},
		["堕落之血"] = {
			793, -- [1]
			"哈卡", -- [2]
		},
		["旋风斩效果"] = {
			0, -- [1]
			"大酋长雷德·黑手 <盖斯>", -- [2]
		},
		["雏龙之语：蓝色"] = {
			0, -- [1]
			"蓝色龙兽", -- [2]
		},
		["放大"] = {
			786, -- [1]
			"高阶祭司玛尔里", -- [2]
		},
		["吸血术"] = {
			0, -- [1]
			"沙怒饮血者", -- [2]
		},
		["沉默"] = {
			789, -- [1]
			"高阶祭司塞卡尔", -- [2]
		},
		["爆发"] = {
			1084, -- [1]
			"熔岩裂缝", -- [2]
		},
		["包围之网"] = {
			786, -- [1]
			"高阶祭司玛尔里", -- [2]
		},
		["毒性震荡"] = {
			786, -- [1]
			"高阶祭司玛尔里", -- [2]
		},
		["炽热之地"] = {
			1084, -- [1]
			"奥妮克希亚", -- [2]
		},
		["顺劈斩"] = {
			0, -- [1]
			"裂盾军团战士", -- [2]
		},
		["!Melee"] = {
			0, -- [1]
			"裂盾缚法师", -- [2]
		},
		["龙血之痛：青铜"] = {
			616, -- [1]
			"克洛玛古斯", -- [2]
		},
		["黑暗治疗"] = {
			669, -- [1]
			"烈焰行者祭司", -- [2]
		},
		["虚弱诅咒"] = {
			0, -- [1]
			"沙怒侍僧", -- [2]
		},
		["毁灭"] = {
			791, -- [1]
			"高阶祭司娅尔罗", -- [2]
		},
		["高速切砍"] = {
			789, -- [1]
			"高阶祭司塞卡尔", -- [2]
		},
	},
	["dungeon_data"] = {
	},
	["got_first_run"] = true,
	["report_pos"] = {
		0.99993896484375, -- [1]
		1.79925537109375, -- [2]
	},
	["latest_report_table"] = {
		{
			1, -- [1]
			1, -- [2]
			1, -- [3]
			5, -- [4]
			"SAY", -- [5]
		}, -- [1]
	},
	["__profiles"] = {
		["默认-2020-01-02"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["use_animation_accel"] = true,
				["disable_mythic_dungeon"] = false,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["icon_border_texcoord"] = {
					["B"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["R"] = 0.921875,
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["fontshadow"] = false,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["border_size"] = 14,
				["maximize_method"] = 1,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 1,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = false,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["time_type_original"] = 2,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["default_bg_alpha"] = 0.5,
			["time_type"] = 2,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["death_tooltip_width"] = 350,
			["animate_scroll"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -182.7138671875,
							["x"] = 135.189880371094,
							["w"] = 392.957153320313,
							["h"] = 249.157806396484,
						},
						["solo"] = {
							["y"] = -82.7152099609375,
							["x"] = 434.166870117188,
							["w"] = 300.000091552734,
							["h"] = 299.999969482422,
						},
					},
					["hide_in_combat_type"] = 1,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["skin_custom"] = "",
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_size"] = 12,
						["enable_custom_text"] = false,
						["enabled"] = true,
					},
					["ignore_mass_showhide"] = false,
					["switch_all_roles_after_wipe"] = false,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PATTRIBUTE"] = {
								["isHidden"] = false,
								["textStyle"] = 2,
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 0,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textFace"] = "Accidental Presidency",
								["textXMod"] = 6,
								["textAlign"] = 0,
								["textStyle"] = 2,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PATTRIBUTE",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["version"] = 3,
					["__snapV"] = false,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["__snapH"] = false,
					["micro_displays_locked"] = true,
					["__was_opened"] = true,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["show_statusbar"] = false,
					["hide_in_combat_alpha"] = 0,
					["menu_icons_size"] = 0.850000023841858,
					["plugins_grow_direction"] = 1,
					["libwindow"] = {
						["y"] = 92.7072143554688,
						["x"] = 135.189788818359,
						["point"] = "BOTTOM",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["bars_grow_direction"] = 1,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["switch_damager_in_combat"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["grab_on_top"] = false,
					["bars_sort_direction"] = 1,
					["backdrop_texture"] = "Details Ground",
					["auto_current"] = true,
					["bg_alpha"] = 0.183960914611816,
					["switch_tank_in_combat"] = false,
					["clickthrough_rows"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -182.7138671875,
							["x"] = 135.189880371094,
							["w"] = 392.957153320313,
							["h"] = 249.157806396484,
						},
						["solo"] = {
							["y"] = -82.7152099609375,
							["x"] = 434.166870117188,
							["w"] = 300.000091552734,
							["h"] = 299.999969482422,
						},
					},
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["font_size"] = 16,
						["height"] = 21,
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["texture_custom_file"] = "Interface\\",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
						["use_spec_icons"] = true,
						["textR_enable_custom_text"] = false,
						["texture"] = "BantoBar",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textL_enable_custom_text"] = false,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["texture_custom"] = "",
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textL_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_class_colors"] = false,
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["textR_bracket"] = "(",
					},
					["desaturated_menu"] = false,
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["switch_tank"] = false,
					["show_sidebars"] = false,
					["micro_displays_side"] = 2,
					["bars_inverted"] = false,
				}, -- [1]
			},
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["pvp_as_group"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["force_activity_time_pvp"] = true,
			["numerical_system"] = 2,
			["player_details_window"] = {
				["scale"] = 1,
				["bar_texture"] = "Skyline",
				["skin"] = "ElvUI",
			},
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["minimum_combat_time"] = 5,
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["overall_flag"] = 16,
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["trash_auto_remove"] = true,
			["total_abbreviation"] = 2,
			["segments_amount_to_save"] = 18,
			["clear_graphic"] = true,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["text_type"] = 1,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["hide"] = false,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["default_bg_color"] = 0.0941,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["deny_score_messages"] = false,
			["segments_auto_erase"] = 1,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
			},
			["segments_panic_mode"] = false,
			["standard_skin"] = false,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["overall_clear_logout"] = false,
			["overall_clear_newboss"] = true,
			["report_schema"] = 1,
			["use_scroll"] = false,
			["use_battleground_server_parser"] = true,
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["clear_ungrouped"] = true,
			["instances_no_libwindow"] = false,
			["deadlog_limit"] = 16,
			["instances_segments_locked"] = true,
		},
		["冬天吃栗子-龙之召唤"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["use_animation_accel"] = true,
				["disable_mythic_dungeon"] = false,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["icon_border_texcoord"] = {
					["B"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["R"] = 0.921875,
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["fontshadow"] = false,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["border_size"] = 14,
				["maximize_method"] = 1,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["time_type_original"] = 2,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["default_bg_alpha"] = 0.5,
			["time_type"] = 2,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["death_tooltip_width"] = 350,
			["animate_scroll"] = false,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = 0,
							["x"] = 0,
							["w"] = 309.999969482422,
							["h"] = 158,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["skin_custom"] = "",
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["show_timer"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["shadow"] = false,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["text_size"] = 12,
						["enable_custom_text"] = false,
						["enabled"] = true,
					},
					["switch_tank"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["switch_damager"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["bars_inverted"] = false,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["StatusBarSaved"] = {
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["textYMod"] = 1,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textStyle"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textXMod"] = 0,
								["textFace"] = "Accidental Presidency",
								["textStyle"] = 2,
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["textYMod"] = 1,
								["textStyle"] = 2,
								["textXMod"] = 6,
								["timeType"] = 1,
								["textFace"] = "Accidental Presidency",
								["textAlign"] = 0,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
					},
					["switch_tank_in_combat"] = false,
					["bg_alpha"] = 0.183960914611816,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["show_sidebars"] = false,
					["desaturated_menu"] = false,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["bg_b"] = 0.0941176470588235,
					["hide_in_combat_alpha"] = 0,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["stretch_button_side"] = 1,
					["libwindow"] = {
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["bars_grow_direction"] = 1,
					["clickthrough_rows"] = false,
					["version"] = 3,
					["grab_on_top"] = false,
					["switch_damager_in_combat"] = false,
					["menu_icons_size"] = 0.850000023841858,
					["switch_all_roles_after_wipe"] = false,
					["auto_current"] = true,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["start_after_icon"] = true,
						["font_face_file"] = "Fonts\\ARKai_T.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["font_size"] = 16,
						["height"] = 21,
						["texture_file"] = "Interface\\AddOns\\Details\\images\\BantoBar",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["use_spec_icons"] = true,
						["textR_bracket"] = "(",
						["texture_custom"] = "",
						["percent_type"] = 1,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["textR_enable_custom_text"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textR_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textL_class_colors"] = false,
						["texture_background"] = "Details D'ictum (reverse)",
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["texture_custom_file"] = "Interface\\",
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 12,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
					},
					["ignore_mass_showhide"] = false,
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = 0,
							["x"] = 0,
							["w"] = 309.999969482422,
							["h"] = 158,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["bars_sort_direction"] = 1,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["micro_displays_locked"] = true,
					["backdrop_texture"] = "Details Ground",
					["__was_opened"] = true,
					["hide_in_combat_type"] = 1,
				}, -- [1]
			},
			["segments_amount"] = 18,
			["report_lines"] = 5,
			["pvp_as_group"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["skin"] = "WoW Interface",
			["override_spellids"] = true,
			["force_activity_time_pvp"] = true,
			["numerical_system"] = 1,
			["player_details_window"] = {
				["scale"] = 1,
				["bar_texture"] = "Skyline",
				["skin"] = "ElvUI",
			},
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["minimum_combat_time"] = 5,
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["overall_flag"] = 16,
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["force_class_icons"] = false,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["trash_auto_remove"] = true,
			["total_abbreviation"] = 2,
			["segments_amount_to_save"] = 18,
			["clear_graphic"] = true,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["text_type"] = 1,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["hide"] = false,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["default_bg_color"] = 0.0941,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["deny_score_messages"] = false,
			["segments_auto_erase"] = 1,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
			},
			["segments_panic_mode"] = false,
			["standard_skin"] = false,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["overall_clear_logout"] = false,
			["overall_clear_newboss"] = true,
			["report_schema"] = 1,
			["use_scroll"] = false,
			["use_battleground_server_parser"] = false,
			["disable_reset_button"] = false,
			["data_broker_text"] = "",
			["clear_ungrouped"] = true,
			["instances_no_libwindow"] = false,
			["deadlog_limit"] = 16,
			["instances_segments_locked"] = false,
		},
	},
	["boss_mods_timers"] = {
		["encounter_timers_bw"] = {
		},
		["encounter_timers_dbm"] = {
			["23128"] = {
				"23128", -- [1]
				"Timer23128active3", -- [2]
				"疯狂结束", -- [3]
				8, -- [4]
				132117, -- [5]
				"active", -- [6]
				23128, -- [7]
				5, -- [8]
				"Chromaggus", -- [9]
				["id"] = 616,
			},
			["23952"] = {
				"23952", -- [1]
				"Timer23952target	含沙莫射影", -- [2]
				"暗言术：痛: 含沙莫射影", -- [3]
				18, -- [4]
				136207, -- [5]
				"target", -- [6]
				23952, -- [7]
				5, -- [8]
				"Jeklik", -- [9]
				["id"] = 785,
			},
			["24314"] = {
				"24314", -- [1]
				"Timer24314target	Newseven", -- [2]
				"威慑凝视: Newseven", -- [3]
				6, -- [4]
				136129, -- [5]
				"target", -- [6]
				24314, -- [7]
				3, -- [8]
				"Bloodlord", -- [9]
				["id"] = 787,
			},
			["22884"] = {
				"22884", -- [1]
				"Timer22884active", -- [2]
				"心灵尖啸 结束", -- [3]
				4, -- [4]
				136184, -- [5]
				"active", -- [6]
				22884, -- [7]
				3, -- [8]
				"Jeklik", -- [9]
				["id"] = 785,
			},
			["nil"] = {
				"nil", -- [1]
				"击杀记录", -- [2]
				"击杀记录", -- [3]
				370.588000000018, -- [4]
				136106, -- [5]
				nil, -- [6]
				nil, -- [7]
				0, -- [8]
				"Onyxia", -- [9]
				["id"] = 1084,
			},
			["20475"] = {
				"20475", -- [1]
				"Timer20475cd", -- [2]
				"~活化炸弹", -- [3]
				11, -- [4]
				132863, -- [5]
				"cd", -- [6]
				20475, -- [7]
				3, -- [8]
				"Geddon", -- [9]
				["id"] = 668,
			},
			["19702"] = {
				"19702", -- [1]
				"Timer19702cd", -- [2]
				"~末日降临", -- [3]
				7, -- [4]
				136179, -- [5]
				"cd", -- [6]
				19702, -- [7]
				3, -- [8]
				"Lucifron", -- [9]
				["id"] = 663,
			},
			["19779"] = {
				"19779", -- [1]
				"Timer19779target	烈焰行者祭司", -- [2]
				"灵感: 烈焰行者祭司", -- [3]
				10, -- [4]
				132333, -- [5]
				"target", -- [6]
				19779, -- [7]
				5, -- [8]
				"Sulfuron", -- [9]
				["id"] = 669,
			},
			["23918"] = {
				"23918", -- [1]
				"Timer23918active", -- [2]
				"音爆 结束", -- [3]
				10, -- [4]
				136222, -- [5]
				"active", -- [6]
				23918, -- [7]
				5, -- [8]
				"Jeklik", -- [9]
				["id"] = 785,
			},
			["24324"] = {
				"24324", -- [1]
				"Timer24324next", -- [2]
				"血液虹吸", -- [3]
				90, -- [4]
				136168, -- [5]
				"next", -- [6]
				24324, -- [7]
				2, -- [8]
				"Hakkar", -- [9]
				["id"] = 793,
			},
			["20566"] = {
				"20566", -- [1]
				"Timer20566cd", -- [2]
				"~拉格纳罗斯之怒", -- [3]
				26.7, -- [4]
				135827, -- [5]
				"cd", -- [6]
				20566, -- [7]
				2, -- [8]
				"Ragnaros-Classic", -- [9]
				["id"] = 672,
			},
			["19408"] = {
				"19408", -- [1]
				"Timer19408cd", -- [2]
				"~恐慌", -- [3]
				30, -- [4]
				136147, -- [5]
				"cd", -- [6]
				19408, -- [7]
				2, -- [8]
				"Magmadar", -- [9]
				["id"] = 664,
			},
			["19659"] = {
				"19659", -- [1]
				"Timer19659cd", -- [2]
				"~点燃法力", -- [3]
				27, -- [4]
				135818, -- [5]
				"cd", -- [6]
				19659, -- [7]
				2, -- [8]
				"Geddon", -- [9]
				["id"] = 668,
			},
			["23340"] = {
				"23340", -- [1]
				"Timer23340target2	小琪哥哥", -- [2]
				"埃博诺克之影: 小琪哥哥", -- [3]
				8, -- [4]
				136160, -- [5]
				"target", -- [6]
				23340, -- [7]
				5, -- [8]
				"Ebonroc", -- [9]
				["id"] = 614,
			},
			["24327"] = {
				"24327", -- [1]
				"Timer24327target	纳格兰的天空", -- [2]
				"疯狂: 纳格兰的天空", -- [3]
				10, -- [4]
				136206, -- [5]
				"target", -- [6]
				24327, -- [7]
				5, -- [8]
				"Hakkar", -- [9]
				["id"] = 793,
			},
			["23339"] = {
				"23339", -- [1]
				"Timer23339cd", -- [2]
				"~龙翼打击", -- [3]
				30, -- [4]
				134316, -- [5]
				"cd", -- [6]
				23339, -- [7]
				2, -- [8]
				"Firemaw", -- [9]
				["id"] = 613,
			},
			["24300"] = {
				"24300", -- [1]
				"Timer24300target	纳格兰的天空", -- [2]
				"吸取生命: 纳格兰的天空", -- [3]
				7, -- [4]
				136169, -- [5]
				"target", -- [6]
				24300, -- [7]
				5, -- [8]
				"Marli", -- [9]
				["id"] = 786,
			},
			["19703"] = {
				"19703", -- [1]
				"Timer19703cd", -- [2]
				"~鲁西弗隆的诅咒", -- [3]
				12, -- [4]
				136123, -- [5]
				"cd", -- [6]
				19703, -- [7]
				3, -- [8]
				"Lucifron", -- [9]
				["id"] = 663,
			},
			["18584"] = {
				"18584", -- [1]
				"Timer18584cast", -- [2]
				"吐息 ", -- [3]
				5, -- [4]
				135805, -- [5]
				"cast", -- [6]
				18584, -- [7]
				3, -- [8]
				"Onyxia", -- [9]
				["id"] = 1084,
			},
			["23342"] = {
				"23342", -- [1]
				"Timer23342active4", -- [2]
				"疯狂结束", -- [3]
				10, -- [4]
				132117, -- [5]
				"active", -- [6]
				23342, -- [7]
				5, -- [8]
				"Flamegor", -- [9]
				["id"] = 615,
			},
			["17172"] = {
				"17172", -- [1]
				"Timer17172target	Simonyang", -- [2]
				"妖术: Simonyang", -- [3]
				5, -- [4]
				136071, -- [5]
				"target", -- [6]
				17172, -- [7]
				5, -- [8]
				"Jindo", -- [9]
				["id"] = 792,
			},
			["23895"] = {
				"23895", -- [1]
				"Timer23895target	拉扎什眼镜蛇", -- [2]
				"恢复: 拉扎什眼镜蛇", -- [3]
				15, -- [4]
				135953, -- [5]
				"target", -- [6]
				23895, -- [7]
				5, -- [8]
				"Venoxis", -- [9]
				["id"] = 784,
			},
			["12540"] = {
				"12540", -- [1]
				"Timer12540target	山姆迪恩", -- [2]
				"凿击: 山姆迪恩", -- [3]
				4, -- [4]
				132155, -- [5]
				"target", -- [6]
				12540, -- [7]
				3, -- [8]
				"Thekal", -- [9]
				["id"] = 789,
			},
			["19713"] = {
				"19713", -- [1]
				"Timer19713cd", -- [2]
				"~沙斯拉尔的诅咒", -- [3]
				6, -- [4]
				136121, -- [5]
				"cd", -- [6]
				19713, -- [7]
				3, -- [8]
				"Shazzrah", -- [9]
				["id"] = 667,
			},
			["19451"] = {
				"19451", -- [1]
				"Timer19451active", -- [2]
				"狂乱结束", -- [3]
				8, -- [4]
				132117, -- [5]
				"active", -- [6]
				19451, -- [7]
				5, -- [8]
				"Magmadar", -- [9]
				["id"] = 664,
			},
			["20478"] = {
				"20478", -- [1]
				"Timer20478cast", -- [2]
				"末日决战 ", -- [3]
				8, -- [4]
				135826, -- [5]
				"cast", -- [6]
				20478, -- [7]
				2, -- [8]
				"Geddon", -- [9]
				["id"] = 668,
			},
			["20534"] = {
				"20534", -- [1]
				"Timer20534cd", -- [2]
				"~传送", -- [3]
				19.4, -- [4]
				135736, -- [5]
				"cd", -- [6]
				20534, -- [7]
				5, -- [8]
				"Majordomo", -- [9]
				["id"] = 671,
			},
			["19715"] = {
				"19715", -- [1]
				"Timer19715cd", -- [2]
				"~法术反制", -- [3]
				9.6, -- [4]
				135856, -- [5]
				"cd", -- [6]
				19715, -- [7]
				3, -- [8]
				"Shazzrah", -- [9]
				["id"] = 667,
			},
			["22686"] = {
				"22686", -- [1]
				"Timer22686cd3", -- [2]
				"~低沉咆哮", -- [3]
				26.7, -- [4]
				136129, -- [5]
				"cd", -- [6]
				22686, -- [7]
				2, -- [8]
				"Nefarian-Classic", -- [9]
				["id"] = 617,
			},
			["23954"] = {
				"23954", -- [1]
				"Timer23954next", -- [2]
				"强效治疗术", -- [3]
				20, -- [4]
				135915, -- [5]
				"next", -- [6]
				23954, -- [7]
				4, -- [8]
				"Jeklik", -- [9]
				["id"] = 785,
			},
			["23860"] = {
				"23860", -- [1]
				"Timer23860target	纳格兰的天空", -- [2]
				"神圣之火: 纳格兰的天空", -- [3]
				8, -- [4]
				135972, -- [5]
				"target", -- [6]
				23860, -- [7]
				5, -- [8]
				"Venoxis", -- [9]
				["id"] = 784,
			},
			["19716"] = {
				"19716", -- [1]
				"Timer19716cd", -- [2]
				"~基赫纳斯的诅咒", -- [3]
				6, -- [4]
				136160, -- [5]
				"cd", -- [6]
				19716, -- [7]
				3, -- [8]
				"Gehennas", -- [9]
				["id"] = 665,
			},
			["23861"] = {
				"23861", -- [1]
				"Timer23861active", -- [2]
				"毒云 结束", -- [3]
				10, -- [4]
				136064, -- [5]
				"active", -- [6]
				23861, -- [7]
				3, -- [8]
				"Venoxis", -- [9]
				["id"] = 784,
			},
			["19695"] = {
				"19695", -- [1]
				"Timer19695active", -- [2]
				"地狱火结束", -- [3]
				8, -- [4]
				135818, -- [5]
				"active", -- [6]
				19695, -- [7]
				2, -- [8]
				"Geddon", -- [9]
				["id"] = 668,
			},
			["19492"] = {
				"19492", -- [1]
				"Timer19492cd", -- [2]
				"~反魔法脉冲", -- [3]
				10, -- [4]
				135894, -- [5]
				"cd", -- [6]
				19492, -- [7]
				2, -- [8]
				"Garr-Classic", -- [9]
				["id"] = 666,
			},
			["20619"] = {
				"20619", -- [1]
				"Timer20619active", -- [2]
				"魔法反射结束", -- [3]
				10, -- [4]
				135849, -- [5]
				"active", -- [6]
				20619, -- [7]
				5, -- [8]
				"Majordomo", -- [9]
				["id"] = 671,
			},
			["21060"] = {
				"21060", -- [1]
				"Timer21060target	哇你是贼狠哇", -- [2]
				"致盲: 哇你是贼狠哇", -- [3]
				10, -- [4]
				136175, -- [5]
				"target", -- [6]
				21060, -- [7]
				3, -- [8]
				"Thekal", -- [9]
				["id"] = 789,
			},
			["24212"] = {
				"24212", -- [1]
				"Timer24212target	随风之狂战", -- [2]
				"暗言术：痛: 随风之狂战", -- [3]
				18, -- [4]
				136207, -- [5]
				"target", -- [6]
				24212, -- [7]
				3, -- [8]
				"Arlokk", -- [9]
				["id"] = 791,
			},
			["21075"] = {
				"21075", -- [1]
				"Timer21075active", -- [2]
				"伤害反射护盾结束", -- [3]
				10, -- [4]
				136121, -- [5]
				"active", -- [6]
				21075, -- [7]
				5, -- [8]
				"Majordomo", -- [9]
				["id"] = 671,
			},
			["18173"] = {
				"18173", -- [1]
				"Timer18173cd", -- [2]
				"~燃烧刺激", -- [3]
				15.7, -- [4]
				132937, -- [5]
				"cd", -- [6]
				18173, -- [7]
				3, -- [8]
				"Vaelastrasz", -- [9]
				["id"] = 611,
			},
			["16856"] = {
				"16856", -- [1]
				"Timer16856target	山姆迪恩", -- [2]
				"致死打击: 山姆迪恩", -- [3]
				5, -- [4]
				132355, -- [5]
				"target", -- [6]
				16856, -- [7]
				5, -- [8]
				"Bloodlord", -- [9]
				["id"] = 787,
			},
			["24573"] = {
				"24573", -- [1]
				"Timer24573target3	谁比我能扛", -- [2]
				"致死打击: 谁比我能扛", -- [3]
				5, -- [4]
				132355, -- [5]
				"target", -- [6]
				24573, -- [7]
				5, -- [8]
				"Broodlord", -- [9]
				["id"] = 612,
			},
		},
	},
	["disable_talent_feature"] = true,
	["spell_school_cache"] = {
		["扫击"] = 1,
		["灵魂燃烧"] = 4,
		["火球术"] = 4,
		["毒性钉刺"] = 8,
		["打击"] = 1,
		["痛击"] = 1,
		["尖牙撕咬"] = 1,
		["射击"] = 1,
		["吸血"] = 32,
		["!Melee"] = 1,
		["钩网"] = 1,
		["魔爆术"] = 64,
		["闪电链"] = 8,
		["盾击"] = 1,
		["上古恐慌"] = 32,
	},
	["deathlog_healingdone_min"] = 1,
	["plater"] = {
		["realtime_dps_enabled"] = false,
		["damage_taken_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_shadow"] = true,
		["realtime_dps_player_enabled"] = false,
		["realtime_dps_player_size"] = 12,
		["damage_taken_size"] = 12,
		["realtime_dps_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_size"] = 12,
		["damage_taken_shadow"] = true,
		["realtime_dps_player_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["damage_taken_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_enabled"] = false,
		["realtime_dps_shadow"] = true,
	},
	["data_sync"] = false,
	["mobs_data"] = {
	},
	["run_code"] = {
		["on_specchanged"] = "\n-- run when the player changes its spec",
		["on_zonechanged"] = "\n-- when the player changes zone, this code will run",
		["on_init"] = "\n-- code to run when Details! initializes, put here code which only will run once\n-- this also will run then the profile is changed\n\n--size of the death log tooltip in the Deaths display (default 350)\nDetails.death_tooltip_width = 350;\n\n--when in arena or battleground, details! silently switch to activity time (goes back to the old setting on leaving, default true)\nDetails.force_activity_time_pvp = true;\n\n--speed of the bar animations (default 33)\nDetails.animation_speed = 33;\n\n--threshold to trigger slow or fast speed (default 0.45)\nDetails.animation_speed_mintravel = 0.45;\n\n--call to update animations\nDetails:RefreshAnimationFunctions();\n\n--max window size, does require a /reload to work (default 480 x 450)\nDetails.max_window_size.width = 480;\nDetails.max_window_size.height = 450;\n\n--use the arena team color as the class color (default true)\nDetails.color_by_arena_team = true;\n\n--use the role icon in the player bar when inside an arena (default false)\nDetails.show_arena_role_icon = false;\n\n--how much time the update warning is shown (default 10)\nDetails.update_warning_timeout = 10;",
		["on_groupchange"] = "\n-- this code runs when the player enter or leave a group",
		["on_leavecombat"] = "\n-- this code runs when the player leave combat",
		["on_entercombat"] = "\n-- this code runs when the player enters in combat",
	},
	["report_where"] = "SAY",
	["createauraframe"] = {
		["y"] = 2.67028808593750e-05,
		["x"] = 3.05175781250e-05,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["global_plugin_database"] = {
	},
	["show_totalhitdamage_on_overkill"] = false,
	["mobs_data_compiled"] = {
	},
	["item_level_pool"] = {
	},
	["savedCustomSpells"] = {
		{
			3, -- [1]
			"环境伤害 (高处坠落)", -- [2]
			"Interface\\ICONS\\Spell_Magic_FeatherFall", -- [3]
		}, -- [1]
		{
			1, -- [1]
			"近战", -- [2]
			"Interface\\ICONS\\INV_Sword_04", -- [3]
		}, -- [2]
		{
			4, -- [1]
			"环境伤害 (溺水)", -- [2]
			"Interface\\ICONS\\Ability_Suffocate", -- [3]
		}, -- [3]
		{
			5, -- [1]
			"环境伤害 (疲劳)", -- [2]
			"Interface\\ICONS\\Spell_Arcane_MindMastery", -- [3]
		}, -- [4]
		{
			7, -- [1]
			"环境伤害 (岩浆)", -- [2]
			"Interface\\ICONS\\Ability_Rhyolith_Volcano", -- [3]
		}, -- [5]
	},
	["update_warning_timeout"] = 10,
	["plugin_window_pos"] = {
		["y"] = -100.599143981934,
		["x"] = -81.5186004638672,
		["point"] = "BOTTOM",
		["scale"] = 1,
	},
	["mythic_plus"] = {
		["make_overall_boss_only"] = false,
		["mythicrun_chart_frame"] = {
		},
		["merge_boss_trash"] = true,
		["delay_to_show_graphic"] = 5,
		["always_in_combat"] = false,
		["make_overall_when_done"] = true,
		["delete_trash_after_merge"] = true,
		["show_damage_graphic"] = true,
		["mythicrun_chart_frame_ready"] = {
		},
		["boss_dedicated_segment"] = true,
		["mythicrun_chart_frame_minimized"] = {
		},
		["last_mythicrun_chart"] = {
		},
	},
	["raid_data"] = {
		["mythic_raid_data"] = {
			[0] = {
				["longest"] = 594.01099999994,
				["kills"] = 0,
				["try_history"] = {
				},
				["wipes"] = 14,
				["best_try"] = 1,
			},
		},
	},
	["tutorial"] = {
		["unlock_button"] = 0,
		["main_help_button"] = 390,
		["ATTRIBUTE_SELECT_TUTORIAL1"] = true,
		["logons"] = 390,
		["ctrl_click_close_tutorial"] = false,
		["DISABLE_ONDEATH_PANEL"] = true,
		["STREAMER_PLUGIN_FIRSTRUN"] = true,
		["FORGE_TUTORIAL"] = true,
		["DETAILS_INFO_TUTORIAL1"] = true,
		["alert_frames"] = {
			false, -- [1]
			false, -- [2]
			false, -- [3]
			false, -- [4]
			false, -- [5]
			false, -- [6]
		},
		["DETAILS_INFO_TUTORIAL2"] = 2,
		["OVERALLDATA_WARNING1"] = 30,
		["WINDOW_LOCK_UNLOCK1"] = true,
		["OPTIONS_PANEL_OPENED"] = true,
		["HISTORYPANEL_TUTORIAL"] = true,
		["bookmark_tutorial"] = false,
		["version_announce"] = 0,
		["MIN_COMBAT_TIME"] = true,
	},
	["always_use_profile_name"] = "默认-2020-01-02",
	["savedStyles"] = {
	},
	["always_use_profile_exception"] = {
	},
	["details_auras"] = {
	},
	["switchSaved"] = {
		["slots"] = 30,
		["table"] = {
			{
				["atributo"] = 1,
				["sub_atributo"] = 1,
			}, -- [1]
			{
				["atributo"] = 2,
				["sub_atributo"] = 1,
			}, -- [2]
			{
				["atributo"] = 1,
				["sub_atributo"] = 6,
			}, -- [3]
			{
				["atributo"] = 4,
				["sub_atributo"] = 5,
			}, -- [4]
			{
			}, -- [5]
			{
			}, -- [6]
			{
			}, -- [7]
			{
			}, -- [8]
			{
			}, -- [9]
			{
			}, -- [10]
			{
			}, -- [11]
			{
			}, -- [12]
			{
			}, -- [13]
			{
			}, -- [14]
			{
			}, -- [15]
			{
			}, -- [16]
			{
			}, -- [17]
			{
			}, -- [18]
			{
			}, -- [19]
			{
			}, -- [20]
			{
			}, -- [21]
			{
			}, -- [22]
			{
			}, -- [23]
			{
			}, -- [24]
			{
			}, -- [25]
			{
			}, -- [26]
			{
			}, -- [27]
			{
			}, -- [28]
			{
			}, -- [29]
			{
			}, -- [30]
			{
			}, -- [31]
			{
			}, -- [32]
			{
			}, -- [33]
		},
	},
	["savedTimeCaptures"] = {
	},
	["latest_news_saw"] = "v1.13.5.212",
	["custom"] = {
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示你的团队中谁在战斗时使用了药水.",
			["tooltip"] = "			--init:\n			local player, combat, instance = ...\n\n			--get the debuff container for potion of focus\n			local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n			if (debuff_uptime_container) then\n			    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n			    if (focus_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_FOCUS_POTION_ID)\n				GameCooltip:AddLine (name, 1) --> can use only 1 focus potion (can't be pre-potion)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n\n			--get the buff container for all the others potions\n			local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n			if (buff_uptime_container) then\n			    --potion of the jade serpent\n			    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n			    if (jade_serpent_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_INT_POTION_ID)\n				GameCooltip:AddLine (name, jade_serpent_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of mogu power\n			    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n			    if (mogu_power_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STR_POTION_ID)\n				GameCooltip:AddLine (name, mogu_power_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --mana potion\n			    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n			    if (mana_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_MANA_POTION_ID)\n				GameCooltip:AddLine (name, mana_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --prolongued power\n			    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n			    if (prolongued_power) then\n				local name, _, icon = GetSpellInfo (DETAILS_AGI_POTION_ID)\n				GameCooltip:AddLine (name, prolongued_power.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			    \n			    --potion of the mountains\n			    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n			    if (mountains_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_STAMINA_POTION_ID)\n				GameCooltip:AddLine (name, mountains_potion.activedamt)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n			    end\n			end\n		",
			["icon"] = "Interface\\ICONS\\INV_Potion_03",
			["name"] = "有使用药水",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local misc_container = combat:GetActorList ( DETAILS_ATTRIBUTE_MISC )\n\n				--do the loop:\n				for _, player in ipairs ( misc_container ) do \n				    \n				    --only player in group\n				    if (player:IsGroupPlayer()) then\n					\n					local found_potion = false\n					\n					--get the spell debuff uptime container\n					local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n					if (debuff_uptime_container) then\n					    --potion of focus (can't use as pre-potion, so, its amount is always 1\n					    local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n\n					    if (focus_potion) then\n						total = total + 1\n						found_potion = true\n						if (top < 1) then\n						    top = 1\n						end\n						--add amount to the player \n						instance_container:AddValue (player, 1)\n					    end\n					end\n					\n					--get the spell buff uptime container\n					local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n					if (buff_uptime_container) then\n					    \n					    --potion of the jade serpent\n					    local jade_serpent_potion = buff_uptime_container [DETAILS_INT_POTION_ID]\n					    if (jade_serpent_potion) then\n						local used = jade_serpent_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of mogu power\n					    local mogu_power_potion = buff_uptime_container [DETAILS_STR_POTION_ID]\n					    if (mogu_power_potion) then\n						local used = mogu_power_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --mana potion\n					    local mana_potion = buff_uptime_container [DETAILS_MANA_POTION_ID]\n					    if (mana_potion) then\n						local used = mana_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of prolongued power\n					    local prolongued_power = buff_uptime_container [DETAILS_AGI_POTION_ID]\n					    if (prolongued_power) then\n						local used = prolongued_power.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					    \n					    --potion of the mountains\n					    local mountains_potion = buff_uptime_container [DETAILS_STAMINA_POTION_ID]\n					    if (mountains_potion) then\n						local used = mountains_potion.activedamt\n						if (used > 0) then\n						    total = total + used\n						    found_potion = true\n						    if (used > top) then\n							top = used\n						    end\n						    --add amount to the player \n						    instance_container:AddValue (player, used)\n						end\n					    end\n					end\n					\n					if (found_potion) then\n					    amount = amount + 1\n					end    \n				    end\n				end\n\n				--return:\n				return total, top, amount\n				",
			["attribute"] = false,
			["script_version"] = 5,
		}, -- [1]
		{
			["source"] = false,
			["total_script"] = false,
			["author"] = "Details! Team",
			["percent_script"] = false,
			["desc"] = "显示你的队伍中谁使用过治疗药水或者治疗石",
			["icon"] = "Interface\\ICONS\\INV_Stone_04",
			["spellid"] = false,
			["name"] = "治疗药水&治疗石",
			["script"] = "			--get the parameters passed\n			local combat, instance_container, instance = ...\n			--declade the values to return\n			local total, top, amount = 0, 0, 0\n			\n			--do the loop\n			local AllHealCharacters = combat:GetActorList (DETAILS_ATTRIBUTE_HEAL)\n			for index, character in ipairs (AllHealCharacters) do\n				local AllSpells = character:GetSpellList()\n				local found = false\n				for spellid, spell in pairs (AllSpells) do\n					if (DETAILS_HEALTH_POTION_LIST [spellid]) then\n						instance_container:AddValue (character, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						found = true\n					end\n				end\n			\n				if (found) then\n					amount = amount + 1\n				end\n			end\n			--loop end\n			--return the values\n			return total, top, amount\n			",
			["target"] = false,
			["tooltip"] = "			--get the parameters passed\n			local actor, combat, instance = ...\n			\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GameCooltip = GameCooltip\n			local R, G, B, A = 0, 0, 0, 0.75\n			\n			local hs = actor:GetSpell (6262)\n			if (hs) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(6262)),  _detalhes:ToK(hs.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (6262)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_HEALTH_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_HEALTH_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_HEALTH_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_REJU_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_REJU_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_REJU_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n\n			--Cooltip code\n			",
			["attribute"] = false,
			["script_version"] = 15,
		}, -- [2]
		{
			["source"] = false,
			["author"] = "Details!",
			["tooltip"] = "				\n			",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成伤害的时间",
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Red",
			["spellid"] = false,
			["name"] = "活跃伤害时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, amount = 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["attribute"] = false,
			["script_version"] = 2,
		}, -- [3]
		{
			["source"] = false,
			["author"] = "Details!",
			["tooltip"] = "				\n			",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "每个人造成治疗的时间.",
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Green",
			["spellid"] = false,
			["name"] = "活跃治疗时间",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_HEAL )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["attribute"] = false,
			["script_version"] = 2,
		}, -- [4]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show the crowd control amount for each player.",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["icon"] = "Interface\\ICONS\\Spell_Frost_FreezingBreath",
			["spellid"] = false,
			["name"] = "造成群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local spells = {}\n				for spellid, spell in pairs (actor.cc_done_spells._ActorTable) do\n				    tinsert (spells, {spellid, spell.counter})\n				end\n\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				local targets = {}\n				for playername, amount in pairs (actor.cc_done_targets) do\n				    tinsert (targets, {playername, amount})\n				end\n\n				table.sort (targets, _detalhes.Sort2)\n\n				_detalhes:AddTooltipSpellHeaderText (\"Targets\", \"yellow\", #targets)\n				local class, _, _, _, _, r, g, b = _detalhes:GetClass (actor.nome)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, target in ipairs (targets) do\n				    GameCooltip:AddLine (target[1], target [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (target [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				    --\n				end\n			",
			["target"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n					if (character.cc_done and character:IsPlayer()) then\n						local cc_done = floor (character.cc_done)\n						instance_container:AddValue (character, cc_done)\n						total = total + cc_done\n						if (cc_done > top) then\n							top = cc_done\n						end\n						amount = amount + 1\n					end\n				end\n\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 11,
		}, -- [5]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show the amount of crowd control received for each player.",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["icon"] = "Interface\\ICONS\\Spell_Frost_ChainsOfIce",
			["spellid"] = false,
			["name"] = "受到群体控制",
			["tooltip"] = "				local actor, combat, instance = ...\n				local name = actor:name()\n				local spells, from = {}, {}\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					local on_actor = character.cc_done_targets [name]\n					if (on_actor) then\n					    tinsert (from, {character:name(), on_actor})\n					    \n					    for spellid, spell in pairs (character.cc_done_spells._ActorTable) do\n						\n						local spell_on_actor = spell.targets [name]\n						if (spell_on_actor) then\n						    local has_spell\n						    for index, spell_table in ipairs (spells) do\n							if (spell_table [1] == spellid) then\n							    spell_table [2] = spell_table [2] + spell_on_actor\n							    has_spell = true\n							end\n						    end\n						    if (not has_spell) then\n							tinsert (spells, {spellid, spell_on_actor}) \n						    end\n						end\n						\n					    end            \n					end\n				    end\n				end\n\n				table.sort (from, _detalhes.Sort2)\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)    \n				end\n\n				_detalhes:AddTooltipSpellHeaderText (\"From\", \"yellow\", #from)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, t in ipairs (from) do\n				    GameCooltip:AddLine (t[1], t[2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (t [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end     \n				    \n				end\n			",
			["target"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amt = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n				DETAILS_CUSTOM_CC_RECEIVED_CACHE = DETAILS_CUSTOM_CC_RECEIVED_CACHE or {}\n				wipe (DETAILS_CUSTOM_CC_RECEIVED_CACHE)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					\n					for player_name, amount in pairs (character.cc_done_targets) do\n					    local target = combat (1, player_name) or combat (2, player_name)\n					    if (target and target:IsPlayer()) then\n						instance_container:AddValue (target, amount)\n						total = total + amount\n						if (amount > top) then\n						    top = amount\n						end\n						if (not DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name]) then\n						    DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name] = true\n						    amt = amt + 1\n						end\n					    end\n					end\n					\n				    end\n				end\n\n				return total, top, amt\n			",
			["attribute"] = false,
			["script_version"] = 3,
		}, -- [6]
		{
			["source"] = false,
			["desc"] = "在统计中显示你的技能.",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				local dps = _detalhes:ToK (floor (value) / combat:GetCombatTime())\n				local percent = string.format (\"%.1f\", value/total*100)\n				return dps .. \", \" .. percent\n			",
			["total_script"] = "local value, top, total, combat, instance = ...\n			local dps = _detalhes:ToK (floor (value) / combat:GetCombatTime())\n			local percent = string.format (\"%.1f\", value/total*100)\n\n			return math.floor (value) .. \" (\" .. dps .. \", \" .. percent .. \"\"",
			["icon"] = "Interface\\CHATFRAME\\UI-ChatIcon-Battlenet",
			["spellid"] = false,
			["name"] = "我的技能",
			["tooltip"] = "				--config:\n				--Background RBG and Alpha:\n				local R, G, B, A = 0, 0, 0, 0.75\n				local R, G, B, A = 0.1960, 0.1960, 0.1960, 0.8697\n				\n				--get the parameters passed\n				local spell, combat, instance = ...\n				\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GC = GameCooltip\n				GC:SetOption (\"YSpacingMod\", 2)\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				\n				if (spell.n_dmg) then\n					\n					local spellschool, schooltext = spell.spellschool, \"\"\n					if (spellschool) then\n						local t = _detalhes.spells_school [spellschool]\n						if (t and t.name) then\n							schooltext = t.formated\n						end\n					end\n					\n					local total_hits = spell.counter\n					local combat_time = instance.showing:GetCombatTime()\n					\n					local debuff_uptime_total, cast_string = \"\", \"\"\n					local misc_actor = instance.showing (4, _detalhes.playername)\n					if (misc_actor) then\n						local debuff_uptime = misc_actor.debuff_uptime_spells and misc_actor.debuff_uptime_spells._ActorTable [spell.id] and misc_actor.debuff_uptime_spells._ActorTable [spell.id].uptime\n						if (debuff_uptime) then\n							debuff_uptime_total = floor (debuff_uptime / instance.showing:GetCombatTime() * 100)\n						end\n						\n						local spell_cast = misc_actor.spell_cast and misc_actor.spell_cast [spell.id]\n						\n						if (not spell_cast and misc_actor.spell_cast) then\n							local spellname = GetSpellInfo (spell.id)\n							for casted_spellid, amount in pairs (misc_actor.spell_cast) do\n								local casted_spellname = GetSpellInfo (casted_spellid)\n								if (casted_spellname == spellname) then\n									spell_cast = amount .. \" (|cFFFFFF00?|r)\"\n								end\n							end\n						end\n						if (not spell_cast) then\n							spell_cast = \"(|cFFFFFF00?|r)\"\n						end\n						cast_string = cast_string .. spell_cast\n					end\n					\n					--Cooltip code\n					GC:AddLine (\"Casts:\", cast_string or \"?\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					if (debuff_uptime_total ~= \"\") then\n						GC:AddLine (\"Uptime:\", (debuff_uptime_total or \"?\") .. \"%\")\n						GC:AddStatusBar (100, 1, R, G, B, A)\n						GC:AddIcon (\"\", 1, 1, 1, 16)\n					end\n					\n					GC:AddLine (\"Hits:\", spell.counter)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					local average = spell.total / total_hits\n					GC:AddLine (\"Average:\", _detalhes:ToK (average))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"E-Dps:\", _detalhes:ToK (spell.total / combat_time))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"School:\", schooltext)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					local n_average = spell.n_dmg / spell.n_amt\n					local T = (combat_time*spell.n_dmg)/spell.total\n					local P = average/n_average*100\n					T = P*T/100\n					\n					GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_dmg / T ))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					if (spell.c_amt > 0) then\n						local c_average = spell.c_dmg/spell.c_amt\n						local T = (combat_time*spell.c_dmg)/spell.total\n						local P = average/c_average*100\n						T = P*T/100\n						local crit_dps = spell.c_dmg / T\n						\n						GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n					else\n						GC:AddLine (\"Average / E-Dps: \",  \"0 / 0\")    \n					end\n					\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n					\n					GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					GC:AddIcon (\"\", 1, 1, 1, 16)\n					\n				elseif (spell.n_curado) then\n					\n					local spellschool, schooltext = spell.spellschool, \"\"\n					if (spellschool) then\n						local t = _detalhes.spells_school [spellschool]\n						if (t and t.name) then\n							schooltext = t.formated\n						end\n					end\n					\n					local total_hits = spell.counter\n					local combat_time = instance.showing:GetCombatTime()\n					\n					--Cooltip code\n					GC:AddLine (\"Hits:\", spell.counter)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					local average = spell.total / total_hits\n					GC:AddLine (\"Average:\", _detalhes:ToK (average))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"E-Hps:\", _detalhes:ToK (spell.total / combat_time))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"School:\", schooltext)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					local n_average = spell.n_curado / spell.n_amt\n					local T = (combat_time*spell.n_curado)/spell.total\n					local P = average/n_average*100\n					T = P*T/100\n					\n					GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_curado / T ))\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					if (spell.c_amt > 0) then\n						local c_average = spell.c_curado/spell.c_amt\n						local T = (combat_time*spell.c_curado)/spell.total\n						local P = average/c_average*100\n						T = P*T/100\n						local crit_dps = spell.c_curado / T\n						\n						GC:AddLine (\"Average / E-Hps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n					else\n						GC:AddLine (\"Average / E-Hps: \",  \"0 / 0\")    \n					end\n					\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					--GC:AddLine (\" \")\n					\n					GC:AddLine (\"Multistrike: \", spell.m_amt .. \" (\" ..floor ( spell.m_amt/total_hits*100) .. \"%)\")\n					GC:AddStatusBar (100, 1, R, G, B, A)\n					\n					GC:AddLine (\"On Normal / On Critical:\", spell.m_amt - spell.m_crit .. \"  / \" .. spell.m_crit)\n					GC:AddStatusBar (100, 1, R, G, B, A)\n				end\n\n			",
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local combat, instance_container, instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				local player\n				local pet_attribute\n				\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				local spec = DetailsFramework.GetSpecialization()\n				role = spec and DetailsFramework.GetSpecializationRole (spec) or role\n\n				if (role == \"DAMAGER\") then\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				elseif (role == \"HEALER\") then    \n					player = combat (DETAILS_ATTRIBUTE_HEAL, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_HEAL\n				else\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				end\n\n				--do the loop\n\n				if (player) then\n					local spells = player:GetSpellList()\n					for spellid, spell in pairs (spells) do\n						instance_container:AddValue (spell, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						amount = amount + 1\n					end\n				    \n					for _, PetName in ipairs (player.pets) do\n						local pet = combat (pet_attribute, PetName)\n						if (pet) then\n							for spellid, spell in pairs (pet:GetSpellList()) do\n								instance_container:AddValue (spell, spell.total, nil, \" (\" .. PetName:gsub ((\" <.*\"), \"\") .. \")\")\n								total = total + spell.total\n								if (top < spell.total) then\n									top = spell.total\n								end\n								amount = amount + 1\n							end\n						end\n					end\n				end\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 9,
		}, -- [7]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对标记骷髅的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [128]\n				if (DamageOnStar) then\n				    --RAID_TARGET_8 is the built-in localized word for 'Skull'.\n				    GameCooltip:AddLine (RAID_TARGET_8 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_8\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_8",
			["name"] = "对骷髅标记目标造成的伤害",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n				\n				--raid target flags: \n				-- 128: skull \n				-- 64: cross\n				-- 32: square\n				-- 16: moon\n				-- 8: triangle\n				-- 4: diamond\n				-- 2: circle\n				-- 1: star\n				\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					if (actor.raid_targets [128]) then\n					    CustomContainer:AddValue (actor, actor.raid_targets [128])\n					end        \n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 4,
		}, -- [8]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "显示对其它所有标记的目标造成的伤害数值",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object\n				local GameCooltip = GameCooltip\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [1]\n				if (DamageOnStar) then\n				    GameCooltip:AddLine (RAID_TARGET_1 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_1\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCircle = RaidTargets [2]\n				if (DamageOnCircle) then\n				    GameCooltip:AddLine (RAID_TARGET_2 .. \":\", format_func (_, DamageOnCircle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_2\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnDiamond = RaidTargets [4]\n				if (DamageOnDiamond) then\n				    GameCooltip:AddLine (RAID_TARGET_3 .. \":\", format_func (_, DamageOnDiamond))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_3\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnTriangle = RaidTargets [8]\n				if (DamageOnTriangle) then\n				    GameCooltip:AddLine (RAID_TARGET_4 .. \":\", format_func (_, DamageOnTriangle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_4\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnMoon = RaidTargets [16]\n				if (DamageOnMoon) then\n				    GameCooltip:AddLine (RAID_TARGET_5 .. \":\", format_func (_, DamageOnMoon))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_5\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnSquare = RaidTargets [32]\n				if (DamageOnSquare) then\n				    GameCooltip:AddLine (RAID_TARGET_6 .. \":\", format_func (_, DamageOnSquare))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_6\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCross = RaidTargets [64]\n				if (DamageOnCross) then\n				    GameCooltip:AddLine (RAID_TARGET_7 .. \":\", format_func (_, DamageOnCross))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_7\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_5",
			["name"] = "对其它标记目标造成的伤害",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					local total = (actor.raid_targets [1] or 0) --star\n					total = total + (actor.raid_targets [2] or 0) --circle\n					total = total + (actor.raid_targets [4] or 0) --diamond\n					total = total + (actor.raid_targets [8] or 0) --tiangle\n					total = total + (actor.raid_targets [16] or 0) --moon\n					total = total + (actor.raid_targets [32] or 0) --square\n					total = total + (actor.raid_targets [64] or 0) --cross\n					\n					if (total > 0) then\n					    CustomContainer:AddValue (actor, total)\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 4,
		}, -- [9]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show overall damage done on the fly.",
			["total_script"] = "				local value, top, total, combat, instance = ...\n\n				--get the time of overall combat\n				local OverallCombatTime = Details:GetCombat (-1):GetCombatTime()\n				\n				--get the time of current combat if the player is in combat\n				if (Details.in_combat) then\n					local CurrentCombatTime = Details:GetCombat (0):GetCombatTime()\n					OverallCombatTime = OverallCombatTime + CurrentCombatTime\n				end\n				\n				--build the string\n				local ToK = Details:GetCurrentToKFunction()\n				local s = ToK (_, value / OverallCombatTime)\n				\n				if (instance.row_info.textR_show_data[3]) then\n					s = ToK (_, value) .. \" (\" .. s .. \", \"\n				else\n					s = ToK (_, value) .. \" (\" .. s\n				end\n				\n				return s\n			",
			["icon"] = "Interface\\Buttons\\Spell-Reset",
			["spellid"] = false,
			["name"] = "动态总体伤害",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n				\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip2\n				\n				--Cooltip code\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n				\n				local AllSpells = {}\n				\n				--overall\n				local player = OverallCombat [1]:GetActor (actor.nome)\n				if (player) then\n					local playerSpells = player:GetSpellList()\n					for spellID, spellTable in pairs (playerSpells) do\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						AllSpells [spellName] = spellTable.total\n					end\n				end\n				\n				--current\n				local player = CurrentCombat [1]:GetActor (actor.nome)\n				if (player) then\n					local playerSpells = player:GetSpellList()\n					for spellID, spellTable in pairs (playerSpells) do\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						AllSpells [spellName] = (AllSpells [spellName] or 0) + (spellTable.total or 0)\n					end\n				end\n				\n				local sortedList = {}\n				for spellID, total in pairs (AllSpells) do\n					tinsert (sortedList, {spellID, total})\n				end\n				table.sort (sortedList, Details.Sort2)\n				\n				local format_func = Details:GetCurrentToKFunction()\n				\n				--build the tooltip\n				for i, t in ipairs (sortedList) do\n					local spellID, total = unpack (t)\n					if (total > 1) then\n						local spellName, _, spellIcon = Details.GetSpellInfoC  (spellID)\n						\n						GameCooltip:AddLine (spellName, format_func (_, total))\n						Details:AddTooltipBackgroundStatusbar()\n						GameCooltip:AddIcon (spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n					end\n				end\n			",
			["target"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n				\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n				\n				--check if the actor list of overall and current combat is valid\n				if (not OverallCombat.GetActorList or not CurrentCombat.GetActorList) then\n					return 0, 0, 0\n				end\n				\n				--get the damage actor container for overall\n				local damage_container_overall = OverallCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				--get the damage actor container for current\n				local damage_container_current = CurrentCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--check if the results from getactorlist is a table and has more than 1 actor on it\n				if (type (damage_container_overall) ~= \"table\") then\n					return 0, 0, 0\n				end\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container_overall ) do \n					--only player in group\n					if (player and player:IsGroupPlayer()) then\n						instance_container:AddValue (player, player.total)\n					end\n				end\n				\n				--does the player is in combat?\n				--if true need to add the data from the current fight as well\n				if (UnitAffectingCombat(\"player\")) then\n					for _, player in ipairs ( damage_container_current ) do \n						--only player in group\n						if (player and player:IsGroupPlayer()) then\n							instance_container:AddValue (player, player.total)        \n						end\n					end\n				end\n				\n				total, top =  instance_container:GetTotalAndHighestValue()\n				amount =  instance_container:GetNumActors()\n				\n				--return:\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 6,
		}, -- [10]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Damage done to shields",
			["tooltip"] = "				--get the parameters passed\n				local actor, Combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				--get the actor total damage absorbed\n				local totalAbsorb = actor.totalabsorbed\n				local format_func = Details:GetCurrentToKFunction()\n\n				--get the damage absorbed by all the actor pets\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n				    end\n				end\n\n				GameCooltip:AddLine (actor:Name(), format_func (_, actor.totalabsorbed))\n				Details:AddTooltipBackgroundStatusbar()\n\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n					\n					GameCooltip:AddLine (petName, format_func (_, pet.totalabsorbed))\n					Details:AddTooltipBackgroundStatusbar()        \n					\n				    end\n				end\n			",
			["icon"] = "Interface\\ICONS\\Spell_Holy_PowerWordShield",
			["name"] = "对护盾造成的伤害",
			["spellid"] = false,
			["target"] = false,
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for index, actor in ipairs (Combat:GetActorList(1)) do\n				    if (actor:IsPlayer()) then\n					\n					--get the actor total damage absorbed\n					local totalAbsorb = actor.totalabsorbed\n					\n					--get the damage absorbed by all the actor pets\n					for petIndex, petName in ipairs (actor.pets) do\n					    local pet = Combat :GetActor (1, petName)\n					    if (pet) then\n						totalAbsorb = totalAbsorb + pet.totalabsorbed\n					    end\n					end\n					\n					--add the value to the actor on the custom container\n					CustomContainer:AddValue (actor, totalAbsorb)        \n					\n				    end\n				end\n				--loop end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["attribute"] = false,
			["script_version"] = 2,
		}, -- [11]
	},
	["performance_profiles"] = {
		["Dungeon"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["RaidFinder"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Mythic"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Arena"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid30"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground40"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["aura"] = true,
			["miscdata"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
	},
	["exit_log"] = {
		"1 - Closing Janela Info.", -- [1]
		"2 - Clearing user place from instances.", -- [2]
		"4 - Reversing switches.", -- [3]
		"6 - Saving Config.", -- [4]
		"7 - Saving Profiles.", -- [5]
		"8 - Saving nicktag cache.", -- [6]
	},
	["realm_sync"] = true,
	["lastUpdateWarning"] = 1595080083,
	["always_use_profile"] = true,
}
