
GOODLEADER_DB = {
	["profileKeys"] = {
		["落星辰 - 龙之召唤"] = "落星辰 - 龙之召唤",
		["叹风尘 - 龙之召唤"] = "叹风尘 - 龙之召唤",
		["风尘叹 - 龙之召唤"] = "风尘叹 - 龙之召唤",
		["冬天吃栗子 - 龙之召唤"] = "冬天吃栗子 - 龙之召唤",
		["莫起风 - 龙之召唤"] = "莫起风 - 龙之召唤",
		["Shop - 龙之召唤"] = "Shop - 龙之召唤",
		["Global - 龙之召唤"] = "Global - 龙之召唤",
		["Lêlantos - 龙之召唤"] = "Lêlantos - 龙之召唤",
		["五月二十七 - 龙之召唤"] = "五月二十七 - 龙之召唤",
		["秋天吃栗子 - 龙之召唤"] = "秋天吃栗子 - 龙之召唤",
		["Helios - 龙之召唤"] = "Helios - 龙之召唤",
		["Derek - 龙之召唤"] = "Derek - 龙之召唤",
	},
	["profiles"] = {
		["落星辰 - 龙之召唤"] = {
			["tags"] = {
				"幽默风趣", -- [1]
				"效率", -- [2]
				"飙车司机", -- [3]
				"萌妹", -- [4]
				"磁性嗓音", -- [5]
				"段子手", -- [6]
				"欧皇", -- [7]
				"良心团长", -- [8]
			},
		},
		["叹风尘 - 龙之召唤"] = {
			["tags"] = {
				"幽默风趣", -- [1]
				"效率", -- [2]
				"飙车司机", -- [3]
				"萌妹", -- [4]
				"磁性嗓音", -- [5]
				"段子手", -- [6]
				"欧皇", -- [7]
				"良心团长", -- [8]
			},
		},
		["风尘叹 - 龙之召唤"] = {
			["tags"] = {
				"幽默风趣", -- [1]
				"效率", -- [2]
				"飙车司机", -- [3]
				"萌妹", -- [4]
				"磁性嗓音", -- [5]
				"段子手", -- [6]
				"欧皇", -- [7]
				"良心团长", -- [8]
			},
		},
		["冬天吃栗子 - 龙之召唤"] = {
			["tags"] = {
				"幽默风趣", -- [1]
				"效率", -- [2]
				"飙车司机", -- [3]
				"萌妹", -- [4]
				"磁性嗓音", -- [5]
				"段子手", -- [6]
				"欧皇", -- [7]
				"良心团长", -- [8]
			},
		},
		["莫起风 - 龙之召唤"] = {
			["tags"] = {
				"幽默风趣", -- [1]
				"效率", -- [2]
				"飙车司机", -- [3]
				"萌妹", -- [4]
				"磁性嗓音", -- [5]
				"段子手", -- [6]
				"欧皇", -- [7]
				"良心团长", -- [8]
			},
		},
		["Shop - 龙之召唤"] = {
			["tags"] = {
				"幽默风趣", -- [1]
				"效率", -- [2]
				"飙车司机", -- [3]
				"萌妹", -- [4]
				"磁性嗓音", -- [5]
				"段子手", -- [6]
				"欧皇", -- [7]
				"良心团长", -- [8]
			},
		},
		["Global - 龙之召唤"] = {
			["tags"] = {
				"幽默风趣", -- [1]
				"效率", -- [2]
				"飙车司机", -- [3]
				"萌妹", -- [4]
				"磁性嗓音", -- [5]
				"段子手", -- [6]
				"欧皇", -- [7]
				"良心团长", -- [8]
			},
		},
		["Lêlantos - 龙之召唤"] = {
			["tags"] = {
				"幽默风趣", -- [1]
				"效率", -- [2]
				"飙车司机", -- [3]
				"萌妹", -- [4]
				"磁性嗓音", -- [5]
				"段子手", -- [6]
				"欧皇", -- [7]
				"良心团长", -- [8]
			},
		},
		["五月二十七 - 龙之召唤"] = {
			["tags"] = {
				"幽默风趣", -- [1]
				"效率", -- [2]
				"飙车司机", -- [3]
				"萌妹", -- [4]
				"磁性嗓音", -- [5]
				"段子手", -- [6]
				"欧皇", -- [7]
				"良心团长", -- [8]
			},
		},
		["秋天吃栗子 - 龙之召唤"] = {
			["tags"] = {
				"幽默风趣", -- [1]
				"效率", -- [2]
				"飙车司机", -- [3]
				"萌妹", -- [4]
				"磁性嗓音", -- [5]
				"段子手", -- [6]
				"欧皇", -- [7]
				"良心团长", -- [8]
			},
		},
		["Helios - 龙之召唤"] = {
			["tags"] = {
				"幽默风趣", -- [1]
				"好团长", -- [2]
				"效率", -- [3]
				"飙车司机", -- [4]
				"公正", -- [5]
				"磁性嗓音", -- [6]
				"段子手", -- [7]
				"欧皇", -- [8]
			},
		},
		["Derek - 龙之召唤"] = {
			["tags"] = {
				"幽默风趣", -- [1]
				"效率", -- [2]
				"飙车司机", -- [3]
				"萌妹", -- [4]
				"磁性嗓音", -- [5]
				"段子手", -- [6]
				"欧皇", -- [7]
				"良心团长", -- [8]
			},
		},
	},
}
