
MEETINGHORN_DB = {
	["profileKeys"] = {
		["五月二十七 - 龙之召唤"] = "五月二十七 - 龙之召唤",
		["叹风尘 - 龙之召唤"] = "叹风尘 - 龙之召唤",
		["Helios - 龙之召唤"] = "Helios - 龙之召唤",
		["风尘叹 - 龙之召唤"] = "风尘叹 - 龙之召唤",
		["Nyan - 龙之召唤"] = "Nyan - 龙之召唤",
		["秋天吃栗子 - 龙之召唤"] = "秋天吃栗子 - 龙之召唤",
		["冬天吃栗子 - 龙之召唤"] = "冬天吃栗子 - 龙之召唤",
		["莫起风 - 龙之召唤"] = "莫起风 - 龙之召唤",
		["落星辰 - 龙之召唤"] = "落星辰 - 龙之召唤",
		["Shop - 龙之召唤"] = "Shop - 龙之召唤",
		["Global - 龙之召唤"] = "Global - 龙之召唤",
		["Lêlantos - 龙之召唤"] = "Lêlantos - 龙之召唤",
		["Raging - 龙之召唤"] = "Raging - 龙之召唤",
		["Superss - 龙之召唤"] = "Superss - 龙之召唤",
		["Ophelias - 龙之召唤"] = "Ophelias - 龙之召唤",
		["Derek - 龙之召唤"] = "Derek - 龙之召唤",
	},
	["profiles"] = {
		["五月二十七 - 龙之召唤"] = {
		},
		["叹风尘 - 龙之召唤"] = {
		},
		["Helios - 龙之召唤"] = {
			["window"] = {
				["databroker"] = {
					["y"] = 0,
					["x"] = 154.495300292969,
					["scale"] = 1,
				},
			},
			["cache"] = {
				["cooldown"] = {
					["start"] = 1580475527,
					["duration"] = 50,
				},
				["current"] = {
					["mode"] = "自强",
					["name"] = "影牙城堡",
					["comment"] = "YY自强队伍来T和N， 3=2",
				},
			},
		},
		["风尘叹 - 龙之召唤"] = {
			["window"] = {
				["databroker"] = {
					["y"] = -15.2806396484375,
					["x"] = -181.481582641602,
					["scale"] = 1,
				},
			},
			["cache"] = {
				["cooldown"] = {
					["start"] = 1599231552,
					["duration"] = 50,
				},
				["current"] = {
					["mode"] = "自强",
					["name"] = "辛特兰",
					["comment"] = "JY任务得有来的没",
				},
			},
		},
		["Nyan - 龙之召唤"] = {
		},
		["秋天吃栗子 - 龙之召唤"] = {
		},
		["冬天吃栗子 - 龙之召唤"] = {
			["window"] = {
				["databroker"] = {
					["y"] = -5.59429931640625,
					["x"] = 103.035675048828,
					["scale"] = 1,
				},
			},
			["cache"] = {
				["cooldown"] = {
					["start"] = 1593927904,
					["duration"] = 50,
				},
			},
		},
		["莫起风 - 龙之召唤"] = {
			["window"] = {
				["databroker"] = {
					["y"] = -21.381591796875,
					["x"] = 104.811431884766,
					["scale"] = 1,
				},
			},
			["cache"] = {
				["cooldown"] = {
					["start"] = 1602147597,
					["duration"] = 50,
				},
			},
		},
		["落星辰 - 龙之召唤"] = {
			["window"] = {
				["databroker"] = {
					["y"] = 0,
					["x"] = -99.9001770019531,
					["scale"] = 1,
				},
			},
		},
		["Shop - 龙之召唤"] = {
			["window"] = {
				["databroker"] = {
					["y"] = -48.7711181640625,
					["x"] = -310.889297485352,
					["scale"] = 1,
				},
			},
		},
		["Global - 龙之召唤"] = {
			["cache"] = {
				["cooldown"] = {
					["start"] = 1601301809,
					["duration"] = 50,
				},
			},
			["window"] = {
				["databroker"] = {
					["y"] = 0,
					["x"] = 42.2773742675781,
					["scale"] = 1,
				},
			},
		},
		["Lêlantos - 龙之召唤"] = {
			["window"] = {
				["databroker"] = {
					["y"] = -3.9959716796875,
					["x"] = -138.055938720703,
					["scale"] = 1,
				},
			},
			["cache"] = {
				["cooldown"] = {
					["start"] = 1588602520,
					["duration"] = 50,
				},
			},
		},
		["Raging - 龙之召唤"] = {
		},
		["Superss - 龙之召唤"] = {
		},
		["Ophelias - 龙之召唤"] = {
		},
		["Derek - 龙之召唤"] = {
			["cache"] = {
				["cooldown"] = {
					["start"] = 1601774555,
					["duration"] = 50,
				},
			},
			["window"] = {
				["databroker"] = {
					["y"] = 0,
					["x"] = 116.719116210938,
					["scale"] = 1,
				},
			},
		},
	},
}
