
ThreatClassic2DB = {
	["profileKeys"] = {
		["Helios - 龙之召唤"] = "Helios - 龙之召唤",
		["叹风尘 - 龙之召唤"] = "叹风尘 - 龙之召唤",
		["风尘叹 - 龙之召唤"] = "风尘叹 - 龙之召唤",
		["冬天吃栗子 - 龙之召唤"] = "冬天吃栗子 - 龙之召唤",
		["莫起风 - 龙之召唤"] = "莫起风 - 龙之召唤",
		["Shop - 龙之召唤"] = "Shop - 龙之召唤",
		["Global - 龙之召唤"] = "Global - 龙之召唤",
		["Lêlantos - 龙之召唤"] = "Lêlantos - 龙之召唤",
		["五月二十七 - 龙之召唤"] = "五月二十七 - 龙之召唤",
		["秋天吃栗子 - 龙之召唤"] = "秋天吃栗子 - 龙之召唤",
		["落星辰 - 龙之召唤"] = "落星辰 - 龙之召唤",
		["Derek - 龙之召唤"] = "Derek - 龙之召唤",
	},
	["profiles"] = {
		["Helios - 龙之召唤"] = {
			["frame"] = {
				["position"] = {
					"TOPRIGHT", -- [1]
					nil, -- [2]
					"TOPRIGHT", -- [3]
					-275.555297851563, -- [4]
					-82.6988525390625, -- [5]
				},
			},
			["bar"] = {
				["count"] = 8,
			},
		},
		["叹风尘 - 龙之召唤"] = {
			["bar"] = {
				["count"] = 8,
			},
		},
		["风尘叹 - 龙之召唤"] = {
			["frame"] = {
				["height"] = 174.586441040039,
				["width"] = 328.888275146484,
				["position"] = {
					nil, -- [1]
					nil, -- [2]
					nil, -- [3]
					1034.37475585938, -- [4]
					-71.7982864379883, -- [5]
				},
			},
		},
		["冬天吃栗子 - 龙之召唤"] = {
			["frame"] = {
				["height"] = 157.003936767578,
				["width"] = 225.791305541992,
				["position"] = {
					nil, -- [1]
					nil, -- [2]
					nil, -- [3]
					1016.17163085938, -- [4]
					-83.2155227661133, -- [5]
				},
			},
			["bar"] = {
				["count"] = 8,
			},
		},
		["莫起风 - 龙之召唤"] = {
			["frame"] = {
				["height"] = 161.000137329102,
				["width"] = 273.743316650391,
				["position"] = {
					nil, -- [1]
					nil, -- [2]
					nil, -- [3]
					1005.84399414063, -- [4]
					-58.1611175537109, -- [5]
				},
			},
			["bar"] = {
				["count"] = 8,
			},
		},
		["Shop - 龙之召唤"] = {
			["frame"] = {
				["position"] = {
					"LEFT", -- [1]
					nil, -- [2]
					"LEFT", -- [3]
					29.2207736968994, -- [4]
					55.9440994262695, -- [5]
				},
			},
			["bar"] = {
				["count"] = 8,
			},
		},
		["Global - 龙之召唤"] = {
			["bar"] = {
				["count"] = 6,
			},
			["frame"] = {
				["height"] = 109.849327087402,
				["position"] = {
					nil, -- [1]
					nil, -- [2]
					nil, -- [3]
					943.346252441406, -- [4]
					-92.2063140869141, -- [5]
				},
				["width"] = 263.669250488281,
			},
		},
		["Lêlantos - 龙之召唤"] = {
			["frame"] = {
				["height"] = 129.312850952148,
				["width"] = 324.567840576172,
				["position"] = {
					nil, -- [1]
					nil, -- [2]
					nil, -- [3]
					982.224243164063, -- [4]
					-86.7729415893555, -- [5]
				},
			},
			["bar"] = {
				["count"] = 7,
			},
		},
		["五月二十七 - 龙之召唤"] = {
			["frame"] = {
				["position"] = {
					nil, -- [1]
					nil, -- [2]
					nil, -- [3]
					1132.11804199219, -- [4]
					-82.5174026489258, -- [5]
				},
			},
			["bar"] = {
				["count"] = 8,
			},
		},
		["秋天吃栗子 - 龙之召唤"] = {
			["frame"] = {
				["height"] = 145.0576171875,
				["width"] = 285.803863525391,
				["position"] = {
					"TOPRIGHT", -- [1]
					nil, -- [2]
					"TOPRIGHT", -- [3]
					-267.380920410156, -- [4]
					-84.2958068847656, -- [5]
				},
			},
			["bar"] = {
				["count"] = 8,
			},
		},
		["落星辰 - 龙之召唤"] = {
			["bar"] = {
				["count"] = 8,
			},
			["frame"] = {
				["position"] = {
					"TOP", -- [1]
					nil, -- [2]
					"TOP", -- [3]
					317.741516113281, -- [4]
					-81.3381271362305, -- [5]
				},
			},
		},
		["Derek - 龙之召唤"] = {
			["frame"] = {
				["height"] = 131.429595947266,
				["position"] = {
					nil, -- [1]
					nil, -- [2]
					nil, -- [3]
					1065.31860351563, -- [4]
					-126.039451599121, -- [5]
				},
				["width"] = 210.606918334961,
			},
			["general"] = {
				["hideInPVP"] = false,
			},
			["bar"] = {
				["count"] = 7,
			},
		},
	},
}
