
NETEASE_WARGAME_DB = {
	["profileKeys"] = {
		["Helios - 龙之召唤"] = "Helios - 龙之召唤",
		["叹风尘 - 龙之召唤"] = "叹风尘 - 龙之召唤",
		["秋天吃栗子 - 龙之召唤"] = "秋天吃栗子 - 龙之召唤",
		["冬天吃栗子 - 龙之召唤"] = "冬天吃栗子 - 龙之召唤",
		["莫起风 - 龙之召唤"] = "莫起风 - 龙之召唤",
		["Shop - 龙之召唤"] = "Shop - 龙之召唤",
		["Global - 龙之召唤"] = "Global - 龙之召唤",
		["Lêlantos - 龙之召唤"] = "Lêlantos - 龙之召唤",
		["五月二十七 - 龙之召唤"] = "五月二十七 - 龙之召唤",
		["风尘叹 - 龙之召唤"] = "风尘叹 - 龙之召唤",
		["落星辰 - 龙之召唤"] = "落星辰 - 龙之召唤",
		["Derek - 龙之召唤"] = "Derek - 龙之召唤",
	},
	["profiles"] = {
		["Helios - 龙之召唤"] = {
		},
		["叹风尘 - 龙之召唤"] = {
		},
		["秋天吃栗子 - 龙之召唤"] = {
		},
		["冬天吃栗子 - 龙之召唤"] = {
		},
		["莫起风 - 龙之召唤"] = {
		},
		["Shop - 龙之召唤"] = {
		},
		["Global - 龙之召唤"] = {
		},
		["Lêlantos - 龙之召唤"] = {
		},
		["五月二十七 - 龙之召唤"] = {
		},
		["风尘叹 - 龙之召唤"] = {
		},
		["落星辰 - 龙之召唤"] = {
		},
		["Derek - 龙之召唤"] = {
		},
	},
}
